lexicon.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-10 Thu 15:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The kcats Programming Language Lexicon</title>
<meta name="author" content="Skyrod Vactai" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="doc-custom.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">The kcats Programming Language Lexicon</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga617384">1. Standard library source and documentation</a>
<ul>
<li><a href="#org666911b">1.1. Comparison</a></li>
<li><a href="#orgfc3da18">1.2. Stack Ops</a>
<ul>
<li><a href="#org960089c">1.2.1. Motion</a></li>
</ul>
</li>
<li><a href="#org2016852">1.3. Program execution</a></li>
<li><a href="#orgb213e11">1.4. Collections</a>
<ul>
<li><a href="#orgb5822fe">1.4.1. Associations</a></li>
<li><a href="#orgafc2456">1.4.2. Sets</a></li>
<li><a href="#org550dd82">1.4.3. Generators</a></li>
</ul>
</li>
<li><a href="#orgf5a0269">1.5. Dictionary modules</a></li>
<li><a href="#org4495514">1.6. Math</a></li>
<li><a href="#orga1ad13e">1.7. Serialization</a></li>
<li><a href="#org908dee5">1.8. Boolean logic</a></li>
<li><a href="#org36fa4fe">1.9. Byte encoding and decoding</a></li>
<li><a href="#org03a2d32">1.10. Strings</a></li>
<li><a href="#org289a3ef">1.11. Error handling</a></li>
<li><a href="#orgf95f04f">1.12. Methods</a></li>
<li><a href="#org5c11fb0">1.13. Pipes</a></li>
<li><a href="#orgaf150de">1.14. Crypto</a></li>
<li><a href="#orgbb8a371">1.15. Time and date</a></li>
<li><a href="#org4ed1352">1.16. Nested Environments</a>
<ul>
<li><a href="#org6c1655d">1.16.1. Debugging</a>
<ul>
<li><a href="#orge15863a">1.16.1.1. Examples</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd061511">1.17. <span class="todo TODO">TODO</span> Functional environment</a></li>
</ul>
</li>
<li><a href="#orgbe193e1">2. Issues</a>
<ul>
<li><a href="#org460d4ae">2.1. <span class="done DONE">DONE</span> Get rid of platform-specific definitions</a></li>
<li><a href="#orgd867e7a">2.2. <span class="done DONE">DONE</span> fix evaluate</a></li>
<li><a href="#orga9e6e8c">2.3. <span class="todo TODO">TODO</span> merkle tree functions</a></li>
<li><a href="#org5b439fa">2.4. <span class="done CANCELED">CANCELED</span> Make taker/dropper more flexible</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga617384" class="outline-2">
<h2 id="orga617384"><span class="section-number-2">1.</span> Standard library source and documentation</h2>
<div class="outline-text-2" id="text-1">
</div>
