lexicon.org
** Comparison
Words that help compare one item to another, with concepts of =equal=, =greater=, =less= etc.

#+begin_src kcats :tangle src/kcats/core/compare-builtins.kcats :mkdirp yes
  [= [[spec [[item item] [boolean]]]
      [examples [[[1 2 =] [[]] "Different Numbers are not equal"]
                 [[1 1 =] [yes] "Same numbers are equal"]
                 [[1 1.0 =] [yes] "Same value integer and float are equal"]
                 [[[1] [] =]  [[]] "Number and Nothing are unequal"]
                 [[[1 [[]]] [1 [[]]] =] [yes] "Same nested list with numbers are equal"]
                 [[[1.0 ["foo"]] [1.0 ["foo"]] =] [yes] "Same nested list with string are equal"]
                 [["hi" "hi" =] [yes] "Same strings are equal"]
                 [["hi" "there" =] [[]] "Different strings are unequal"]
                 [[\h \h =] [yes] "Same characters are equal"]
                 [[\h \i =] [[]] "Different characters are unequal"]
                 [["hi" encode "hi" encode =] [yes] "Same bytes are equal"]
                 [["hi" encode "there" encode =] [[]] "Different bytes are unequal"]
                 [[[] yes =] [[]] "Different booleans unequal"]
                 [[[1.0 ["foo"]] [1.0 ["bar"]] =]  [[]] "Nested lists with different strings are unequal"]
                 [[[] [] =] [yes] "'Nothing' is equal to itself"]
                 [[[] [] association =] [yes] "List/Association empty container types are equal"]
                 [[[] [] set =] [yes] "List/Set empty container types are equal"]
                 [[[[a b]] [[a b]] association =] [[]] "Nonempty List/Association types are unequal"]
                 [[[1 2 3] set [3 1 2] set =] [yes] "Sets constructed from different lists are equal"]]]]]

  [compare [[spec [[item item] [word]]]
            [examples [[["a" "b" compare] [[less] unwrap] "string lexicographical order with single character inequality"]
                       [["a" "a" compare] [[equal] unwrap] "string lexicographical order with single character equality"]
                       [[1 1 compare] [[equal] unwrap] "Same integer compares equal"]
                       [[2 1 compare] [[greater] unwrap] "Integer order inequality"]
                       [[1 [foo] unwrap compare] [[less] unwrap] "Integer/list order inequality"]
                       [[1 "foo" encode compare] [[less] unwrap] "Integer/byte order inequality"]
                       [[[foo] unwrap "foo" encode compare] [[less] unwrap] "Word/string order inequality"]
                       [["foo" encode "foo" compare] [[less] unwrap] "String order equaltiy"]
                       [[[] [[]] unwrap compare] [[equal] unwrap] "Unwrapped Nothing value equality"]
                       [[[] [1] rest compare] [[equal] unwrap] "Nothing/emptied container equality"]]]]]

  ;; TODO these should be in terms of compare and not limited to numbers
  [< [[spec [[number number] [boolean]]]
      [examples [[[1 2 <] [yes] "Integer is less"]
                 [[2.2 1.1 <] [[]] "Float is not less"]
                 [[1 2.2 <] [yes] "Integer/float is less"]
                 [[1.1 1.1 <] [[]] "Equal floats is not less"]]]]]

  [> [[spec [[number number] [boolean]]]
      [examples [[[2 1 >] [yes] "Integer is greater"]
                 [[1.1 2.2 >] [[]] "Float is not greater"]
                 [[2.2 1 >] [yes] "Integer/float is greater"]
                 [[1.1 1.1 >] [[]] "Equal floats is not greater"]]]]]

  [<= [[spec [[number number] [boolean]]]
       [examples [[[1 2 <=] [yes] "Integer is less/equal"]
                  [[2.2 1.1 <=] [[]] "Float is not less/equal"]
                  [[1 2.2 <=] [yes] "Integer/float is less/equal"]
                  [[1.1 1.1 <=] [yes] "Equal floats is less/equal"]]]]]

  [>= [[spec [[number number] [boolean]]]
       [examples [[[2 1 >=] [yes] "Integer is greater/equal"]
                  [[1.1 2.2 >=] [[]] "Float is not greater/equal"]
                  [[2.2 1 >=] [yes] "Integer/float is greater/equal"]
                  [[1.1 1.1 >=] [yes] "Equal floats is greater/equal"]]]]]
#+end_src

#+begin_src kcats :tangle src/kcats/core/compare.kcats :mkdirp yes
  [min [[spec [[number number] [number]]]
        [definition [[<] [] [swap] if drop]]
        [examples [[[2 3 min] [2] "Smaller of two positive integers"]
                   [[-5 -3 min] [-5] "Smaller of two negative integers"]
                   [[0.3 0.2 min] [0.2] "Smaller of two floats <1"]]]]]

  [max [[spec [[number number] [number]]]
        [definition [[>] [] [swap] if drop]]
        [examples [[[2 3 max] [3] "Larger of two positive integers"]
                   [[-5 -3 max] [-3] "Larger of two positive integers"]
                   [[0.3 0.2 max] [0.3] "Larger of two floats <1"]]]]]
#+end_src
