lexicon.html
<div id="outline-container-org666911b" class="outline-3">
<h3 id="org666911b"><span class="section-number-3">1.1.</span> Comparison</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Words that help compare one item to another, with concepts of <code>equal</code>, <code>greater</code>, <code>less</code> etc.
</p>

<div class='tangle-wrapper' data-tangle='src/kcats/core/compare-builtins.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>= <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
    <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Different Numbers are not equal"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[</span>1 1 =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Same numbers are equal"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[</span>1 1.0 =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Same value integer and float are equal"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[[</span>1<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]</span> =<span class="org-kcats-brackets">]</span>  <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Number and Nothing are unequal"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[[</span>1 <span class="org-kcats-brackets">[[]]]</span> <span class="org-kcats-brackets">[</span>1 <span class="org-kcats-brackets">[[]]]</span> =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Same nested list with numbers are equal"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[[</span>1.0 <span class="org-kcats-brackets">[</span><span class="org-string">"foo"</span><span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>1.0 <span class="org-kcats-brackets">[</span><span class="org-string">"foo"</span><span class="org-kcats-brackets">]]</span> =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Same nested list with string are equal"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[</span><span class="org-string">"hi"</span> <span class="org-string">"hi"</span> =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Same strings are equal"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[</span><span class="org-string">"hi"</span> <span class="org-string">"there"</span> =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Different strings are unequal"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[</span>\h \h =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Same characters are equal"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[</span>\h \i =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Different characters are unequal"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[</span><span class="org-string">"hi"</span> encode <span class="org-string">"hi"</span> encode =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Same bytes are equal"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[</span><span class="org-string">"hi"</span> encode <span class="org-string">"there"</span> encode =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Different bytes are unequal"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[[]</span> yes =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Different booleans unequal"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[[</span>1.0 <span class="org-kcats-brackets">[</span><span class="org-string">"foo"</span><span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>1.0 <span class="org-kcats-brackets">[</span><span class="org-string">"bar"</span><span class="org-kcats-brackets">]]</span> =<span class="org-kcats-brackets">]</span>  <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Nested lists with different strings are unequal"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[[]</span> <span class="org-kcats-brackets">[]</span> =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"'Nothing' is equal to itself"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[[]</span> <span class="org-kcats-brackets">[]</span> association =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"List/Association empty container types are equal"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[[]</span> <span class="org-kcats-brackets">[]</span> set =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"List/Set empty container types are equal"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[[[</span>a b<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[[</span>a b<span class="org-kcats-brackets">]]</span> association =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Nonempty List/Association types are unequal"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[[</span>1 2 3<span class="org-kcats-brackets">]</span> set <span class="org-kcats-brackets">[</span>3 1 2<span class="org-kcats-brackets">]</span> set =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Sets constructed from different lists are equal"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>compare <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>word<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"a"</span> <span class="org-string">"b"</span> compare<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>less<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"string lexicographical order with single character inequality"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span><span class="org-string">"a"</span> <span class="org-string">"a"</span> compare<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>equal<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"string lexicographical order with single character equality"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span>1 1 compare<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>equal<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Same integer compares equal"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span>2 1 compare<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>greater<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Integer order inequality"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span>1 <span class="org-kcats-brackets">[</span>foo<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> compare<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>less<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Integer/list order inequality"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span>1 <span class="org-string">"foo"</span> encode compare<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>less<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Integer/byte order inequality"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[</span>foo<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> <span class="org-string">"foo"</span> encode compare<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>less<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Word/string order inequality"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> encode <span class="org-string">"foo"</span> compare<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>less<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"String order equaltiy"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-function-name">unwrap</span> compare<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>equal<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Unwrapped Nothing value equality"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[]</span> <span class="org-kcats-brackets">[</span>1<span class="org-kcats-brackets">]</span> <span class="org-function-name">rest</span> compare<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>equal<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Nothing/emptied container equality"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">TODO these should be in terms of compare and not limited to numbers</span>
<span class="org-kcats-brackets">[</span>&lt; <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
    <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 &lt;<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Integer is less"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[</span>2.2 1.1 &lt;<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Float is not less"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[</span>1 2.2 &lt;<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Integer/float is less"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[</span>1.1 1.1 &lt;<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Equal floats is not less"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>&gt; <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
    <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>2 1 &gt;<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Integer is greater"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[</span>1.1 2.2 &gt;<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Float is not greater"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[</span>2.2 1 &gt;<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Integer/float is greater"</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[[</span>1.1 1.1 &gt;<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Equal floats is not greater"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>&lt;= <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
     <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 &lt;=<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Integer is less/equal"</span><span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[[</span>2.2 1.1 &lt;=<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Float is not less/equal"</span><span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[[</span>1 2.2 &lt;=<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Integer/float is less/equal"</span><span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[[</span>1.1 1.1 &lt;=<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Equal floats is less/equal"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>&gt;= <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
     <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>2 1 &gt;=<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Integer is greater/equal"</span><span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[[</span>1.1 2.2 &gt;=<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Float is not greater/equal"</span><span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[[</span>2.2 1 &gt;=<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Integer/float is greater/equal"</span><span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[[</span>1.1 1.1 &gt;=<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Equal floats is greater/equal"</span><span class="org-kcats-brackets">]]]]]</span>
</pre>
</div></div>

<div class='tangle-wrapper' data-tangle='src/kcats/core/compare.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>min <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>number<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>&lt;<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">if</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]</span>
      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>2 3 min<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2<span class="org-kcats-brackets">]</span> <span class="org-string">"Smaller of two positive integers"</span><span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[[</span>-5 -3 min<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>-5<span class="org-kcats-brackets">]</span> <span class="org-string">"Smaller of two negative integers"</span><span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[[</span>0.3 0.2 min<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>0.2<span class="org-kcats-brackets">]</span> <span class="org-string">"Smaller of two floats &lt;1"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>max <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>number<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>&gt;<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">if</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]</span>
      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>2 3 max<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3<span class="org-kcats-brackets">]</span> <span class="org-string">"Larger of two positive integers"</span><span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[[</span>-5 -3 max<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>-3<span class="org-kcats-brackets">]</span> <span class="org-string">"Larger of two positive integers"</span><span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[[</span>0.3 0.2 max<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>0.3<span class="org-kcats-brackets">]</span> <span class="org-string">"Larger of two floats &lt;1"</span><span class="org-kcats-brackets">]]]]]</span>
</pre>
</div></div>
</div>
</div>
