lexicon.org
** Stack Ops
#+begin_src kcats :tangle src/kcats/core/stack-builtins.kcats :mkdirp yes
  [drop [[spec [[item] []]]
         [examples [[[1 2 3 drop] [1 2] "Drop integer on ToS"]
                    [[1 2 3 [a b c] drop] [1 2 3] "Drop list on ToS"]]]]]

  [clone [[spec [[[item a]]
                 [[item a] [item a]]]]
          [examples [[[1 2 3 clone] [1 2 3 3] "Clone integer on ToS"]]]]]

  [evert [[spec [[list] [list *]]]
          [examples [[[1 2 3 [4 5 6] evert] [6 5 4 [3 2 1]] "Evert a list of integers with the stack"]]]]]
#+end_src

#+begin_src kcats :tangle src/kcats/core/stack.kcats :mkdirp yes
  [clonedown [[spec [[[item a] [item b]]
                     [[item a] [item b] [item b]]]]
              [definition [swap clone float]]
              [examples [[[1 2 3 clonedown] [1 2 2 3] "Clone the 2nd item on the stack"]]]]]

  [clonedeep [[spec [[[item a] [item b] [item c]]
                     [[item a] [item b] [item c] [item c]]]]
              [definition [[clonedown] dip]]
              [examples [[[1 2 3 4 clonedeep] [1 2 2 3 4] "Clone the 3rd item on the stack"]]]]]

  [over [[spec [[[item a] [item b]]
                [[item b] [item a] [item b]]]]
         [definition [clonedown swap]]
         [examples [[[1 2 3 over] [1 2 3 2] "Copy the 2nd item to ToS"]]]]]

  [under [[spec [[[item a] [item b]]
                 [[item a] [item b] [item a]]]]
          [definition [clone sink]]
          [examples [[[1 2 3 under] [1 3 2 3] "Copy the ToS to the 2nd item"]]]]]

  [dropdown [[spec [[[item a] [item b]] [[item b]]]]
             [definition [swap drop]]
             [examples [[[1 2 3 dropdown] [1 3] "Drop the 2nd item"]]]]]

  [dropdeep [[spec [[[item a] [item b] [item c]] [[item a] [item b]]]]
             [definition [float drop]]
             [examples [[[1 2 3 dropdeep] [2 3] "Drop the 3rd item"]]]]]

  [snapshot [[spec [[] [list]]]
             [doc "Save the whole stack as a list on the stack"]
             [definition [[] evert clone evert unwrap]]
             [examples [[[1 2 3 snapshot] [1 2 3 [3 2 1]] "Copy the stack to ToS"]
                        [[snapshot] [[]] "Copy stack to ToS when stack is empty"]]]]]

  [restore [[spec [[list] [*]]]
            [definition [evert drop]]
            [examples [[["x" "y" [1 2 3] restore] [3 2 1] "Replace stack with list"]
                       [[[] restore] [] "Replace stack with empty list"]]]]]
#+end_src
