lexicon.html
<div id="outline-container-orgfc3da18" class="outline-3">
<h3 id="orgfc3da18"><span class="section-number-3">1.2.</span> Stack Ops</h3>
<div class="outline-text-3" id="text-1-2">
<div class='tangle-wrapper' data-tangle='src/kcats/core/stack-builtins.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 <span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 2<span class="org-kcats-brackets">]</span> <span class="org-string">"Drop integer on ToS"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[</span>1 2 3 <span class="org-kcats-brackets">[</span>a b c<span class="org-kcats-brackets">]</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-string">"Drop list on ToS"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>item a<span class="org-kcats-brackets">]]</span>
               <span class="org-kcats-brackets">[[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item a<span class="org-kcats-brackets">]]]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 <span class="org-builtin">clone</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 2 3 3<span class="org-kcats-brackets">]</span> <span class="org-string">"Clone integer on ToS"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-builtin">evert</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>list<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>list *<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 <span class="org-kcats-brackets">[</span>4 5 6<span class="org-kcats-brackets">]</span> <span class="org-builtin">evert</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>6 5 4 <span class="org-kcats-brackets">[</span>3 2 1<span class="org-kcats-brackets">]]</span> <span class="org-string">"Evert a list of integers with the stack"</span><span class="org-kcats-brackets">]]]]]</span>
</pre>
</div></div>

<div class='tangle-wrapper' data-tangle='src/kcats/core/stack.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>clonedown <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]]</span>
                   <span class="org-kcats-brackets">[[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]]]]</span>
            <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span> <span class="org-builtin">clone</span> <span class="org-builtin">float</span><span class="org-kcats-brackets">]]</span>
            <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 clonedown<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 2 2 3<span class="org-kcats-brackets">]</span> <span class="org-string">"Clone the 2nd item on the stack"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>clonedeep <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item c<span class="org-kcats-brackets">]]</span>
                   <span class="org-kcats-brackets">[[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item c<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item c<span class="org-kcats-brackets">]]]]</span>
            <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>clonedown<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]]</span>
            <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 4 clonedeep<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 2 2 3 4<span class="org-kcats-brackets">]</span> <span class="org-string">"Clone the 3rd item on the stack"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>over <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]]</span>
              <span class="org-kcats-brackets">[[</span>item b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]]]]</span>
       <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>clonedown <span class="org-builtin">swap</span><span class="org-kcats-brackets">]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 over<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 2 3 2<span class="org-kcats-brackets">]</span> <span class="org-string">"Copy the 2nd item to ToS"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>under <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]]</span>
               <span class="org-kcats-brackets">[[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item a<span class="org-kcats-brackets">]]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span> <span class="org-builtin">sink</span><span class="org-kcats-brackets">]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 under<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 3 2 3<span class="org-kcats-brackets">]</span> <span class="org-string">"Copy the ToS to the 2nd item"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-builtin">dropdown</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[[</span>item b<span class="org-kcats-brackets">]]]]</span>
           <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]</span>
           <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 <span class="org-builtin">dropdown</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 3<span class="org-kcats-brackets">]</span> <span class="org-string">"Drop the 2nd item"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>dropdeep <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item c<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]]]]</span>
           <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-builtin">float</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]</span>
           <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 dropdeep<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2 3<span class="org-kcats-brackets">]</span> <span class="org-string">"Drop the 3rd item"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-builtin">snapshot</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>doc <span class="org-string">"Save the whole stack as a list on the stack"</span><span class="org-kcats-brackets">]</span>
           <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[]</span> <span class="org-builtin">evert</span> <span class="org-builtin">clone</span> <span class="org-builtin">evert</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]]</span>
           <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 <span class="org-builtin">snapshot</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 2 3 <span class="org-kcats-brackets">[</span>3 2 1<span class="org-kcats-brackets">]]</span> <span class="org-string">"Copy the stack to ToS"</span><span class="org-kcats-brackets">]</span>
                      <span class="org-kcats-brackets">[[</span><span class="org-builtin">snapshot</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Copy stack to ToS when stack is empty"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>restore <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>list<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-builtin">evert</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"x"</span> <span class="org-string">"y"</span> <span class="org-kcats-brackets">[</span>1 2 3<span class="org-kcats-brackets">]</span> restore<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3 2 1<span class="org-kcats-brackets">]</span> <span class="org-string">"Replace stack with list"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[]</span> restore<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]</span> <span class="org-string">"Replace stack with empty list"</span><span class="org-kcats-brackets">]]]]]</span>
</pre>
</div></div>
</div>
