lexicon.org
*** Motion
These words change the order of items on the stack.

#+begin_src kcats :tangle src/kcats/core/motion-builtins.kcats :mkdirp yes
  [swap [[spec [[[item a] [item b]]
                [[item b] [item a]]]]
         [examples [[[1 2 3 swap] [1 3 2] "Swap top two items"]]]]]

  [swapdown [[spec [[[item a] [item b] [item c]]
                    [[item a] [item c] [item b]]]]
             [examples [[[1 2 3 swapdown] [2 1 3] "Swap 2nd and 3rd items"]]]]]

  [float [[spec [[[item a] [item b] [item c]]
                 [[item c] [item a] [item b]]]]
          [examples [[[1 2 3 float] [2 3 1] "Move 3rd item to ToS"]]]]]

  [sink [[spec [[[item a] [item b] [item c]]
                [[item b] [item c] [item a]]]]
         [examples [[[1 2 3 sink] [3 1 2] "Move ToS to 3rd item"]]]]]
#+end_src

#+begin_src kcats :tangle src/kcats/core/motion.kcats :mkdirp yes
  [flip [[spec [[[item a] [item b] [item c]]
                 [[item c] [item b] [item a]]]]
          [definition [float swapdown]]
          [examples [[[1 2 3 flip] [3 2 1] "Swap ToS and 3rd item"]]]]]
#+end_src
