lexicon.html
<div id="outline-container-org960089c" class="outline-4">
<h4 id="org960089c"><span class="section-number-4">1.2.1.</span> Motion</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
These words change the order of items on the stack.
</p>

<div class='tangle-wrapper' data-tangle='src/kcats/core/motion-builtins.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]]</span>
              <span class="org-kcats-brackets">[[</span>item b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item a<span class="org-kcats-brackets">]]]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 <span class="org-builtin">swap</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 3 2<span class="org-kcats-brackets">]</span> <span class="org-string">"Swap top two items"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-builtin">swapdown</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item c<span class="org-kcats-brackets">]]</span>
                  <span class="org-kcats-brackets">[[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item c<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]]]]</span>
           <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 <span class="org-builtin">swapdown</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2 1 3<span class="org-kcats-brackets">]</span> <span class="org-string">"Swap 2nd and 3rd items"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-builtin">float</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item c<span class="org-kcats-brackets">]]</span>
               <span class="org-kcats-brackets">[[</span>item c<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]]]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 <span class="org-builtin">float</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2 3 1<span class="org-kcats-brackets">]</span> <span class="org-string">"Move 3rd item to ToS"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-builtin">sink</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item c<span class="org-kcats-brackets">]]</span>
              <span class="org-kcats-brackets">[[</span>item b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item c<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item a<span class="org-kcats-brackets">]]]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 <span class="org-builtin">sink</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3 1 2<span class="org-kcats-brackets">]</span> <span class="org-string">"Move ToS to 3rd item"</span><span class="org-kcats-brackets">]]]]]</span>
</pre>
</div></div>

<div class='tangle-wrapper' data-tangle='src/kcats/core/motion.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>flip <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item c<span class="org-kcats-brackets">]]</span>
               <span class="org-kcats-brackets">[[</span>item c<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item a<span class="org-kcats-brackets">]]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-builtin">float</span> <span class="org-builtin">swapdown</span><span class="org-kcats-brackets">]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 flip<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3 2 1<span class="org-kcats-brackets">]</span> <span class="org-string">"Swap ToS and 3rd item"</span><span class="org-kcats-brackets">]]]]]</span>
</pre>
</div></div>
</div>
</div>
</div>
