lexicon.org
** Program execution
#+begin_src kcats :tangle src/kcats/core/execute-builtins.kcats :mkdirp yes
  [execute [[spec [[program] [*]]]
            [examples [[[[1 2 +] execute] [3] "Execute a program"]
                       [[1 2 [] execute] [1 2] "Execute an empty program"]
                       [[1 2 [[+] execute] execute] [3] "Nested execution"]]]]]

  [branch [[spec [[[program no-branch]
                   [program yes-branch]
                   [item condition]]
                  [*]]]
           [examples [[[5 yes [3 *] [4 +] branch] [15] "Branch on true condition"]
                      [[6 [] [3 *] [4 +] branch] [10] "Branch on false condition"]]]]]

  [recur [[spec [[[program rec2]
                  [program rec1]
                  [program yes-branch]
                  [program pred]]
                 [*]]]
          [examples [[[3
                       [1 <=] [] [clone dec] [execute *]
                       recur]
                      [6]
                     "Recur with reduction"]]]]]

  [loop [[spec [[program [item flag]] [*]]]
         [examples [[[10 yes [-2 * clone 50 <] loop] [160] "Looping"]
                    [[10 [] [-2 * clone 50 <] loop] [10] "Looping with false initial condition is no-op"]]]]]


  [dip [[spec [[program [item a]] [[item a] *]]]
        [examples [[[1 8 [inc] dip] [2 8] "Dipping a program under ToS"]
                   [[1 2 [dec] unwrap
                     [+] dip] [3 [dec] unwrap] "A bare word on stack is left intact and not executed"]]]]]

  ;; TODO: This depends on `if` so might need to move elsewhere, maybe Methods?
  [decide [[spec [[[list test-expr-pairs]] [*]]]
           [doc "Takes a list of choices (pairs of test, program) and
                  executes the first program whose test passes. if none
                  pass, returns 'nothing'. Stack is reset between
                  testing conditions."]
           [examples [[[5 [[[3 =] ["three"]]
                           [[5 =] ["five"]]
                           [[7 =] ["seven"]]
                           [[yes] ["something else"]]]
                        decide]
                       [5 "five"] "Decide with matching condition"]

                      [[9 [[[3 =] ["three"]]
                           [[5 =] ["five"]]
                           [[7 =] ["seven"]]
                           [[yes] ["something else"]]]
                        decide]

                       [9 "something else"] "Decide with matching default condition"]

                      [[9 [[[3 =] ["three"]]
                           [[5 =] ["five"]]
                           [[7 =] ["seven"]]]
                        decide]
                       [9 []] "Decide with no matching condition"]]]]]
#+end_src

#+begin_src kcats :tangle src/kcats/core/execute.kcats :mkdirp yes
  [decorate [[spec [[list program] [program]]]
             [definition [[[wrap] dip put] step]]
             [examples [[[[1 inc] [foo bar] decorate] [[[[1 inc] foo] bar]]
                         "Decorate a program with a series of modifiers"]]]]]

  [decorated [[spec [[list program] [*]]]
              [definition [decorate execute]]
              [examples [[[1 2 [+] [bail shield] decorated] [1 2 3] "Execute a decorated program"]]]]]

  ;; TODO: implement as axiom (which would depend on 'restore' which should also be axiom?)
  [shield [[spec [[program]
                  [item]]]
           [doc "Runs program keeping top of stack produced but protects existing items from being consumed."]
           [definition [[snapshot] dip inject first]]
           [examples [[[1 2 3 [=] shield] [1 2 3 []] "Execute a program shielding the stack from consumption"]]]]]

  [shielddown [[spec [[program item]
                      [item]]]
               [definition [shield dropdown]]
               [examples [[[1 2 3 [=] shielddown] [1 2 []] "Execute a program consuming only the original ToS"]]]]]

  [shielddeep [[spec [[[program p] [item consumed] [item consumed]]
                      [[item result]]]]
               [definition [shield [drop drop] dip]]
               [examples [[[1 2 3 [+ +] shielddeep] [1 6] "Execute a program consuming only the original top 2 items"]]]]]

  [if [[spec [[[program no-branch]
               [program yes-branch]
               [program condition]]
              [*]]]
       [definition [[shield] dipdown branch]]
       [examples [[[5 [5 =] [3 *] [4 +] if] [15] "Conditional with true predicate"]
                  [[6 [5 =] [3 *] [4 +] if] [10] "Conditional with false predicate"]]]]]

  [when [[spec [[[program yes-branch]
                 [program condition]]
                [*]]]
         [definition [[] if]]
         [examples [[[3 [odd?] [inc] when] [4] "Conditional with no false branch and true predicate"]
                    [[3 [even?] [inc] when] [3] "Conditional with no false branch and false predicate"]]]]]

  ;; TODO: drop dependency on 'decorated'
  [dipdown [[spec [[program
                    [item a]
                    [item b]]
                   [[item a] [item b] *]]]
            [definition [[dip dip] decorated]]
            [examples [[[1 2 3 [inc] dipdown] [2 2 3] "Dip program under top two items"]]]]]

  [dipdeep [[spec [[program
                    [item a]
                    [item b]
                    [item c]]
                   [[item a] [item b] [item c] *]]]
            [definition [[dipdown dip] decorated]]
            [examples [[[1 2 3 4 [inc] dipdeep] [2 2 3 4] "Dip program under top 3 items"]]]]]

  [dive [[spec [[program [item a]] [item [item a] *]]]
         [definition [dip swap]]
         [examples [[[4 5 6 [+] dive] [6 9] "Dip program and move result to ToS"]]]]]

  [divedown [[spec [[program [item a] [item b]]
                    [item [item a] [item b] *]]]
             [definition [dipdown float]]
             [examples [[[5 6 7 8 [+] divedown] [7 8 11] "Dip under top 2 items and move result to ToS"]]]]]

  [divedeep [[spec [[program [item a] [item b] [item c]]
                    [item [item a] [item b] [item c] *]]]
             [definition [wrap [divedown] join dip swap]]
             [examples [[[4 5 6 7 8 [+] divedeep] [6 7 8 9] "Dip under top 3 items and move result to ToS"]]]]]

  [inject [[spec [[program list]
                  [list]]]
           [doc "Inject the quoted program into the list below
                       it (runs the program with the list as its
                       stack).  Does not affect the rest of the stack."]
           [definition [swap evert take dip evert]]
           [examples [[[1 2 3 [4 5 6] [* +] inject] [1 2 3 [26]] "Inject program into list as if it's the stack"]]]]]

  [while [[spec [[[program body]
                  [program pred]]
                 [*]]]
          [definition [swap [shield] decorate ;; add shield to the pred program
                       clone dipdown ;; run it on the previous ToS
                       join loop]]
          [examples [[[3 [0 >] [clone dec] while] [3 2 1 0] "While loop"]]]]]

  [until [[spec [[[program body]
                  [program pred]]
                 [*]]]
          [definition [swap ;; pred body
                       [not] join ;; reverse logic
                       [shield] decorate ;; add shield to the pred program -> pred body
                       join ;; [body ..  pred]
                       yes swap ;; run at least once
                       loop]]
          [examples [[[2 [even?] [inc] until] [4] "Until loop"]]]]]

  [times [[spec [[[integer howmany]
                  [program body]]
                 [*]]]
          [definition [swap
                       [dec] swap put [dip] join ;; build [dec body dip]
                       [0 >] swap
                       while
                       drop]]
          [examples [[[[5] 3 times] [5 5 5] "Can create an item multiple times"]
                     [[[5] 0 times] [] "0 times is a no-op"]
                     [[1 1 [inc swap] 3 times] [3 2] "Can run a program multiple times"]]]]]

  [primrec [[spec [[[program rec1]
                    [program exit]
                    [number repetitions]]
                   [*]]]
            [definition [[execute] swap join ;; add execute to rec1 to be recurs rec2
                         [[drop] swap join] dip ;; add drop to exit condition
                         [[zero?]] dipdown  ;; put the condition on bottom
                         [[clone dec]] dip ;; add the r1
                         recur]] ;; now its generic recur
            [examples [[[5 [1] [*] primrec] [120] "Simple countup loop"]]]]]

  [bail [[spec [[program] [*]]]
         [definition [[swap] [execute] [drop] if]]
         [examples [[[[] [inc] bail] [[]] "Can bail on invalid input"]
                    [[1 [inc] bail] [2] "Valid input doesn't bail"]]]]]
#+end_src
