lexicon.html
<div id="outline-container-org2016852" class="outline-3">
<h3 id="org2016852"><span class="section-number-3">1.3.</span> Program execution</h3>
<div class="outline-text-3" id="text-1-3">
<div class='tangle-wrapper' data-tangle='src/kcats/core/execute-builtins.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 +<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3<span class="org-kcats-brackets">]</span> <span class="org-string">"Execute a program"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span>1 2 <span class="org-kcats-brackets">[]</span> <span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 2<span class="org-kcats-brackets">]</span> <span class="org-string">"Execute an empty program"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span>1 2 <span class="org-kcats-brackets">[[</span>+<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3<span class="org-kcats-brackets">]</span> <span class="org-string">"Nested execution"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-preprocessor">branch</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program no-<span class="org-preprocessor">branch</span><span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[</span>program yes-<span class="org-preprocessor">branch</span><span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[</span>item condition<span class="org-kcats-brackets">]]</span>
                <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>5 yes <span class="org-kcats-brackets">[</span>3 *<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>4 +<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">branch</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>15<span class="org-kcats-brackets">]</span> <span class="org-string">"Branch on true condition"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[</span>6 <span class="org-kcats-brackets">[]</span> <span class="org-kcats-brackets">[</span>3 *<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>4 +<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">branch</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>10<span class="org-kcats-brackets">]</span> <span class="org-string">"Branch on false condition"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-preprocessor">recur</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program rec2<span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[</span>program rec1<span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[</span>program yes-<span class="org-preprocessor">branch</span><span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[</span>program pred<span class="org-kcats-brackets">]]</span>
               <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>3
                     <span class="org-kcats-brackets">[</span>1 &lt;=<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span> dec<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span> *<span class="org-kcats-brackets">]</span>
                     <span class="org-preprocessor">recur</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[</span>6<span class="org-kcats-brackets">]</span>
                   <span class="org-string">"Recur with reduction"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-preprocessor">loop</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program <span class="org-kcats-brackets">[</span>item flag<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>10 yes <span class="org-kcats-brackets">[</span>-2 * <span class="org-builtin">clone</span> 50 &lt;<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">loop</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>160<span class="org-kcats-brackets">]</span> <span class="org-string">"Looping"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[</span>10 <span class="org-kcats-brackets">[]</span> <span class="org-kcats-brackets">[</span>-2 * <span class="org-builtin">clone</span> 50 &lt;<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">loop</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>10<span class="org-kcats-brackets">]</span> <span class="org-string">"Looping with false initial condition is no-op"</span><span class="org-kcats-brackets">]]]]]</span>


<span class="org-kcats-brackets">[</span><span class="org-preprocessor">dip</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program <span class="org-kcats-brackets">[</span>item a<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[[</span>item a<span class="org-kcats-brackets">]</span> *<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 8 <span class="org-kcats-brackets">[</span>inc<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2 8<span class="org-kcats-brackets">]</span> <span class="org-string">"Dipping a program under ToS"</span><span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[[</span>1 2 <span class="org-kcats-brackets">[</span>dec<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span>
                   <span class="org-kcats-brackets">[</span>+<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3 <span class="org-kcats-brackets">[</span>dec<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"A bare word on stack is left intact and not executed"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">TODO: This depends on `if` so might need to move elsewhere, maybe Methods?</span>
<span class="org-kcats-brackets">[</span>decide <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>list test-expr-pairs<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>doc <span class="org-string">"Takes a list of choices (pairs of test, program) and</span>
<span class="org-string">                executes the first program whose test passes. if none</span>
<span class="org-string">                pass, returns 'nothing'. Stack is reset between</span>
<span class="org-string">                testing conditions."</span><span class="org-kcats-brackets">]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>5 <span class="org-kcats-brackets">[[[</span>3 =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"three"</span><span class="org-kcats-brackets">]]</span>
                         <span class="org-kcats-brackets">[[</span>5 =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"five"</span><span class="org-kcats-brackets">]]</span>
                         <span class="org-kcats-brackets">[[</span>7 =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"seven"</span><span class="org-kcats-brackets">]]</span>
                         <span class="org-kcats-brackets">[[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"something else"</span><span class="org-kcats-brackets">]]]</span>
                      decide<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[</span>5 <span class="org-string">"five"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Decide with matching condition"</span><span class="org-kcats-brackets">]</span>

                    <span class="org-kcats-brackets">[[</span>9 <span class="org-kcats-brackets">[[[</span>3 =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"three"</span><span class="org-kcats-brackets">]]</span>
                         <span class="org-kcats-brackets">[[</span>5 =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"five"</span><span class="org-kcats-brackets">]]</span>
                         <span class="org-kcats-brackets">[[</span>7 =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"seven"</span><span class="org-kcats-brackets">]]</span>
                         <span class="org-kcats-brackets">[[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"something else"</span><span class="org-kcats-brackets">]]]</span>
                      decide<span class="org-kcats-brackets">]</span>

                     <span class="org-kcats-brackets">[</span>9 <span class="org-string">"something else"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Decide with matching default condition"</span><span class="org-kcats-brackets">]</span>

                    <span class="org-kcats-brackets">[[</span>9 <span class="org-kcats-brackets">[[[</span>3 =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"three"</span><span class="org-kcats-brackets">]]</span>
                         <span class="org-kcats-brackets">[[</span>5 =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"five"</span><span class="org-kcats-brackets">]]</span>
                         <span class="org-kcats-brackets">[[</span>7 =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"seven"</span><span class="org-kcats-brackets">]]]</span>
                      decide<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[</span>9 <span class="org-kcats-brackets">[]]</span> <span class="org-string">"Decide with no matching condition"</span><span class="org-kcats-brackets">]]]]]</span>
</pre>
</div></div>

<div class='tangle-wrapper' data-tangle='src/kcats/core/execute.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>decorate <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>list program<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>program<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[</span><span class="org-function-name">wrap</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-function-name">put</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]</span>
           <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 inc<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>foo bar<span class="org-kcats-brackets">]</span> decorate<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[[[</span>1 inc<span class="org-kcats-brackets">]</span> foo<span class="org-kcats-brackets">]</span> bar<span class="org-kcats-brackets">]]</span>
                       <span class="org-string">"Decorate a program with a series of modifiers"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>decorated <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>list program<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
            <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>decorate <span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]]</span>
            <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 <span class="org-kcats-brackets">[</span>+<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>bail <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> decorated<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-string">"Execute a decorated program"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">TODO: implement as axiom (which would depend on 'restore' which should also be axiom?)</span>
<span class="org-kcats-brackets">[</span><span class="org-preprocessor">shield</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>doc <span class="org-string">"Runs program keeping top of stack produced but protects existing items from being consumed."</span><span class="org-kcats-brackets">]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span><span class="org-builtin">snapshot</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-preprocessor">inject</span> <span class="org-function-name">first</span><span class="org-kcats-brackets">]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 <span class="org-kcats-brackets">[</span>=<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 2 3 <span class="org-kcats-brackets">[]]</span> <span class="org-string">"Execute a program shielding the stack from consumption"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-preprocessor">shielddown</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program item<span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
             <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-preprocessor">shield</span> <span class="org-builtin">dropdown</span><span class="org-kcats-brackets">]]</span>
             <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 <span class="org-kcats-brackets">[</span>=<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shielddown</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 2 <span class="org-kcats-brackets">[]]</span> <span class="org-string">"Execute a program consuming only the original ToS"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-preprocessor">shielddeep</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program p<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item consumed<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item consumed<span class="org-kcats-brackets">]]</span>
                    <span class="org-kcats-brackets">[[</span>item result<span class="org-kcats-brackets">]]]]</span>
             <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-preprocessor">shield</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]]</span>
             <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 <span class="org-kcats-brackets">[</span>+ +<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shielddeep</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 6<span class="org-kcats-brackets">]</span> <span class="org-string">"Execute a program consuming only the original top 2 items"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-preprocessor">if</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program no-<span class="org-preprocessor">branch</span><span class="org-kcats-brackets">]</span>
             <span class="org-kcats-brackets">[</span>program yes-<span class="org-preprocessor">branch</span><span class="org-kcats-brackets">]</span>
             <span class="org-kcats-brackets">[</span>program condition<span class="org-kcats-brackets">]]</span>
            <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
     <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span><span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dipdown</span> <span class="org-preprocessor">branch</span><span class="org-kcats-brackets">]]</span>
     <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>5 <span class="org-kcats-brackets">[</span>5 =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3 *<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>4 +<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>15<span class="org-kcats-brackets">]</span> <span class="org-string">"Conditional with true predicate"</span><span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[[</span>6 <span class="org-kcats-brackets">[</span>5 =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3 *<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>4 +<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>10<span class="org-kcats-brackets">]</span> <span class="org-string">"Conditional with false predicate"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>when <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program yes-<span class="org-preprocessor">branch</span><span class="org-kcats-brackets">]</span>
               <span class="org-kcats-brackets">[</span>program condition<span class="org-kcats-brackets">]]</span>
              <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[]</span> <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>3 <span class="org-kcats-brackets">[</span>odd?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>inc<span class="org-kcats-brackets">]</span> when<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>4<span class="org-kcats-brackets">]</span> <span class="org-string">"Conditional with no false branch and true predicate"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[</span>3 <span class="org-kcats-brackets">[</span>even?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>inc<span class="org-kcats-brackets">]</span> when<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3<span class="org-kcats-brackets">]</span> <span class="org-string">"Conditional with no false branch and false predicate"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">TODO: drop dependency on 'decorated'</span>
<span class="org-kcats-brackets">[</span><span class="org-preprocessor">dipdown</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program
                  <span class="org-kcats-brackets">[</span>item a<span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]]</span>
                 <span class="org-kcats-brackets">[[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]</span> *<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span><span class="org-preprocessor">dip</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]</span> decorated<span class="org-kcats-brackets">]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 <span class="org-kcats-brackets">[</span>inc<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dipdown</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2 2 3<span class="org-kcats-brackets">]</span> <span class="org-string">"Dip program under top two items"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>dipdeep <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program
                  <span class="org-kcats-brackets">[</span>item a<span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[</span>item c<span class="org-kcats-brackets">]]</span>
                 <span class="org-kcats-brackets">[[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item c<span class="org-kcats-brackets">]</span> *<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span><span class="org-preprocessor">dipdown</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]</span> decorated<span class="org-kcats-brackets">]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 4 <span class="org-kcats-brackets">[</span>inc<span class="org-kcats-brackets">]</span> dipdeep<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2 2 3 4<span class="org-kcats-brackets">]</span> <span class="org-string">"Dip program under top 3 items"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-preprocessor">dive</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program <span class="org-kcats-brackets">[</span>item a<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>item <span class="org-kcats-brackets">[</span>item a<span class="org-kcats-brackets">]</span> *<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-preprocessor">dip</span> <span class="org-builtin">swap</span><span class="org-kcats-brackets">]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>4 5 6 <span class="org-kcats-brackets">[</span>+<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>6 9<span class="org-kcats-brackets">]</span> <span class="org-string">"Dip program and move result to ToS"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-preprocessor">divedown</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program <span class="org-kcats-brackets">[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]]</span>
                  <span class="org-kcats-brackets">[</span>item <span class="org-kcats-brackets">[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]</span> *<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-preprocessor">dipdown</span> <span class="org-builtin">float</span><span class="org-kcats-brackets">]]</span>
           <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>5 6 7 8 <span class="org-kcats-brackets">[</span>+<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">divedown</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>7 8 11<span class="org-kcats-brackets">]</span> <span class="org-string">"Dip under top 2 items and move result to ToS"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>divedeep <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program <span class="org-kcats-brackets">[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item c<span class="org-kcats-brackets">]]</span>
                  <span class="org-kcats-brackets">[</span>item <span class="org-kcats-brackets">[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item c<span class="org-kcats-brackets">]</span> *<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-function-name">wrap</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">divedown</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span> <span class="org-preprocessor">dip</span> <span class="org-builtin">swap</span><span class="org-kcats-brackets">]]</span>
           <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>4 5 6 7 8 <span class="org-kcats-brackets">[</span>+<span class="org-kcats-brackets">]</span> divedeep<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>6 7 8 9<span class="org-kcats-brackets">]</span> <span class="org-string">"Dip under top 3 items and move result to ToS"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-preprocessor">inject</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program list<span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>doc <span class="org-string">"Inject the quoted program into the list below</span>
<span class="org-string">                     it (runs the program with the list as its</span>
<span class="org-string">                     stack).  Does not affect the rest of the stack."</span><span class="org-kcats-brackets">]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span> <span class="org-builtin">evert</span> <span class="org-function-name">take</span> <span class="org-preprocessor">dip</span> <span class="org-builtin">evert</span><span class="org-kcats-brackets">]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 <span class="org-kcats-brackets">[</span>4 5 6<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>* +<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">inject</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 2 3 <span class="org-kcats-brackets">[</span>26<span class="org-kcats-brackets">]]</span> <span class="org-string">"Inject program into list as if it's the stack"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-preprocessor">while</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program body<span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[</span>program pred<span class="org-kcats-brackets">]]</span>
               <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> decorate <span class="org-comment-delimiter">;; </span><span class="org-comment">add shield to the pred program</span>
                     <span class="org-builtin">clone</span> <span class="org-preprocessor">dipdown</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">run it on the previous ToS</span>
                     <span class="org-function-name">join</span> <span class="org-preprocessor">loop</span><span class="org-kcats-brackets">]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>3 <span class="org-kcats-brackets">[</span>0 &gt;<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span> dec<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">while</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3 2 1 0<span class="org-kcats-brackets">]</span> <span class="org-string">"While loop"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-preprocessor">until</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program body<span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[</span>program pred<span class="org-kcats-brackets">]]</span>
               <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">pred body</span>
                     <span class="org-kcats-brackets">[</span>not<span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">reverse logic</span>
                     <span class="org-kcats-brackets">[</span><span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> decorate <span class="org-comment-delimiter">;; </span><span class="org-comment">add shield to the pred program -&gt; pred body</span>
                     <span class="org-function-name">join</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">[body ..  pred]</span>
                     yes <span class="org-builtin">swap</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">run at least once</span>
                     <span class="org-preprocessor">loop</span><span class="org-kcats-brackets">]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>2 <span class="org-kcats-brackets">[</span>even?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>inc<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">until</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>4<span class="org-kcats-brackets">]</span> <span class="org-string">"Until loop"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-preprocessor">times</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>integer howmany<span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[</span>program body<span class="org-kcats-brackets">]]</span>
               <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span>
                     <span class="org-kcats-brackets">[</span>dec<span class="org-kcats-brackets">]</span> <span class="org-builtin">swap</span> <span class="org-function-name">put</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">build [dec body dip]</span>
                     <span class="org-kcats-brackets">[</span>0 &gt;<span class="org-kcats-brackets">]</span> <span class="org-builtin">swap</span>
                     <span class="org-preprocessor">while</span>
                     <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>5<span class="org-kcats-brackets">]</span> 3 <span class="org-preprocessor">times</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>5 5 5<span class="org-kcats-brackets">]</span> <span class="org-string">"Can create an item multiple times"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[[</span>5<span class="org-kcats-brackets">]</span> 0 <span class="org-preprocessor">times</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]</span> <span class="org-string">"0 times is a no-op"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[</span>1 1 <span class="org-kcats-brackets">[</span>inc <span class="org-builtin">swap</span><span class="org-kcats-brackets">]</span> 3 <span class="org-preprocessor">times</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3 2<span class="org-kcats-brackets">]</span> <span class="org-string">"Can run a program multiple times"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>primrec <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program rec1<span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[</span>program exit<span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[</span>number repetitions<span class="org-kcats-brackets">]]</span>
                 <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> <span class="org-builtin">swap</span> <span class="org-function-name">join</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">add execute to rec1 to be recurs rec2</span>
                       <span class="org-kcats-brackets">[[</span><span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span> <span class="org-builtin">swap</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">add drop to exit condition</span>
                       <span class="org-kcats-brackets">[[</span>zero?<span class="org-kcats-brackets">]]</span> <span class="org-preprocessor">dipdown</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">put the condition on bottom</span>
                       <span class="org-kcats-brackets">[[</span><span class="org-builtin">clone</span> dec<span class="org-kcats-brackets">]]</span> <span class="org-preprocessor">dip</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">add the r1</span>
                       <span class="org-preprocessor">recur</span><span class="org-kcats-brackets">]]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">now its generic recur</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>5 <span class="org-kcats-brackets">[</span>1<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]</span> primrec<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>120<span class="org-kcats-brackets">]</span> <span class="org-string">"Simple countup loop"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>bail <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span><span class="org-builtin">swap</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[]</span> <span class="org-kcats-brackets">[</span>inc<span class="org-kcats-brackets">]</span> bail<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Can bail on invalid input"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[</span>1 <span class="org-kcats-brackets">[</span>inc<span class="org-kcats-brackets">]</span> bail<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2<span class="org-kcats-brackets">]</span> <span class="org-string">"Valid input doesn't bail"</span><span class="org-kcats-brackets">]]]]]</span>
</pre>
</div></div>
</div>
</div>
