lexicon.org
** Collections
#+begin_src kcats :tangle src/kcats/core/collections-builtins.kcats :mkdirp yes
  [join [[spec [[sized sized] [sized]]]
          [examples [[[["a" "b"] ["c" "d"] join] [["a" "b" "c" "d"]] "Join two collections of strings"]
                     [["ab" "cd" join] ["abcd"] "Join two strings"]
                     [["ab" encode "cd" encode join "abcd" encode =] [yes] "Two joined byte seqs are equal to the combined literal"]
                     [[[[a b] [c d]] association [[e f] [a g]] join] [[[a g] [c d] [e f]] association] "Joining list+assoc -> assoc, 2nd arg keys take priority"]
                     [[[[e f] [a g]] [[a b] [c d]] association  join] [[[a b] [e f] [c d]] association] "Joining assoc+list -> assoc, 2nd arg keys take priority"]
                     [[[a b c d] set [a e] join] [[a b c d e] set] "Join set with list -> set"]
                     [[[a e] [a b c d] set join] [[a b c d e] set] "Join list with set -> set"]
                     [["" "" join] [""] "Join two empty strings -> empty string"]
                     [["" [1 2 3] join] [[1 2 3]] "Join empty string + list -> list (identity)"]
                     [["a" [\b \c] join] ["abc"] "Join a string with a list of chars -> string"]
                     [[[\b \c] "a" join] ["bca"] "Join a list of chars with string -> string"]
                     [["" [\b \c] join] ["bc"] "Join an empty string with list of chars -> string"]
                     [["abc" [\d \e 12] join] [[\a \b \c \d \e 12]] "Join a string with list -> list"]
                     [["abc" [] join] ["abc"] "Join a string with empty list -> string"]
                     [["" [] join] [""] "Join empty string with empty list -> string"]
                     [[[1 2 3] set [4 4 4] join] [[1 2 3 4] set] "Join set with list -> set"]]]]]

   [put [[spec [[item receptacle] [receptacle]]]
         [examples [[[[] 1 put] [[1]] "Put integer into empty list"]
                    [[[1 2 3] 4 put] [[1 2 3 4]] "Put integer into list"]
                    [["foo" \d put] ["food"] "Put character into string"]
                    [["foo" encode 32 put string] ["foo "] "Put byte into byte array"]]]]]

   [count [[spec [[sized]
                  [number]]]
           [examples [[[["a" "b" "cd"] count] [3] "Count list of strings"]
                      [["abcd" count] [4] "Count chars in string"]
                      [["abcd" encode count] [4] "Count bytes in byte array"]
                      [[[[a b] [c d]] association count] [2] "Count entries in association"]]]]]

  [second [[spec [[ordered] [item]]]
            [examples [[[[4 5 6] second] [5] "Get second item of list"]
                       [["foo" second [\o]] "Get second item of string"]
                       [[[] second] [[]] "Get second item of empty list -> Nothing"]]]]]

   [last [[spec [[ordered] [item]]]
          [examples [[[[3 4 5 6] last] [6] "Get last item of list"]
                     [["foo" last [\o]] "Get last item of string"]
                     [[[] last] [[]] "Get last item of empty list -> Nothing"]]]]]

   [step [[spec [[program dispenser] [*]]]
          [examples [[[1 [2 3 4] [*] step] [24] "Step through numbers doing arithmetic"]
                     [[1 [] [*] step] [1] "Stepping through empty list is no-op"]]]]]

   [take [[spec [[dispenser] [item dispenser]]]
          [examples [[[["a" "b" "c"] take] [["b" "c"] "a"] "Take a string from a list"]
                     [[[1 2 3] take] [[2 3] 1] "Take a number from a list"]
                     [[[[a "foo"] [b "foo"] [c "foo"]] take dropdown second] ["foo"] "Take an entry from association is nondeterministic"]
                     [[[1 3 5 7 9] set take dropdown odd?] [yes] "Take item from set is nondeterministic"]]]]]

   [pop [[spec [[ordered] [item ordered]]]
         [examples [[[["a" "b" "c"] pop] [["a" "b"] "c"] "Pop last string from list"]
                    [[[1 2 3] pop] [[1 2] 3] "Pop last number from list"]]]]]

   [wrap [[spec [[item] [list]]]
          [examples [[[1 wrap] [[1]] "Wrap a number"]
                     [[[1 2] wrap] [[[1 2]]] "Wrap a list"]]]]]

   [unwrap [[spec [[list] [*]]]
            [examples [[[[1] unwrap] [1] "Unwrap a list of one item"]
                       [[[] unwrap] [] "Unwrap an empty list is a no-op"]
                       [[[1 2 3] unwrap] [1 2 3] "Unwrap a list of multiple items"]]]]]

   [reverse [[spec [[ordered] [ordered]]]
             [examples [[[[1 2 3] reverse] [[3 2 1]] "Reverse a list"]
                        [["123" reverse] ["321"] "Reverse a string"]]]]]

   [slice [[spec [[integer integer ordered] [ordered]]]
           [examples [[["foobar" 0 3 slice] ["foo"] "Slice a string with valid indices"]
                      [["foobar" 0 7 slice] [[]] "Slice a string with index past end -> Nothing"]
                      [["foobar" encode 0 3 slice] ["foo" encode] "Slice a byte array with valid indices"]
                      [[[a b c d e] 0 3 slice] [[a b c]] "Slice a list with valid indices"]]]]]

   [cut [[spec [[integer sized] [list]]]
         [definition [[[[[count] dive] shield slice]
                       [0 swap slice]]
                      [execute] map
                      [drop drop] dip unwrap]]
         [examples [[["abcdefghijklmnopqrstuvwxyz" 5 cut] ["fghijklmnopqrstuvwxyz" "abcde"] "Cut string at index"]]]]]

   [empty [[spec [[sized] [sized]]]
           [examples [[["foo" empty] [""] "Create empty container from string"]
                      [["foo" encode empty] ["" encode] "Create empty container from byte array"]
                      [[[1 2 3] empty] [[]] "Create empty container from list"]
                      [[[[a b] [c d]] association empty] [[] association] "Create empty container from association"]
                      [[[1 2 3] set empty] [[] set] "Create empty container from set"]]]]]

   [range [[spec [[integer integer integer] [list]]]
           [examples [[[1 5 1 range] [[1 2 3 4]] "Create integer range with step of 1"]
                      [[3 13 3 range] [[3 6 9 12]] "Create integer range with step greater than 1"]]]]]

   [empty? [[spec [[item] [boolean]]]
            [examples [[[[] empty?] [yes] "Empty list is empty"]
                       [[1 empty?] [[]] "Number is not empty"]
                       [["" empty?] [yes] "Empty string is empty"]
                       [[[foo] empty?] [[]] "Non-empty list is not empty"]]]]]

   [pad [[spec [[[item padding] [integer newsize] sized] [sized]]]
         [definition [[[[count] shield] dive -] dip
                      swap repeat
                      swap join]]
         [examples [[[[1 2 3] 5 0 pad] [[0 0 1 2 3]] "Pad a list at front, to given size"]
                    [[[1 2 3 4 5 6] 5 0 pad] [[1 2 3 4 5 6]] "Padding a list to smaller than original size is a no-op"]]]]]

   [list? [[spec [[item] [boolean]]]
           [examples [[[[1] list?] [yes] "A list is a list"]
                      [[[] list?] [yes] "An empty list is a list"]
                      [[5 list?] [[]] "A number is not a list"]
                      [["foo" list?] [[]] "A string is not a list"]
                      [[[] association list?] [[]] "An empty association is not a list"]]]]]

   [sort-indexed [[spec [[sized] [sized]]]
                  [examples [[[[[1 1] [3 3] [2 2]] sort-indexed] [[1 2 3]] "Sorting a list of key-value pairs by key"]]]]]

   [pack [[spec [[[list template]] [list]]]
              [examples [[["x" [foo] [bar] unwrap
                           [*2 [*1 x **2] c d 1 2 3] pack]
                          ["x" [[foo] [bar x foo] c d 1 2 3]]
                         "Packing values from the stack, into a template"]]]]]
#+end_src

#+begin_src kcats kcats :tangle src/kcats/core/collections.kcats :mkdirp yes
  [something? [[spec [[item] [boolean]]] 
               [definition [empty? not]]
               [examples [[[1 something?] [yes] "A number is something"]
                          [[[] something?] [[]] "Empty list is not something"]
                          [["" something?] [[]] "Empty string is not something"]]]]]

  [first [[spec [[ordered] [item]]]
          [definition [take dropdown]]
          [examples [[[[4 5 6] first] [4] "Get the first item of a list"]
                     [["foo" first] [\f] "The first item of a string is the first character"]
                     [[[] first] [[]] "The first item of an empty list is Nothing"]]]]]

  [rest [[spec [[sized] [sized]]]
         [definition [take drop]]
         [examples [[[[1 2 3] rest] [[2 3]] "Take rest of list"]
                    [["foo" rest] ["oo"] "Take rest of string"]]]]]

  [butlast [[spec [[sized] [sized]]]
            [definition [pop drop]]
            [examples [[[[1 2 3] butlast] [[1 2]] "Take all but last of list"]]]]]

  [prepend [[spec [[item sized]
                   [sized]]]
            [definition [wrap swap join]]
            [examples [[[[1 2] 3 prepend] [[3 1 2]] "Prepend to list"]
                       [["oo" \f prepend] ["foo"] "Prepend to string"]]]]]

  [every? [[spec [[program sized] [boolean]]]
           [definition [[swap]
                        [[take] dip clone [float [shielddown] dive] dive
                         []
                         [drop every?]
                         [dropdown dropdown] if]
                        [drop drop yes] if]]
           [examples [[[[2 4 6] [even?] every?] [yes] "Every number matches predicate"]
                      [[[2 4 5] [even?] every?] [[]] "Not every number matches predicate"]
                      [[[] [[]] every?] [yes] "Every item in empty list matches any predicate"]
                      [[[2 4 6] [] every?] [yes] "Every item in list matches empty predicate"]
                      [[11 [2 4 6] [+ odd?] every?] [11 yes] "Stack is shielded from predicate"]
                      [[12 [[even?] [positive?] [3 mod 0 =]] [execute] every?] [12 yes] "Can check list of predicates with execute predicate"]]]]]

  [any? [[spec [[program sized] boolean]]
         [definition [[swap]
                      [[take] dip clone [float [shielddown] dive] dive
                       []
                       [dropdown dropdown]
                       [drop any?] if]
                      [drop drop []] if]]
         [examples [[[[2 4 6] [even?] any?] [yes] "Any number matches predicate"]
                    [[[3 5 7] [even?] any?] [[]] "No number matches predicate"]
                    [[[] [yes] any?] [[]] "No item in empty list matches any predicate"]
                    [[[[] 2 4 6] [] any?] [2] "Empty predicate returns first truthy item"]
                    [[11 [3 5 6] [+ odd?] any?] [11 yes] "Stack is shielded from predicate"]
                    [[-15 [[even?] [positive?] [3 mod 0 =]] [execute] any?] [-15 yes] "Can check list of predicates with execute predicate"]]]]]

  [map [[spec [[program sized] [list]]]
        [definition [[] sink ;; put empty results below list
                     [swap [*1 shielddown] dip swap put] pack
                     step]]

        [examples [[[[1 2 3] [inc] map] [[2 3 4]] "Pass each item through a program"]

                   [[1 [1 2 3] [+] map] [1 [2 3 4]] "Program has access to rest of stack"]
                   [[7 9 [1 2 3] [+ *] map] [7 9 [70 77 84]] "Stack is shielded from mapping program"]
                   [[7 9 [1 2 3] [drop drop] map] [7 9 [7 7 7]] "Result of program can be lower stack items"]

                   [[7 9 [+] [] map] [7 9 [+]] "Empty program is a no-op"]]]]]

  [filter [[spec [[program sized] [list]]]
           [definition [[] sink ;; put empty results below list
                        [swap [*1 shield] dip swap
                         [] [drop swap put] [drop dropdown]
                         if]
                        pack
                        step]]
           [examples [[[[1 2 3] [odd?] filter] [[1 3]] "Filter a list with predicate"]
                      [[[2 4 6] [odd?] filter] [[]] "Filter with predicate that matches no items"]
                      [[33 [1 2 3] [33 + odd?] filter] [33 [2]] "Filter predicate uses existing stack items"]]]]]

  [sort [[spec [[program sized] [list]]]
         [definition [[clone **1 pair] pack
                      map sort-indexed]]
         [examples [[[[1 3 2] [] sort] [[1 2 3]] "Sort a list of numbers"]
                    [[["Carol" "Alice" "bob"] [] sort] [["Alice" "Bob" "Carol"]] "Sort a list of strings"]
                    [[["Charlie" "Alice" "bob"] [count] sort] [["Bob" "Alice" "Charlie"]] "Sort list of strings by length"]]]]]

  [repeat [[spec [[[integer howmany]
                   item]
                  [list]]]
           [definition [[] sink [wrap [put] join] dip times]]
           [examples [[["hi" 3 repeat] [["hi" "hi" "hi"]] "Create a list of repeated items"]]]]]

  [indexed [[spec [[list] [list]]]
            [definition [[count] shield [0] dip 1 range swap zip]]
            [examples [[[[a b c] indexed] [[[0 a] [1 b] [2 c]]] "Index a list"]]]]]

  [indexer [[spec [[] [program]]]
            [definition [0 [[generate] dive [[pair] shielddown [inc] dip] bail]]]
            [examples [[[[a b c] [indexer] assemble] [[[0 a] [1 b] [2 c]]] "Index a generator"]]]]]

  [indexof [[spec [[item list] [item]]]
            [definition [[indexer] dip
                         ;; use wrap so we can find index of words,
                         ;; otherwise the word gets executed
                         [second wrap =] swap wrap put [[swapdown] dip] inject
                         keep generate first]]
            [examples [[[[[a b c] [take] [c] unwrap indexof] shield] [2] "Get the index of first matching item"]
                       [[[[a b c] [take] [d] unwrap indexof] shield] [[]] "No matching item -> Nothing"]
                       [[[[a b c d c e] [take] [c] unwrap indexof] shield] [2] "Multiple matches returns index of first match"]]]]]

  [interpose [[spec [[item ordered] [ordered]]]
              [definition [[] flip
                           [swap pair join [pop] shield] step
                           drop pop drop]]
              [examples [[[[foo bar baz] "hi" interpose] [[foo "hi" bar "hi" baz]] "Interpose string between words"]
                         [[[] "hi" interpose] [[]] "Empty list is a no-op"]
                         [[[foo] "hi" interpose] [[foo]] "Single item list is a no-op"]]]]]

  [starts? [[spec [[[ordered prefix] [ordered target]] [boolean]]]
            [definition [[[zip [unwrap =] every?] ;; the items at matching indexes are equal
                          [[count] both >=]] ;; the prefix is shorter than the target
                         [execute] every? 
                         dropdown dropdown]] ;; drop the originals
            [examples [[["abcd" "ab" starts?] [yes] "String starts with matching string"]
                       [["abcd" "" starts?] [yes] "String starts with empty string"]
                       [["" "ab" starts?] [[]] "Empty string doesn't start with a string"]
                       [["abcd" "bb" starts?] [[]] "String doesn't start with non-matching string"]
                       [[[1 2 3 4] [1 2] starts?] [yes] "List starts with matching list"]]]]]

  [ends? [[spec [[ordered ordered] [boolean]]]
          [definition [[reverse] both starts?]]
          [examples [[["abcd" "cd" ends?] [yes] "String ends with matching string"]
                     [["abcd" "" ends?] [yes] "String ends with empty string"]
                     [["abcd" "bb" ends?] [[]] "String doesn't end with non-matching string"]
                     [[[1 2 3 4] [3 4] ends?] [yes] "List ends with matching list"]]]]]

  [pair [[spec [[item item] [list]]]
         [definition [[wrap] dip put]]
         [examples [[[1 2 pair] [[1 2]] "Pair up two numbers into a list"]
                    [[["hi"] ["there" "foo"] pair] [[["hi"] ["there" "foo"]]] "Pair up two lists into a new list"]]]]]

  [pair? [[spec [[item] [boolean]]]
          [definition [[count 2 =] [drop drop []] recover]]
          [examples [[["ab" pair?] [yes] "2-character string is a pair"]
                     [[[a b] pair?] [yes] "2-item list is a pair"]
                     [["abc" pair?] [[]] "3-character string is not a pair"]
                     [[[] pair?] [[]] "Nothing is not a pair"]
                     [[7 pair?] [[]] "Number is not a pair"]]]]]

  [triplet [[spec [[item item] [list]]]
            [definition [[pair] dip put]]
            [examples [[[1 2 3 triplet] [[1 2 3]] "Make a 3-item list from 3 stack items"]
                       [[["hi"] ["there" "foo"] ["bar"] triplet] [[["hi"] ["there" "foo"] ["bar"]]] "Make a 3-item list from smaller lists"]]]]]

  [both? [[spec [[program item item] [boolean]]]
          [definition [sink pair swap every?]]
          [examples [[[1 2 [odd?] both?] [[]] "Test two items for predicate when not all match"]
                     [[1 3 [odd?] both?] [yes] "Test two items for predicate when all match"]]]]]

  [both [[spec [[program [item a] [item b]] [item item]]]
         [definition [[pair] dip step]]
         [examples [[[1 2 [inc] both] [2 3] "Run program on two stack items"]]]]]

  [walk [[spec [[[program item-transform] list] [list]]]
         [definition [[list? not] swap
                      [[] swap]
                      [[join] join step wrap]
                      recur unwrap]]
         [examples [[[[1 2 [3 [4 5] 6]] [inc wrap] walk] [[2 3 [4 [5 6] 7]]] "Walk a nested list"]
                    [[[1 2 [3 [4 5] 6]] [clone inc pair] walk] [[1 2 2 3 [3 4 [4 5 5 6] 6 7]]] "Walk a nested list and splice results"]]]]]

  ; [template [[spec [[[list template]] [list]]]
  ;            [definition [[snapshot
  ;                          ;; build a map of word like *1, *2 etc to values on the stack
  ;                          ;; Do a separate entry for **1, **2, etc which means to splice the value
  ;                          [count] shield inc 1 1 swapdown range
  ;                          ["*" "**"] [swap [string join word] map] map
  ;                          unwrap join dropdown 
  ;                          [clone [wrap] map swap join] dip swap zip association] dive

  ;                         ;; save copy of template
  ;                         [clone] dive

  ;                         [[swap get] swap prepend wrap
  ;                          [shield 
  ;                           [] [dropdown] [drop wrap] if] join
  ;                          walk] dip
  ;                         ;; find the highest index placeholder
  ;                         flatten set 0 swap 
  ;                         [[word?]
  ;                          ;; try to parse as a placeholder and get the index
  ;                          [string ["*" starts?] [take drop] while
  ;                           [number max] [drop drop] recover] 
  ;                          [drop] if] step
  ;                         ;; drop that many items from the stack
  ;                         [drop] swap float [times] dip]]
  ;            [examples [[["x" [foo] [bar] unwrap
  ;                         [*2 [*1 x **2] c d 1 2 3] template]
  ;                        ["x" [[foo] [bar x foo] c d 1 2 3] ]]]]]]

  [flatten [[spec [[list] [list]]]
            [definition [[] swap [list? not] [put] [] [step] recur]]
            [examples [[[[a b [c [d e] f] g] flatten] [[a b c d e f g]] "Flatten a nested list"]]]]]
#+end_src
