lexicon.html
<div id="outline-container-orgb213e11" class="outline-3">
<h3 id="orgb213e11"><span class="section-number-3">1.4.</span> Collections</h3>
<div class="outline-text-3" id="text-1-4">
<div class='tangle-wrapper' data-tangle='src/kcats/core/collections-builtins.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span><span class="org-function-name">join</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>sized sized<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>sized<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span><span class="org-string">"a"</span> <span class="org-string">"b"</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"c"</span> <span class="org-string">"d"</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"a"</span> <span class="org-string">"b"</span> <span class="org-string">"c"</span> <span class="org-string">"d"</span><span class="org-kcats-brackets">]]</span> <span class="org-string">"Join two collections of strings"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[</span><span class="org-string">"ab"</span> <span class="org-string">"cd"</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"abcd"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Join two strings"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[</span><span class="org-string">"ab"</span> encode <span class="org-string">"cd"</span> encode <span class="org-function-name">join</span> <span class="org-string">"abcd"</span> encode =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Two joined byte seqs are equal to the combined literal"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> association <span class="org-kcats-brackets">[[</span>e f<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>a g<span class="org-kcats-brackets">]]</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[[</span>a g<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>e f<span class="org-kcats-brackets">]]</span> association<span class="org-kcats-brackets">]</span> <span class="org-string">"Joining list+assoc -&gt; assoc, 2nd arg keys take priority"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[[[</span>e f<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>a g<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> association  <span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>e f<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> association<span class="org-kcats-brackets">]</span> <span class="org-string">"Joining assoc+list -&gt; assoc, 2nd arg keys take priority"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[[</span>a b c d<span class="org-kcats-brackets">]</span> set <span class="org-kcats-brackets">[</span>a e<span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>a b c d e<span class="org-kcats-brackets">]</span> set<span class="org-kcats-brackets">]</span> <span class="org-string">"Join set with list -&gt; set"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[[</span>a e<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>a b c d<span class="org-kcats-brackets">]</span> set <span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>a b c d e<span class="org-kcats-brackets">]</span> set<span class="org-kcats-brackets">]</span> <span class="org-string">"Join list with set -&gt; set"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[</span><span class="org-string">""</span> <span class="org-string">""</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">""</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Join two empty strings -&gt; empty string"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[</span><span class="org-string">""</span> <span class="org-kcats-brackets">[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1 2 3<span class="org-kcats-brackets">]]</span> <span class="org-string">"Join empty string + list -&gt; list (identity)"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[</span><span class="org-string">"a"</span> <span class="org-kcats-brackets">[</span>\b \c<span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"abc"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Join a string with a list of chars -&gt; string"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[[</span>\b \c<span class="org-kcats-brackets">]</span> <span class="org-string">"a"</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"bca"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Join a list of chars with string -&gt; string"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[</span><span class="org-string">""</span> <span class="org-kcats-brackets">[</span>\b \c<span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"bc"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Join an empty string with list of chars -&gt; string"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[</span><span class="org-string">"abc"</span> <span class="org-kcats-brackets">[</span>\d \e 12<span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>\a \b \c \d \e 12<span class="org-kcats-brackets">]]</span> <span class="org-string">"Join a string with list -&gt; list"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[</span><span class="org-string">"abc"</span> <span class="org-kcats-brackets">[]</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"abc"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Join a string with empty list -&gt; string"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[</span><span class="org-string">""</span> <span class="org-kcats-brackets">[]</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">""</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Join empty string with empty list -&gt; string"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[[</span>1 2 3<span class="org-kcats-brackets">]</span> set <span class="org-kcats-brackets">[</span>4 4 4<span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1 2 3 4<span class="org-kcats-brackets">]</span> set<span class="org-kcats-brackets">]</span> <span class="org-string">"Join set with list -&gt; set"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span><span class="org-function-name">put</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item receptacle<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>receptacle<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[]</span> 1 <span class="org-function-name">put</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1<span class="org-kcats-brackets">]]</span> <span class="org-string">"Put integer into empty list"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[[</span>1 2 3<span class="org-kcats-brackets">]</span> 4 <span class="org-function-name">put</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1 2 3 4<span class="org-kcats-brackets">]]</span> <span class="org-string">"Put integer into list"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> \d <span class="org-function-name">put</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"food"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Put character into string"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> encode 32 <span class="org-function-name">put</span> string<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"foo "</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Put byte into byte array"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span><span class="org-function-name">count</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>sized<span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[</span>number<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span><span class="org-string">"a"</span> <span class="org-string">"b"</span> <span class="org-string">"cd"</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">count</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3<span class="org-kcats-brackets">]</span> <span class="org-string">"Count list of strings"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[</span><span class="org-string">"abcd"</span> <span class="org-function-name">count</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>4<span class="org-kcats-brackets">]</span> <span class="org-string">"Count chars in string"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[</span><span class="org-string">"abcd"</span> encode <span class="org-function-name">count</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>4<span class="org-kcats-brackets">]</span> <span class="org-string">"Count bytes in byte array"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> association <span class="org-function-name">count</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2<span class="org-kcats-brackets">]</span> <span class="org-string">"Count entries in association"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-function-name">second</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>ordered<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>4 5 6<span class="org-kcats-brackets">]</span> <span class="org-function-name">second</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>5<span class="org-kcats-brackets">]</span> <span class="org-string">"Get second item of list"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> <span class="org-function-name">second</span> <span class="org-kcats-brackets">[</span>\o<span class="org-kcats-brackets">]]</span> <span class="org-string">"Get second item of string"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[]</span> <span class="org-function-name">second</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Get second item of empty list -&gt; Nothing"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span><span class="org-function-name">last</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>ordered<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>3 4 5 6<span class="org-kcats-brackets">]</span> <span class="org-function-name">last</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>6<span class="org-kcats-brackets">]</span> <span class="org-string">"Get last item of list"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> <span class="org-function-name">last</span> <span class="org-kcats-brackets">[</span>\o<span class="org-kcats-brackets">]]</span> <span class="org-string">"Get last item of string"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[[]</span> <span class="org-function-name">last</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Get last item of empty list -&gt; Nothing"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span><span class="org-function-name">step</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program dispenser<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 <span class="org-kcats-brackets">[</span>2 3 4<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>24<span class="org-kcats-brackets">]</span> <span class="org-string">"Step through numbers doing arithmetic"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[</span>1 <span class="org-kcats-brackets">[]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1<span class="org-kcats-brackets">]</span> <span class="org-string">"Stepping through empty list is no-op"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>dispenser<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item dispenser<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span><span class="org-string">"a"</span> <span class="org-string">"b"</span> <span class="org-string">"c"</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">take</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"b"</span> <span class="org-string">"c"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"a"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Take a string from a list"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-function-name">take</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>2 3<span class="org-kcats-brackets">]</span> 1<span class="org-kcats-brackets">]</span> <span class="org-string">"Take a number from a list"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[[[</span>a <span class="org-string">"foo"</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>b <span class="org-string">"foo"</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c <span class="org-string">"foo"</span><span class="org-kcats-brackets">]]</span> <span class="org-function-name">take</span> <span class="org-builtin">dropdown</span> <span class="org-function-name">second</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"foo"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Take an entry from association is nondeterministic"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[[</span>1 3 5 7 9<span class="org-kcats-brackets">]</span> set <span class="org-function-name">take</span> <span class="org-builtin">dropdown</span> odd?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Take item from set is nondeterministic"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span><span class="org-function-name">pop</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>ordered<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item ordered<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span><span class="org-string">"a"</span> <span class="org-string">"b"</span> <span class="org-string">"c"</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">pop</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"a"</span> <span class="org-string">"b"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"c"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Pop last string from list"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-function-name">pop</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1 2<span class="org-kcats-brackets">]</span> 3<span class="org-kcats-brackets">]</span> <span class="org-string">"Pop last number from list"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span><span class="org-function-name">wrap</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 <span class="org-function-name">wrap</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1<span class="org-kcats-brackets">]]</span> <span class="org-string">"Wrap a number"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[[</span>1 2<span class="org-kcats-brackets">]</span> <span class="org-function-name">wrap</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[[</span>1 2<span class="org-kcats-brackets">]]]</span> <span class="org-string">"Wrap a list"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span><span class="org-function-name">unwrap</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>list<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1<span class="org-kcats-brackets">]</span> <span class="org-string">"Unwrap a list of one item"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]</span> <span class="org-string">"Unwrap an empty list is a no-op"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-string">"Unwrap a list of multiple items"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span><span class="org-function-name">reverse</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>ordered<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>ordered<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-function-name">reverse</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>3 2 1<span class="org-kcats-brackets">]]</span> <span class="org-string">"Reverse a list"</span><span class="org-kcats-brackets">]</span>
                      <span class="org-kcats-brackets">[[</span><span class="org-string">"123"</span> <span class="org-function-name">reverse</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"321"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Reverse a string"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span>slice <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>integer integer ordered<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>ordered<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"foobar"</span> 0 3 slice<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"foo"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Slice a string with valid indices"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[</span><span class="org-string">"foobar"</span> 0 7 slice<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Slice a string with index past end -&gt; Nothing"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[</span><span class="org-string">"foobar"</span> encode 0 3 slice<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"foo"</span> encode<span class="org-kcats-brackets">]</span> <span class="org-string">"Slice a byte array with valid indices"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[[</span>a b c d e<span class="org-kcats-brackets">]</span> 0 3 slice<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>a b c<span class="org-kcats-brackets">]]</span> <span class="org-string">"Slice a list with valid indices"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span>cut <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>integer sized<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[[[</span><span class="org-function-name">count</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> slice<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[</span>0 <span class="org-builtin">swap</span> slice<span class="org-kcats-brackets">]]</span>
                    <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">map</span>
                    <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"abcdefghijklmnopqrstuvwxyz"</span> 5 cut<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"fghijklmnopqrstuvwxyz"</span> <span class="org-string">"abcde"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Cut string at index"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span>empty <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>sized<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>sized<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"foo"</span> empty<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">""</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Create empty container from string"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> encode empty<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">""</span> encode<span class="org-kcats-brackets">]</span> <span class="org-string">"Create empty container from byte array"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[[</span>1 2 3<span class="org-kcats-brackets">]</span> empty<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Create empty container from list"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> association empty<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]</span> association<span class="org-kcats-brackets">]</span> <span class="org-string">"Create empty container from association"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[[</span>1 2 3<span class="org-kcats-brackets">]</span> set empty<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]</span> set<span class="org-kcats-brackets">]</span> <span class="org-string">"Create empty container from set"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span>range <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>integer integer integer<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 5 1 range<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1 2 3 4<span class="org-kcats-brackets">]]</span> <span class="org-string">"Create integer range with step of 1"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[</span>3 13 3 range<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>3 6 9 12<span class="org-kcats-brackets">]]</span> <span class="org-string">"Create integer range with step greater than 1"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span>empty? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[]</span> empty?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Empty list is empty"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span>1 empty?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Number is not empty"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span><span class="org-string">""</span> empty?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Empty string is empty"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[</span>foo<span class="org-kcats-brackets">]</span> empty?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Non-empty list is not empty"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span>pad <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>item padding<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>integer newsize<span class="org-kcats-brackets">]</span> sized<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>sized<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[[</span><span class="org-function-name">count</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span> -<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span>
                    <span class="org-builtin">swap</span> repeat
                    <span class="org-builtin">swap</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 3<span class="org-kcats-brackets">]</span> 5 0 pad<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>0 0 1 2 3<span class="org-kcats-brackets">]]</span> <span class="org-string">"Pad a list at front, to given size"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[[</span>1 2 3 4 5 6<span class="org-kcats-brackets">]</span> 5 0 pad<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1 2 3 4 5 6<span class="org-kcats-brackets">]]</span> <span class="org-string">"Padding a list to smaller than original size is a no-op"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span>list? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1<span class="org-kcats-brackets">]</span> list?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"A list is a list"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[[]</span> list?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"An empty list is a list"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[</span>5 list?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"A number is not a list"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> list?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"A string is not a list"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[[]</span> association list?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"An empty association is not a list"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span>sort-indexed <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>sized<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>sized<span class="org-kcats-brackets">]]]</span>
                <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>1 1<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3 3<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2 2<span class="org-kcats-brackets">]]</span> sort-indexed<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1 2 3<span class="org-kcats-brackets">]]</span> <span class="org-string">"Sorting a list of key-value pairs by key"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span>pack <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>list template<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]</span>
            <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"x"</span> <span class="org-kcats-brackets">[</span>foo<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>bar<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span>
                         <span class="org-kcats-brackets">[</span>*2 <span class="org-kcats-brackets">[</span>*1 x **2<span class="org-kcats-brackets">]</span> c d 1 2 3<span class="org-kcats-brackets">]</span> pack<span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[</span><span class="org-string">"x"</span> <span class="org-kcats-brackets">[[</span>foo<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>bar x foo<span class="org-kcats-brackets">]</span> c d 1 2 3<span class="org-kcats-brackets">]]</span>
                       <span class="org-string">"Packing values from the stack, into a template"</span><span class="org-kcats-brackets">]]]]]</span>
</pre>
</div></div>

<div class='tangle-wrapper' data-tangle='src/kcats/core/collections.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>something? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span> 
             <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>empty? not<span class="org-kcats-brackets">]]</span>
             <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 something?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"A number is something"</span><span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[[[]</span> something?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Empty list is not something"</span><span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[[</span><span class="org-string">""</span> something?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Empty string is not something"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-function-name">first</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>ordered<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span> <span class="org-builtin">dropdown</span><span class="org-kcats-brackets">]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>4 5 6<span class="org-kcats-brackets">]</span> <span class="org-function-name">first</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>4<span class="org-kcats-brackets">]</span> <span class="org-string">"Get the first item of a list"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> <span class="org-function-name">first</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>\f<span class="org-kcats-brackets">]</span> <span class="org-string">"The first item of a string is the first character"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[[]</span> <span class="org-function-name">first</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"The first item of an empty list is Nothing"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-function-name">rest</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>sized<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>sized<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-function-name">rest</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>2 3<span class="org-kcats-brackets">]]</span> <span class="org-string">"Take rest of list"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> <span class="org-function-name">rest</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"oo"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Take rest of string"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>butlast <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>sized<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>sized<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-function-name">pop</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 3<span class="org-kcats-brackets">]</span> butlast<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1 2<span class="org-kcats-brackets">]]</span> <span class="org-string">"Take all but last of list"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>prepend <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item sized<span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[</span>sized<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-function-name">wrap</span> <span class="org-builtin">swap</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2<span class="org-kcats-brackets">]</span> 3 prepend<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>3 1 2<span class="org-kcats-brackets">]]</span> <span class="org-string">"Prepend to list"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span><span class="org-string">"oo"</span> \f prepend<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"foo"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Prepend to string"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>every? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program sized<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span><span class="org-builtin">swap</span><span class="org-kcats-brackets">]</span>
                      <span class="org-kcats-brackets">[[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-builtin">clone</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">float</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">shielddown</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span>
                       <span class="org-kcats-brackets">[]</span>
                       <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> every?<span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[</span><span class="org-builtin">dropdown</span> <span class="org-builtin">dropdown</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]</span>
                      <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-builtin">drop</span> yes<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>2 4 6<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>even?<span class="org-kcats-brackets">]</span> every?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Every number matches predicate"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[[</span>2 4 5<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>even?<span class="org-kcats-brackets">]</span> every?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Not every number matches predicate"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[[]</span> <span class="org-kcats-brackets">[[]]</span> every?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Every item in empty list matches any predicate"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[[</span>2 4 6<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]</span> every?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Every item in list matches empty predicate"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[</span>11 <span class="org-kcats-brackets">[</span>2 4 6<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>+ odd?<span class="org-kcats-brackets">]</span> every?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>11 yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Stack is shielded from predicate"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[</span>12 <span class="org-kcats-brackets">[[</span>even?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>positive?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3 mod 0 =<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> every?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>12 yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Can check list of predicates with execute predicate"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>any? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program sized<span class="org-kcats-brackets">]</span> boolean<span class="org-kcats-brackets">]]</span>
       <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span><span class="org-builtin">swap</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-builtin">clone</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">float</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">shielddown</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span>
                     <span class="org-kcats-brackets">[]</span>
                     <span class="org-kcats-brackets">[</span><span class="org-builtin">dropdown</span> <span class="org-builtin">dropdown</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> any?<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-builtin">drop</span> <span class="org-kcats-brackets">[]]</span> <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>2 4 6<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>even?<span class="org-kcats-brackets">]</span> any?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Any number matches predicate"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[[</span>3 5 7<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>even?<span class="org-kcats-brackets">]</span> any?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"No number matches predicate"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[[]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> any?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"No item in empty list matches any predicate"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[[[]</span> 2 4 6<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]</span> any?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2<span class="org-kcats-brackets">]</span> <span class="org-string">"Empty predicate returns first truthy item"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[</span>11 <span class="org-kcats-brackets">[</span>3 5 6<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>+ odd?<span class="org-kcats-brackets">]</span> any?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>11 yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Stack is shielded from predicate"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[</span>-15 <span class="org-kcats-brackets">[[</span>even?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>positive?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3 mod 0 =<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> any?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>-15 yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Can check list of predicates with execute predicate"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-function-name">map</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program sized<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[]</span> <span class="org-builtin">sink</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">put empty results below list</span>
                   <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span> <span class="org-kcats-brackets">[</span>*1 <span class="org-preprocessor">shielddown</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-builtin">swap</span> <span class="org-function-name">put</span><span class="org-kcats-brackets">]</span> pack
                   <span class="org-function-name">step</span><span class="org-kcats-brackets">]]</span>

      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>inc<span class="org-kcats-brackets">]</span> <span class="org-function-name">map</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>2 3 4<span class="org-kcats-brackets">]]</span> <span class="org-string">"Pass each item through a program"</span><span class="org-kcats-brackets">]</span>

                 <span class="org-kcats-brackets">[[</span>1 <span class="org-kcats-brackets">[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>+<span class="org-kcats-brackets">]</span> <span class="org-function-name">map</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 <span class="org-kcats-brackets">[</span>2 3 4<span class="org-kcats-brackets">]]</span> <span class="org-string">"Program has access to rest of stack"</span><span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[[</span>7 9 <span class="org-kcats-brackets">[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>+ *<span class="org-kcats-brackets">]</span> <span class="org-function-name">map</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>7 9 <span class="org-kcats-brackets">[</span>70 77 84<span class="org-kcats-brackets">]]</span> <span class="org-string">"Stack is shielded from mapping program"</span><span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[[</span>7 9 <span class="org-kcats-brackets">[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">map</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>7 9 <span class="org-kcats-brackets">[</span>7 7 7<span class="org-kcats-brackets">]]</span> <span class="org-string">"Result of program can be lower stack items"</span><span class="org-kcats-brackets">]</span>

                 <span class="org-kcats-brackets">[[</span>7 9 <span class="org-kcats-brackets">[</span>+<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]</span> <span class="org-function-name">map</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>7 9 <span class="org-kcats-brackets">[</span>+<span class="org-kcats-brackets">]]</span> <span class="org-string">"Empty program is a no-op"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span><span class="org-function-name">filter</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program sized<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[]</span> <span class="org-builtin">sink</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">put empty results below list</span>
                      <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span> <span class="org-kcats-brackets">[</span>*1 <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-builtin">swap</span>
                       <span class="org-kcats-brackets">[]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-builtin">swap</span> <span class="org-function-name">put</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-builtin">dropdown</span><span class="org-kcats-brackets">]</span>
                       <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]</span>
                      pack
                      <span class="org-function-name">step</span><span class="org-kcats-brackets">]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>odd?<span class="org-kcats-brackets">]</span> <span class="org-function-name">filter</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1 3<span class="org-kcats-brackets">]]</span> <span class="org-string">"Filter a list with predicate"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[[</span>2 4 6<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>odd?<span class="org-kcats-brackets">]</span> <span class="org-function-name">filter</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Filter with predicate that matches no items"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[</span>33 <span class="org-kcats-brackets">[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>33 + odd?<span class="org-kcats-brackets">]</span> <span class="org-function-name">filter</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>33 <span class="org-kcats-brackets">[</span>2<span class="org-kcats-brackets">]]</span> <span class="org-string">"Filter predicate uses existing stack items"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>sort <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program sized<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span><span class="org-builtin">clone</span> **1 pair<span class="org-kcats-brackets">]</span> pack
                    <span class="org-function-name">map</span> sort-indexed<span class="org-kcats-brackets">]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 3 2<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]</span> sort<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1 2 3<span class="org-kcats-brackets">]]</span> <span class="org-string">"Sort a list of numbers"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[[</span><span class="org-string">"Carol"</span> <span class="org-string">"Alice"</span> <span class="org-string">"bob"</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]</span> sort<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"Alice"</span> <span class="org-string">"Bob"</span> <span class="org-string">"Carol"</span><span class="org-kcats-brackets">]]</span> <span class="org-string">"Sort a list of strings"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[[</span><span class="org-string">"Charlie"</span> <span class="org-string">"Alice"</span> <span class="org-string">"bob"</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">count</span><span class="org-kcats-brackets">]</span> sort<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"Bob"</span> <span class="org-string">"Alice"</span> <span class="org-string">"Charlie"</span><span class="org-kcats-brackets">]]</span> <span class="org-string">"Sort list of strings by length"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>repeat <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>integer howmany<span class="org-kcats-brackets">]</span>
                 item<span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[]</span> <span class="org-builtin">sink</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">wrap</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">put</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-preprocessor">times</span><span class="org-kcats-brackets">]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"hi"</span> 3 repeat<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"hi"</span> <span class="org-string">"hi"</span> <span class="org-string">"hi"</span><span class="org-kcats-brackets">]]</span> <span class="org-string">"Create a list of repeated items"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>indexed <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>list<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span><span class="org-function-name">count</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> <span class="org-kcats-brackets">[</span>0<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> 1 range <span class="org-builtin">swap</span> zip<span class="org-kcats-brackets">]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>a b c<span class="org-kcats-brackets">]</span> indexed<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[[</span>0 a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2 c<span class="org-kcats-brackets">]]]</span> <span class="org-string">"Index a list"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>indexer <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>program<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>0 <span class="org-kcats-brackets">[[</span>generate<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span> <span class="org-kcats-brackets">[[</span>pair<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shielddown</span> <span class="org-kcats-brackets">[</span>inc<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]</span> bail<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>a b c<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>indexer<span class="org-kcats-brackets">]</span> assemble<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[[</span>0 a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2 c<span class="org-kcats-brackets">]]]</span> <span class="org-string">"Index a generator"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>indexof <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item list<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>indexer<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span>
                       <span class="org-comment-delimiter">;; </span><span class="org-comment">use wrap so we can find index of words,</span>
                       <span class="org-comment-delimiter">;; </span><span class="org-comment">otherwise the word gets executed</span>
                       <span class="org-kcats-brackets">[</span><span class="org-function-name">second</span> <span class="org-function-name">wrap</span> =<span class="org-kcats-brackets">]</span> <span class="org-builtin">swap</span> <span class="org-function-name">wrap</span> <span class="org-function-name">put</span> <span class="org-kcats-brackets">[[</span><span class="org-builtin">swapdown</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">inject</span>
                       keep generate <span class="org-function-name">first</span><span class="org-kcats-brackets">]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>a b c<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> indexof<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2<span class="org-kcats-brackets">]</span> <span class="org-string">"Get the index of first matching item"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[[</span>a b c<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>d<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> indexof<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"No matching item -&gt; Nothing"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[[</span>a b c d c e<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> indexof<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2<span class="org-kcats-brackets">]</span> <span class="org-string">"Multiple matches returns index of first match"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>interpose <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item ordered<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>ordered<span class="org-kcats-brackets">]]]</span>
            <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[]</span> flip
                         <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span> pair <span class="org-function-name">join</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">pop</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span>
                         <span class="org-builtin">drop</span> <span class="org-function-name">pop</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]</span>
            <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>foo bar baz<span class="org-kcats-brackets">]</span> <span class="org-string">"hi"</span> interpose<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>foo <span class="org-string">"hi"</span> bar <span class="org-string">"hi"</span> baz<span class="org-kcats-brackets">]]</span> <span class="org-string">"Interpose string between words"</span><span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[[[]</span> <span class="org-string">"hi"</span> interpose<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Empty list is a no-op"</span><span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[[[</span>foo<span class="org-kcats-brackets">]</span> <span class="org-string">"hi"</span> interpose<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>foo<span class="org-kcats-brackets">]]</span> <span class="org-string">"Single item list is a no-op"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>starts? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>ordered prefix<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>ordered target<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[</span>zip <span class="org-kcats-brackets">[</span><span class="org-function-name">unwrap</span> =<span class="org-kcats-brackets">]</span> every?<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">the items at matching indexes are equal</span>
                        <span class="org-kcats-brackets">[[</span><span class="org-function-name">count</span><span class="org-kcats-brackets">]</span> both &gt;=<span class="org-kcats-brackets">]]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">the prefix is shorter than the target</span>
                       <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> every? 
                       <span class="org-builtin">dropdown</span> <span class="org-builtin">dropdown</span><span class="org-kcats-brackets">]]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">drop the originals</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"abcd"</span> <span class="org-string">"ab"</span> starts?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"String starts with matching string"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span><span class="org-string">"abcd"</span> <span class="org-string">""</span> starts?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"String starts with empty string"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span><span class="org-string">""</span> <span class="org-string">"ab"</span> starts?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Empty string doesn't start with a string"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span><span class="org-string">"abcd"</span> <span class="org-string">"bb"</span> starts?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"String doesn't start with non-matching string"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[</span>1 2 3 4<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 2<span class="org-kcats-brackets">]</span> starts?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"List starts with matching list"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>ends? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>ordered ordered<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span><span class="org-function-name">reverse</span><span class="org-kcats-brackets">]</span> both starts?<span class="org-kcats-brackets">]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"abcd"</span> <span class="org-string">"cd"</span> ends?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"String ends with matching string"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[</span><span class="org-string">"abcd"</span> <span class="org-string">""</span> ends?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"String ends with empty string"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[</span><span class="org-string">"abcd"</span> <span class="org-string">"bb"</span> ends?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"String doesn't end with non-matching string"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[[</span>1 2 3 4<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3 4<span class="org-kcats-brackets">]</span> ends?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"List ends with matching list"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>pair <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span><span class="org-function-name">wrap</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-function-name">put</span><span class="org-kcats-brackets">]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 pair<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1 2<span class="org-kcats-brackets">]]</span> <span class="org-string">"Pair up two numbers into a list"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[[</span><span class="org-string">"hi"</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"there"</span> <span class="org-string">"foo"</span><span class="org-kcats-brackets">]</span> pair<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[[</span><span class="org-string">"hi"</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"there"</span> <span class="org-string">"foo"</span><span class="org-kcats-brackets">]]]</span> <span class="org-string">"Pair up two lists into a new list"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>pair? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span><span class="org-function-name">count</span> 2 =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-builtin">drop</span> <span class="org-kcats-brackets">[]]</span> recover<span class="org-kcats-brackets">]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"ab"</span> pair?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"2-character string is a pair"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[[</span>a b<span class="org-kcats-brackets">]</span> pair?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"2-item list is a pair"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[</span><span class="org-string">"abc"</span> pair?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"3-character string is not a pair"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[[]</span> pair?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Nothing is not a pair"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[</span>7 pair?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Number is not a pair"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>triplet <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>pair<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-function-name">put</span><span class="org-kcats-brackets">]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 triplet<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1 2 3<span class="org-kcats-brackets">]]</span> <span class="org-string">"Make a 3-item list from 3 stack items"</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[</span><span class="org-string">"hi"</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"there"</span> <span class="org-string">"foo"</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"bar"</span><span class="org-kcats-brackets">]</span> triplet<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[[</span><span class="org-string">"hi"</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"there"</span> <span class="org-string">"foo"</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"bar"</span><span class="org-kcats-brackets">]]]</span> <span class="org-string">"Make a 3-item list from smaller lists"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>both? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program item item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-builtin">sink</span> pair <span class="org-builtin">swap</span> every?<span class="org-kcats-brackets">]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 <span class="org-kcats-brackets">[</span>odd?<span class="org-kcats-brackets">]</span> both?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Test two items for predicate when not all match"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[</span>1 3 <span class="org-kcats-brackets">[</span>odd?<span class="org-kcats-brackets">]</span> both?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Test two items for predicate when all match"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>both <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program <span class="org-kcats-brackets">[</span>item a<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item b<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>item item<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>pair<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 <span class="org-kcats-brackets">[</span>inc<span class="org-kcats-brackets">]</span> both<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2 3<span class="org-kcats-brackets">]</span> <span class="org-string">"Run program on two stack items"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>walk <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program item-transform<span class="org-kcats-brackets">]</span> list<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>list? not<span class="org-kcats-brackets">]</span> <span class="org-builtin">swap</span>
                    <span class="org-kcats-brackets">[[]</span> <span class="org-builtin">swap</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[</span><span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span> <span class="org-function-name">step</span> <span class="org-function-name">wrap</span><span class="org-kcats-brackets">]</span>
                    <span class="org-preprocessor">recur</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 <span class="org-kcats-brackets">[</span>3 <span class="org-kcats-brackets">[</span>4 5<span class="org-kcats-brackets">]</span> 6<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>inc <span class="org-function-name">wrap</span><span class="org-kcats-brackets">]</span> walk<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>2 3 <span class="org-kcats-brackets">[</span>4 <span class="org-kcats-brackets">[</span>5 6<span class="org-kcats-brackets">]</span> 7<span class="org-kcats-brackets">]]]</span> <span class="org-string">"Walk a nested list"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[[</span>1 2 <span class="org-kcats-brackets">[</span>3 <span class="org-kcats-brackets">[</span>4 5<span class="org-kcats-brackets">]</span> 6<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span> inc pair<span class="org-kcats-brackets">]</span> walk<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1 2 2 3 <span class="org-kcats-brackets">[</span>3 4 <span class="org-kcats-brackets">[</span>4 5 5 6<span class="org-kcats-brackets">]</span> 6 7<span class="org-kcats-brackets">]]]</span> <span class="org-string">"Walk a nested list and splice results"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-comment-delimiter">; </span><span class="org-comment">[template [[spec [[[list template]] [list]]]</span>
<span class="org-comment-delimiter">;            </span><span class="org-comment">[definition [[snapshot</span>
<span class="org-comment-delimiter">;                          </span><span class="org-comment">;; build a map of word like *1, *2 etc to values on the stack</span>
<span class="org-comment-delimiter">;                          </span><span class="org-comment">;; Do a separate entry for **1, **2, etc which means to splice the value</span>
<span class="org-comment-delimiter">;                          </span><span class="org-comment">[count] shield inc 1 1 swapdown range</span>
<span class="org-comment-delimiter">;                          </span><span class="org-comment">["*" "**"] [swap [string join word] map] map</span>
<span class="org-comment-delimiter">;                          </span><span class="org-comment">unwrap join dropdown </span>
<span class="org-comment-delimiter">;                          </span><span class="org-comment">[clone [wrap] map swap join] dip swap zip association] dive</span>

<span class="org-comment-delimiter">;                         </span><span class="org-comment">;; save copy of template</span>
<span class="org-comment-delimiter">;                         </span><span class="org-comment">[clone] dive</span>

<span class="org-comment-delimiter">;                         </span><span class="org-comment">[[swap get] swap prepend wrap</span>
<span class="org-comment-delimiter">;                          </span><span class="org-comment">[shield </span>
<span class="org-comment-delimiter">;                           </span><span class="org-comment">[] [dropdown] [drop wrap] if] join</span>
<span class="org-comment-delimiter">;                          </span><span class="org-comment">walk] dip</span>
<span class="org-comment-delimiter">;                         </span><span class="org-comment">;; find the highest index placeholder</span>
<span class="org-comment-delimiter">;                         </span><span class="org-comment">flatten set 0 swap </span>
<span class="org-comment-delimiter">;                         </span><span class="org-comment">[[word?]</span>
<span class="org-comment-delimiter">;                          </span><span class="org-comment">;; try to parse as a placeholder and get the index</span>
<span class="org-comment-delimiter">;                          </span><span class="org-comment">[string ["*" starts?] [take drop] while</span>
<span class="org-comment-delimiter">;                           </span><span class="org-comment">[number max] [drop drop] recover] </span>
<span class="org-comment-delimiter">;                          </span><span class="org-comment">[drop] if] step</span>
<span class="org-comment-delimiter">;                         </span><span class="org-comment">;; drop that many items from the stack</span>
<span class="org-comment-delimiter">;                         </span><span class="org-comment">[drop] swap float [times] dip]]</span>
<span class="org-comment-delimiter">;            </span><span class="org-comment">[examples [[["x" [foo] [bar] unwrap</span>
<span class="org-comment-delimiter">;                         </span><span class="org-comment">[*2 [*1 x **2] c d 1 2 3] template]</span>
<span class="org-comment-delimiter">;                        </span><span class="org-comment">["x" [[foo] [bar x foo] c d 1 2 3] ]]]]]]</span>

<span class="org-kcats-brackets">[</span>flatten <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>list<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[]</span> <span class="org-builtin">swap</span> <span class="org-kcats-brackets">[</span>list? not<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">put</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">step</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">recur</span><span class="org-kcats-brackets">]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>a b <span class="org-kcats-brackets">[</span>c <span class="org-kcats-brackets">[</span>d e<span class="org-kcats-brackets">]</span> f<span class="org-kcats-brackets">]</span> g<span class="org-kcats-brackets">]</span> flatten<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>a b c d e f g<span class="org-kcats-brackets">]]</span> <span class="org-string">"Flatten a nested list"</span><span class="org-kcats-brackets">]]]]]</span>
</pre>
</div></div>
</div>
