lexicon.org
*** Associations
#+begin_src kcats :tangle src/kcats/core/associations-builtins.kcats :mkdirp yes
  [get [[spec [[item sized] [item]]]
        [examples [[[[[a 3] [c 2]] [a] unwrap get] [3] "Get a key from an association"]
                   [[[10 11 12 13] 1 get] [11] "Get an item by index from a list"]
                   [["foobar" 3 get] [\b] "Get a character by index from a string"]
                   [["foobar" encode 3 get] [98] "Get an integer by index from a byte array"]
                   [[[[a 3] [c 2]] [b] unwrap get] [[]] "Get a nonexistent key -> Nothing"]]]]]

  [assign [[spec [[[item value]
                   [list keys]
                   sized]
                  [association]]]
           [examples [[[[[a b] [c d]] [a] 5 assign]
                       [[[a 5] [c d]] association] "Assign a new value to an existing key"]

                      [[[[a b] [c d]] [e] 5 assign]
                       [[[a b] [c d] [e 5]] association] "Assign a new value to a new key"]

                      [[[[a b] [c [[d e]]]] [c d] 5 assign]
                       [[[a b] [c []]] [c] [[d 5]] association assign] "Assign a new nested key, promoting to nested association"]

                      [[[[a b] [c [[d e]]]] [1 1 0] 5 assign]
                       [[[a b] [c [5]]]] "Assign a new index in a nested list"]

                      [[[1 2 3] [1 0 0] "foo" assign]
                       [[1 [["foo"]] 3]] "Assign a new index in a nested list"]

                      [[[[a [1 2 3]]] [a 0] 10 assign]
                       [[[a [10 2 3]]] association] "Assign a nested key in a mixed structure of association and list"]

                      [[[1 2 3] [1 2] "foo" assign]
                       [[1 [[] [] "foo"] 3]] "Assign an index creating placeholders for missing list items"]]]]]

  [unassign [[spec [[[item key] [sized into-association]] [association]]]
             [examples [[[[[a b] [c d]] [a] unassign]
                         [[[c d]] association] "Unassign a key from an association, promoting from list"]

                        [[[[a b] [c d]] [e] unassign]
                         [[[a b] [c d]] association] "Unassign a key that doesn't exist, only promotes"]

                        [[[[a b] [c d]] [e f] unassign]
                         [[[a b] [c d]] association] "Unassign multiple keys that don't exist only promotes"]

                        [[[[a b] [c [[d e] [f g]]]] [c x] unassign]
                         [[[a b]] [c] [[d e] [f g]] association assign] "Unassign multiple keys where last doesn't exist, only promotes"]

                        [[[[a [[b c] [d e]]]] [a d] unassign]
                         [[] association [a b] [c] unwrap assign] "Unassign associative keylist from nested structure, promoted to association"]

                        [[[0 1 2 [[a b] [c d]]] [3 c] unassign]
                         [[0 1 2] [[a b]] association put] "Unassign mixed keylist from nested structure, inner only is promoted to association"]]]]]

  [association? [[spec [[item] [boolean]]]
                 [examples [[[[[a b] [c d]] association association?] [yes] "Association is an association"]
                            [[[[a b] [c d]] association?] [[]] "A list is not an association, even if it's possible to promote"]
                            [[1 association?] [[]] "A number is not an association"]
                            [[[] association?] [[]] "An empty list is not an association"]
                            [[[] association association?] [yes] "An empty association is an association"]
                            [[[] [a] 1 assign association?] [yes] "A list promoted to association by assignment, is an association"]]]]]

  [association [[spec [[item] [association]]]
                [examples [[[[[a b] [c d]] association
                             [[c d] [a b]] association =]
                            [yes] "A list can be promoted to association"]

                           [[[[a b] [c d]]
                             [[c d] [a b]] association =]
                            [[]] "An association and list are not the same, even if keys/vals are the same"]

                           [[[[a b] [c d]]
                             [[a b] [c d]] association =] [[]] "An association is not the same as the list it was promoted from"]]]]]
#+end_src

#+begin_src kcats :tangle src/kcats/core/associations.kcats :mkdirp yes
  ;; Associative words
  [update [[spec [[program [list keys] [sized into-association]]
                  [association]]]
           [definition [[[lookup] shield] dip ;; m ks v p
                        shielddown
                        assign]]
           [examples [[[[[a 1] [b 2]] [b] [inc] update]
                       [[[a 1] [b 3]] association] "Update a value in an association"]

                      [[[[a [[c 3] [d 5]]] [b 2]]
                        [a c] [inc] update
                        [a c] lookup]
                       [4] "Update a value in a nested association"]

                      [[[[a [1 3 5 7]] [b 2]]
                        [a 2] [inc] update]
                       [[[a [1 3 6 7]] [b 2]] association] "Update a value in a mixed association/list structure"]

                      [["hi"
                        [[a [[c 3] [d 5]]] [b 2]]
                        [a c] [drop drop 10 15] update
                        [a c] lookup]
                       ["hi" 15] "Update function can't destroy stack items"]

                      [[[[a 1] [b 2]] [d] [5] update]
                       [[[a 1] [b 2] [d 5]] association] "Update creates new key when it doesn't exist"]

                      [[[[a [[c 3] [d 5]]] [b 2]]
                        [a e] [5 6 +] update
                        [a e] lookup]
                       [11] "Update function can ignore previous value"]]]]]

  [lookup [[spec [[[list keys] sized] [item]]]
           [definition [[something?] ;; keylist not empty
                        [take swap [get] dip] ;; extract the first key and lookup
                        while
                        drop]]
           [examples [[[[[a b] [c d]] association [a] lookup] [[b] unwrap] "Lookup the value of a key in an association"]
                      [[[[a b] [c d]] [a] lookup] [[b] unwrap] "Lookup the value of a key, promoting a list to association"]
                      [[[[a b] [c d]] [e] lookup] [[]] "Looking up a key that doesn't exist returns Nothing"]
                      [[[[outer [[a b] [c d]]]] [outer c] lookup] [[d] unwrap] "Lookup in a nested structure, with promotion"]]]]]

  ;; TODO: fix the case where you just want a value [[type foo]] - only
  ;; one item but you want the value, not key
  [type [[spec [[item] [item]]]
         [definition [[[[empty?] [[nothing] unwrap]]
                       [[word?] [[word] unwrap]]
                       [[number?] [[number] unwrap]]
                       [[string?] [[string] unwrap]]
                       [[bytes?] [[bytes] unwrap]]
                       [[pipe?] [[pipe] unwrap]]
                       [[error?] [[error] unwrap]]
                       [[environment?] [[environment] unwrap]]
                       [[set?] [[set] unwrap]]
                       [[association?] [[[[type] lookup]
                                         [[count 1 =]
                                          [[first [type] unwrap =]
                                           [first second]
                                           [first first]
                                           if]
                                          [[]]
                                          if]
                                         [[association] unwrap]]
                                        [execute] any?]]
                       [[list?] [[list] unwrap]]]
                      decide dropdown]]
         [examples [[[[[foo 1]] association type] [[foo] unwrap] "An association with one key assumes it is its type"]
                    [[1 type] [[number] unwrap] "Integers are of type number"]
                    [[1.0 type] [[number] unwrap] "Floats are of type number"]
                    [[[] type] [[nothing] unwrap] "Empty list is of type nothing"]
                    [["foo" encode type] [[bytes] unwrap] "A byte array is of type bytes"]
                    [["foo" type] [[string] unwrap] "A string is of type string"]
                    [[[1 2 3] set type] [[set] unwrap] "A set is of type set"]
                    [[[] environment type] [[environment] unwrap] "An environment is of type environment"]
                    [[[[type foo]] association type] [[foo] unwrap] "An association with a single type key, the value is its type"]
                    [[[[type foo] [attr "blah"]] association type] [[foo] unwrap] "An association with a single type key, the value is its type"]
                    [[[[attr1 foo] [attr2 "blah"]] association type] [[association] unwrap] "An association with multiple keys and no type key, is of type association"]
                    [[[[type url] [value "http://foo.com"]] association type] [[url] unwrap] "An association with type/value keys, uses the type key for its type"]]]]]

  [value [[spec [[[sized into-association]] [item]]]
          [definition [[count 1 =] ;; if it's a single item
                       [first second] ;; the value is the value of that first item
                       [[value] lookup] ;; otherwise look up the key 'value'
                       if]]
          [examples [[[[[foo 1]] value] [1] "The value of a single-entry association is the value of the key-value pair"]

                     [[[[type url] [value "http://foo.com"]] value]
                      ["http://foo.com"] "The value of an object is the value key"]]]]]

  [zip [[spec [[[dispenser values] [dispenser keys]] [list]]]
        [definition [[] sink ;; save accumulator below args
                     [[something?] both?] ;; stop when either list is empty
                     [[take] both swapdown pair ;; take from each list and pair them up
                      sink [put] dipdown] ;; put them into the accumulator
                     while
                     drop drop]] ;; drop the empty containers
        [examples [[[[a b c] [1 2 3] zip] [[[a 1] [b 2] [c 3]]] "Zip two lists together into a single list of pairs"]
                   [[[a b c d] [1 2 3] zip] [[[a 1] [b 2] [c 3]]] "Zip two lists of unequal size pads with Nothing values"]]]]]

  [label [[spec [[[sized labels]] [association]]]
          [definition [[] swap ;; labels acc
                       [wrap float assign] step]]
          [examples [[["Alice" 23 "123 Main St" [address age name] label]
                      [[[address "123 Main St"]
                        [age 23]
                        [name "Alice"]] association]
                      "Label values on the stack as an association"]]]]]
#+end_src

Better zip implementation
#+begin_src kcats
   [a b c d e] [1 2 3]
   [] sink
   [swap] [[take] both swapdown pair sink [put] dipdown] while drop drop
#+end_src

#+RESULTS:
#+begin_src kcats
[[a 1]
 [b 2]
 [c 3]
 [d []]
 [e []]]
#+end_src

#+begin_src kcats
"asd" [\a \b 1] join
#+end_src

#+RESULTS:
#+begin_src kcats
[\a \s \d \a \b 1]
#+end_src

#+begin_src kcats
[\b \c] "a"  join
#+end_src

#+RESULTS:
#+begin_src kcats
"bca"
#+end_src

