lexicon.html
<div id="outline-container-orgb5822fe" class="outline-4">
<h4 id="orgb5822fe"><span class="section-number-4">1.4.1.</span> Associations</h4>
<div class="outline-text-4" id="text-1-4-1">
<div class='tangle-wrapper' data-tangle='src/kcats/core/associations-builtins.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>get <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item sized<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>a 3<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c 2<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>a<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> get<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3<span class="org-kcats-brackets">]</span> <span class="org-string">"Get a key from an association"</span><span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[[[</span>10 11 12 13<span class="org-kcats-brackets">]</span> 1 get<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>11<span class="org-kcats-brackets">]</span> <span class="org-string">"Get an item by index from a list"</span><span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[[</span><span class="org-string">"foobar"</span> 3 get<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>\b<span class="org-kcats-brackets">]</span> <span class="org-string">"Get a character by index from a string"</span><span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[[</span><span class="org-string">"foobar"</span> encode 3 get<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>98<span class="org-kcats-brackets">]</span> <span class="org-string">"Get an integer by index from a byte array"</span><span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[[[[</span>a 3<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c 2<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>b<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> get<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Get a nonexistent key -&gt; Nothing"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>assign <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>item value<span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[</span>list keys<span class="org-kcats-brackets">]</span>
                 sized<span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[</span>association<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>a<span class="org-kcats-brackets">]</span> 5 assign<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[</span>a 5<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> association<span class="org-kcats-brackets">]</span> <span class="org-string">"Assign a new value to an existing key"</span><span class="org-kcats-brackets">]</span>

                    <span class="org-kcats-brackets">[[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>e<span class="org-kcats-brackets">]</span> 5 assign<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>e 5<span class="org-kcats-brackets">]]</span> association<span class="org-kcats-brackets">]</span> <span class="org-string">"Assign a new value to a new key"</span><span class="org-kcats-brackets">]</span>

                    <span class="org-kcats-brackets">[[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c <span class="org-kcats-brackets">[[</span>d e<span class="org-kcats-brackets">]]]]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]</span> 5 assign<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c <span class="org-kcats-brackets">[]]]</span> <span class="org-kcats-brackets">[</span>c<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>d 5<span class="org-kcats-brackets">]]</span> association assign<span class="org-kcats-brackets">]</span> <span class="org-string">"Assign a new nested key, promoting to nested association"</span><span class="org-kcats-brackets">]</span>

                    <span class="org-kcats-brackets">[[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c <span class="org-kcats-brackets">[[</span>d e<span class="org-kcats-brackets">]]]]</span> <span class="org-kcats-brackets">[</span>1 1 0<span class="org-kcats-brackets">]</span> 5 assign<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c <span class="org-kcats-brackets">[</span>5<span class="org-kcats-brackets">]]]]</span> <span class="org-string">"Assign a new index in a nested list"</span><span class="org-kcats-brackets">]</span>

                    <span class="org-kcats-brackets">[[[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 0 0<span class="org-kcats-brackets">]</span> <span class="org-string">"foo"</span> assign<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span>1 <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span><span class="org-kcats-brackets">]]</span> 3<span class="org-kcats-brackets">]]</span> <span class="org-string">"Assign a new index in a nested list"</span><span class="org-kcats-brackets">]</span>

                    <span class="org-kcats-brackets">[[[[</span>a <span class="org-kcats-brackets">[</span>1 2 3<span class="org-kcats-brackets">]]]</span> <span class="org-kcats-brackets">[</span>a 0<span class="org-kcats-brackets">]</span> 10 assign<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[</span>a <span class="org-kcats-brackets">[</span>10 2 3<span class="org-kcats-brackets">]]]</span> association<span class="org-kcats-brackets">]</span> <span class="org-string">"Assign a nested key in a mixed structure of association and list"</span><span class="org-kcats-brackets">]</span>

                    <span class="org-kcats-brackets">[[[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 2<span class="org-kcats-brackets">]</span> <span class="org-string">"foo"</span> assign<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span>1 <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[]</span> <span class="org-string">"foo"</span><span class="org-kcats-brackets">]</span> 3<span class="org-kcats-brackets">]]</span> <span class="org-string">"Assign an index creating placeholders for missing list items"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>unassign <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>item key<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>sized into-association<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>association<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>a<span class="org-kcats-brackets">]</span> unassign<span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[[[</span>c d<span class="org-kcats-brackets">]]</span> association<span class="org-kcats-brackets">]</span> <span class="org-string">"Unassign a key from an association, promoting from list"</span><span class="org-kcats-brackets">]</span>

                      <span class="org-kcats-brackets">[[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>e<span class="org-kcats-brackets">]</span> unassign<span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> association<span class="org-kcats-brackets">]</span> <span class="org-string">"Unassign a key that doesn't exist, only promotes"</span><span class="org-kcats-brackets">]</span>

                      <span class="org-kcats-brackets">[[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>e f<span class="org-kcats-brackets">]</span> unassign<span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> association<span class="org-kcats-brackets">]</span> <span class="org-string">"Unassign multiple keys that don't exist only promotes"</span><span class="org-kcats-brackets">]</span>

                      <span class="org-kcats-brackets">[[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c <span class="org-kcats-brackets">[[</span>d e<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>f g<span class="org-kcats-brackets">]]]]</span> <span class="org-kcats-brackets">[</span>c x<span class="org-kcats-brackets">]</span> unassign<span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[[[</span>a b<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>c<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>d e<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>f g<span class="org-kcats-brackets">]]</span> association assign<span class="org-kcats-brackets">]</span> <span class="org-string">"Unassign multiple keys where last doesn't exist, only promotes"</span><span class="org-kcats-brackets">]</span>

                      <span class="org-kcats-brackets">[[[[</span>a <span class="org-kcats-brackets">[[</span>b c<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>d e<span class="org-kcats-brackets">]]]]</span> <span class="org-kcats-brackets">[</span>a d<span class="org-kcats-brackets">]</span> unassign<span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[[]</span> association <span class="org-kcats-brackets">[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> assign<span class="org-kcats-brackets">]</span> <span class="org-string">"Unassign associative keylist from nested structure, promoted to association"</span><span class="org-kcats-brackets">]</span>

                      <span class="org-kcats-brackets">[[[</span>0 1 2 <span class="org-kcats-brackets">[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]]</span> <span class="org-kcats-brackets">[</span>3 c<span class="org-kcats-brackets">]</span> unassign<span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[[</span>0 1 2<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>a b<span class="org-kcats-brackets">]]</span> association <span class="org-function-name">put</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Unassign mixed keylist from nested structure, inner only is promoted to association"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>association? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
               <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> association association?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"Association is an association"</span><span class="org-kcats-brackets">]</span>
                          <span class="org-kcats-brackets">[[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> association?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"A list is not an association, even if it's possible to promote"</span><span class="org-kcats-brackets">]</span>
                          <span class="org-kcats-brackets">[[</span>1 association?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"A number is not an association"</span><span class="org-kcats-brackets">]</span>
                          <span class="org-kcats-brackets">[[[]</span> association?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"An empty list is not an association"</span><span class="org-kcats-brackets">]</span>
                          <span class="org-kcats-brackets">[[[]</span> association association?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"An empty association is an association"</span><span class="org-kcats-brackets">]</span>
                          <span class="org-kcats-brackets">[[[]</span> <span class="org-kcats-brackets">[</span>a<span class="org-kcats-brackets">]</span> 1 assign association?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"A list promoted to association by assignment, is an association"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>association <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>association<span class="org-kcats-brackets">]]]</span>
              <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> association
                           <span class="org-kcats-brackets">[[</span>c d<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>a b<span class="org-kcats-brackets">]]</span> association =<span class="org-kcats-brackets">]</span>
                          <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"A list can be promoted to association"</span><span class="org-kcats-brackets">]</span>

                         <span class="org-kcats-brackets">[[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span>
                           <span class="org-kcats-brackets">[[</span>c d<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>a b<span class="org-kcats-brackets">]]</span> association =<span class="org-kcats-brackets">]</span>
                          <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"An association and list are not the same, even if keys/vals are the same"</span><span class="org-kcats-brackets">]</span>

                         <span class="org-kcats-brackets">[[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span>
                           <span class="org-kcats-brackets">[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> association =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"An association is not the same as the list it was promoted from"</span><span class="org-kcats-brackets">]]]]]</span>
</pre>
</div></div>

<div class='tangle-wrapper' data-tangle='src/kcats/core/associations.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-comment-delimiter">;; </span><span class="org-comment">Associative words</span>
<span class="org-kcats-brackets">[</span>update <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program <span class="org-kcats-brackets">[</span>list keys<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>sized into-association<span class="org-kcats-brackets">]]</span>
                <span class="org-kcats-brackets">[</span>association<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[</span>lookup<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">m ks v p</span>
                      <span class="org-preprocessor">shielddown</span>
                      assign<span class="org-kcats-brackets">]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>a 1<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>b 2<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>inc<span class="org-kcats-brackets">]</span> update<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[</span>a 1<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>b 3<span class="org-kcats-brackets">]]</span> association<span class="org-kcats-brackets">]</span> <span class="org-string">"Update a value in an association"</span><span class="org-kcats-brackets">]</span>

                    <span class="org-kcats-brackets">[[[[</span>a <span class="org-kcats-brackets">[[</span>c 3<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>d 5<span class="org-kcats-brackets">]]]</span> <span class="org-kcats-brackets">[</span>b 2<span class="org-kcats-brackets">]]</span>
                      <span class="org-kcats-brackets">[</span>a c<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>inc<span class="org-kcats-brackets">]</span> update
                      <span class="org-kcats-brackets">[</span>a c<span class="org-kcats-brackets">]</span> lookup<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[</span>4<span class="org-kcats-brackets">]</span> <span class="org-string">"Update a value in a nested association"</span><span class="org-kcats-brackets">]</span>

                    <span class="org-kcats-brackets">[[[[</span>a <span class="org-kcats-brackets">[</span>1 3 5 7<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>b 2<span class="org-kcats-brackets">]]</span>
                      <span class="org-kcats-brackets">[</span>a 2<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>inc<span class="org-kcats-brackets">]</span> update<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[</span>a <span class="org-kcats-brackets">[</span>1 3 6 7<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>b 2<span class="org-kcats-brackets">]]</span> association<span class="org-kcats-brackets">]</span> <span class="org-string">"Update a value in a mixed association/list structure"</span><span class="org-kcats-brackets">]</span>

                    <span class="org-kcats-brackets">[[</span><span class="org-string">"hi"</span>
                      <span class="org-kcats-brackets">[[</span>a <span class="org-kcats-brackets">[[</span>c 3<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>d 5<span class="org-kcats-brackets">]]]</span> <span class="org-kcats-brackets">[</span>b 2<span class="org-kcats-brackets">]]</span>
                      <span class="org-kcats-brackets">[</span>a c<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-builtin">drop</span> 10 15<span class="org-kcats-brackets">]</span> update
                      <span class="org-kcats-brackets">[</span>a c<span class="org-kcats-brackets">]</span> lookup<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[</span><span class="org-string">"hi"</span> 15<span class="org-kcats-brackets">]</span> <span class="org-string">"Update function can't destroy stack items"</span><span class="org-kcats-brackets">]</span>

                    <span class="org-kcats-brackets">[[[[</span>a 1<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>b 2<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>d<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>5<span class="org-kcats-brackets">]</span> update<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[</span>a 1<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>b 2<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>d 5<span class="org-kcats-brackets">]]</span> association<span class="org-kcats-brackets">]</span> <span class="org-string">"Update creates new key when it doesn't exist"</span><span class="org-kcats-brackets">]</span>

                    <span class="org-kcats-brackets">[[[[</span>a <span class="org-kcats-brackets">[[</span>c 3<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>d 5<span class="org-kcats-brackets">]]]</span> <span class="org-kcats-brackets">[</span>b 2<span class="org-kcats-brackets">]]</span>
                      <span class="org-kcats-brackets">[</span>a e<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>5 6 +<span class="org-kcats-brackets">]</span> update
                      <span class="org-kcats-brackets">[</span>a e<span class="org-kcats-brackets">]</span> lookup<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[</span>11<span class="org-kcats-brackets">]</span> <span class="org-string">"Update function can ignore previous value"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>lookup <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>list keys<span class="org-kcats-brackets">]</span> sized<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>something?<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">keylist not empty</span>
                      <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span> <span class="org-builtin">swap</span> <span class="org-kcats-brackets">[</span>get<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">extract the first key and lookup</span>
                      <span class="org-preprocessor">while</span>
                      <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> association <span class="org-kcats-brackets">[</span>a<span class="org-kcats-brackets">]</span> lookup<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>b<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Lookup the value of a key in an association"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>a<span class="org-kcats-brackets">]</span> lookup<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>b<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Lookup the value of a key, promoting a list to association"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>e<span class="org-kcats-brackets">]</span> lookup<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"Looking up a key that doesn't exist returns Nothing"</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[[[</span>outer <span class="org-kcats-brackets">[[</span>a b<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]]]]</span> <span class="org-kcats-brackets">[</span>outer c<span class="org-kcats-brackets">]</span> lookup<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>d<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Lookup in a nested structure, with promotion"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">TODO: fix the case where you just want a value [[type foo]] - only</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">one item but you want the value, not key</span>
<span class="org-kcats-brackets">[</span>type <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[[</span>empty?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span><span class="org-keyword">nothing</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]]</span>
                     <span class="org-kcats-brackets">[[</span>word?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>word<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]]</span>
                     <span class="org-kcats-brackets">[[</span>number?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>number<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]]</span>
                     <span class="org-kcats-brackets">[[</span>string?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>string<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]]</span>
                     <span class="org-kcats-brackets">[[</span>bytes?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>bytes<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]]</span>
                     <span class="org-kcats-brackets">[[</span>pipe?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>pipe<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]]</span>
                     <span class="org-kcats-brackets">[[</span>error?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>error<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]]</span>
                     <span class="org-kcats-brackets">[[</span>environment?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>environment<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]]</span>
                     <span class="org-kcats-brackets">[[</span>set?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>set<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]]</span>
                     <span class="org-kcats-brackets">[[</span>association?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[[[</span>type<span class="org-kcats-brackets">]</span> lookup<span class="org-kcats-brackets">]</span>
                                       <span class="org-kcats-brackets">[[</span><span class="org-function-name">count</span> 1 =<span class="org-kcats-brackets">]</span>
                                        <span class="org-kcats-brackets">[[</span><span class="org-function-name">first</span> <span class="org-kcats-brackets">[</span>type<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> =<span class="org-kcats-brackets">]</span>
                                         <span class="org-kcats-brackets">[</span><span class="org-function-name">first</span> <span class="org-function-name">second</span><span class="org-kcats-brackets">]</span>
                                         <span class="org-kcats-brackets">[</span><span class="org-function-name">first</span> <span class="org-function-name">first</span><span class="org-kcats-brackets">]</span>
                                         <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]</span>
                                        <span class="org-kcats-brackets">[[]]</span>
                                        <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]</span>
                                       <span class="org-kcats-brackets">[[</span>association<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]]</span>
                                      <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> any?<span class="org-kcats-brackets">]]</span>
                     <span class="org-kcats-brackets">[[</span>list?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>list<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]]]</span>
                    decide <span class="org-builtin">dropdown</span><span class="org-kcats-brackets">]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>foo 1<span class="org-kcats-brackets">]]</span> association type<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>foo<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"An association with one key assumes it is its type"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[</span>1 type<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>number<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Integers are of type number"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[</span>1.0 type<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>number<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Floats are of type number"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[[]</span> type<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span><span class="org-keyword">nothing</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Empty list is of type nothing"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> encode type<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>bytes<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"A byte array is of type bytes"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> type<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>string<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"A string is of type string"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[[</span>1 2 3<span class="org-kcats-brackets">]</span> set type<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>set<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"A set is of type set"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[[]</span> environment type<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>environment<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"An environment is of type environment"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[[[</span>type foo<span class="org-kcats-brackets">]]</span> association type<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>foo<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"An association with a single type key, the value is its type"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[[[</span>type foo<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>attr <span class="org-string">"blah"</span><span class="org-kcats-brackets">]]</span> association type<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>foo<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"An association with a single type key, the value is its type"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[[[</span>attr1 foo<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>attr2 <span class="org-string">"blah"</span><span class="org-kcats-brackets">]]</span> association type<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>association<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"An association with multiple keys and no type key, is of type association"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[[[</span>type url<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>value <span class="org-string">"http://foo.com"</span><span class="org-kcats-brackets">]]</span> association type<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>url<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]</span> <span class="org-string">"An association with type/value keys, uses the type key for its type"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>value <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>sized into-association<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span><span class="org-function-name">count</span> 1 =<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">if it's a single item</span>
                     <span class="org-kcats-brackets">[</span><span class="org-function-name">first</span> <span class="org-function-name">second</span><span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">the value is the value of that first item</span>
                     <span class="org-kcats-brackets">[[</span>value<span class="org-kcats-brackets">]</span> lookup<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">otherwise look up the key 'value'</span>
                     <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>foo 1<span class="org-kcats-brackets">]]</span> value<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1<span class="org-kcats-brackets">]</span> <span class="org-string">"The value of a single-entry association is the value of the key-value pair"</span><span class="org-kcats-brackets">]</span>

                   <span class="org-kcats-brackets">[[[[</span>type url<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>value <span class="org-string">"http://foo.com"</span><span class="org-kcats-brackets">]]</span> value<span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[</span><span class="org-string">"http://foo.com"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"The value of an object is the value key"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>zip <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>dispenser values<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>dispenser keys<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[]</span> <span class="org-builtin">sink</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">save accumulator below args</span>
                   <span class="org-kcats-brackets">[[</span>something?<span class="org-kcats-brackets">]</span> both?<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">stop when either list is empty</span>
                   <span class="org-kcats-brackets">[[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span> both <span class="org-builtin">swapdown</span> pair <span class="org-comment-delimiter">;; </span><span class="org-comment">take from each list and pair them up</span>
                    <span class="org-builtin">sink</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">put</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dipdown</span><span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">put them into the accumulator</span>
                   <span class="org-preprocessor">while</span>
                   <span class="org-builtin">drop</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">drop the empty containers</span>
      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>a b c<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 2 3<span class="org-kcats-brackets">]</span> zip<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[[</span>a 1<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>b 2<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c 3<span class="org-kcats-brackets">]]]</span> <span class="org-string">"Zip two lists together into a single list of pairs"</span><span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[[[</span>a b c d<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 2 3<span class="org-kcats-brackets">]</span> zip<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[[</span>a 1<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>b 2<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>c 3<span class="org-kcats-brackets">]]]</span> <span class="org-string">"Zip two lists of unequal size pads with Nothing values"</span><span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>label <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>sized labels<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>association<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[]</span> <span class="org-builtin">swap</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">labels acc</span>
                     <span class="org-kcats-brackets">[</span><span class="org-function-name">wrap</span> <span class="org-builtin">float</span> assign<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"Alice"</span> 23 <span class="org-string">"123 Main St"</span> <span class="org-kcats-brackets">[</span>address age name<span class="org-kcats-brackets">]</span> label<span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[[</span>address <span class="org-string">"123 Main St"</span><span class="org-kcats-brackets">]</span>
                      <span class="org-kcats-brackets">[</span>age 23<span class="org-kcats-brackets">]</span>
                      <span class="org-kcats-brackets">[</span>name <span class="org-string">"Alice"</span><span class="org-kcats-brackets">]]</span> association<span class="org-kcats-brackets">]</span>
                    <span class="org-string">"Label values on the stack as an association"</span><span class="org-kcats-brackets">]]]]]</span>
</pre>
</div></div>

<p>
Better zip implementation
</p>
<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>a b c d e<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 2 3<span class="org-kcats-brackets">]</span>
<span class="org-kcats-brackets">[]</span> <span class="org-builtin">sink</span>
<span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span> both <span class="org-builtin">swapdown</span> pair <span class="org-builtin">sink</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">put</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dipdown</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">while</span> <span class="org-builtin">drop</span> <span class="org-builtin">drop</span>
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span>a 1<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span>b 2<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span>c 3<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span>d <span class="org-kcats-brackets">[]]</span>
 <span class="org-kcats-brackets">[</span>e <span class="org-kcats-brackets">[]]]</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-kcats"><span class="org-string">"asd"</span> <span class="org-kcats-brackets">[</span>\a \b 1<span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span>
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>\a \s \d \a \b 1<span class="org-kcats-brackets">]</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>\b \c<span class="org-kcats-brackets">]</span> <span class="org-string">"a"</span>  <span class="org-function-name">join</span>
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-string">"bca"</span>
</pre>
</div>
</div>
</div>
