lexicon.org
*** Sets
#+begin_src kcats :tangle src/kcats/stdlib/sets-builtins.kcats :mkdirp yes
  ;; TODO add 'set' type for spec?
  [[set [[spec [[item] [item]]]
         [examples [[[[1 2 3 1 2 3] set] [[1 2 3] set] "Promote a list to a set"]
                    [["hello" set] ["helo" set] "Promote a string to a set"]]]]]

   [set? [[spec [[item] [boolean]]]
          [examples [[[[1 2 3] set set?] [yes] "A set is a set"]
                     [[[1 2 3] set?] [[]] "A list is not a set"]]]]]

   [contains? [[spec [[item [item container]] [boolean]]]
               [examples [[[[1 2 3] 3 contains?] [yes] "List contains a number"]
                          [[[1 2 3 3 5] set 3 contains?] [yes] "A set contains a number"]
                          [[[1 2 3] 4 contains?] [[]] "A list doesn't contain a number"]
                          [[5 3 contains?] [[]] "A number is atomic and doesn't contain anything"]
                          [[[foo] unwrap \o contains?] [[]] "A word is atomic and doesn't contain anything"]
                          [["food" "foo" contains?] [yes] "A string contains a sub-string"]
                          [[[a b c d] [b c] contains?] [[]] "A list doesn't contain a sub-list (due to ambiguity with what 'contains' means with lists)"]
                          [[[a [b c] d] [b c] contains?] [yes] "A list contains another list"]
                          [[[a [b c] d] set [b c] contains?] [yes] "A set contains a list"]
                          [["food" \o contains?] [yes] "A string contains a character"]]]]]

   [intersection [[spec [[sized sized] [sized]]]
                  [examples [[[[1 2 3] [2 3 4] intersection] [[2 3] set] "Intersection of two lists expressed as set"]]]]]]

  join
#+end_src

