lexicon.html
<div id="outline-container-orgafc2456" class="outline-4">
<h4 id="orgafc2456"><span class="section-number-4">1.4.2.</span> Sets</h4>
<div class="outline-text-4" id="text-1-4-2">
<div class='tangle-wrapper' data-tangle='src/kcats/stdlib/sets-builtins.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-comment-delimiter">;; </span><span class="org-comment">TODO add 'set' type for spec?</span>
<span class="org-kcats-brackets">[[</span>set <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 3 1 2 3<span class="org-kcats-brackets">]</span> set<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1 2 3<span class="org-kcats-brackets">]</span> set<span class="org-kcats-brackets">]</span> <span class="org-string">"Promote a list to a set"</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[</span><span class="org-string">"hello"</span> set<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"helo"</span> set<span class="org-kcats-brackets">]</span> <span class="org-string">"Promote a string to a set"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span>set? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 3<span class="org-kcats-brackets">]</span> set set?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"A set is a set"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[[</span>1 2 3<span class="org-kcats-brackets">]</span> set?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"A list is not a set"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span>contains? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item <span class="org-kcats-brackets">[</span>item container<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
             <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 3<span class="org-kcats-brackets">]</span> 3 contains?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"List contains a number"</span><span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[[[</span>1 2 3 3 5<span class="org-kcats-brackets">]</span> set 3 contains?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"A set contains a number"</span><span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[[[</span>1 2 3<span class="org-kcats-brackets">]</span> 4 contains?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"A list doesn't contain a number"</span><span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[[</span>5 3 contains?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"A number is atomic and doesn't contain anything"</span><span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[[[</span>foo<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> \o contains?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"A word is atomic and doesn't contain anything"</span><span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[[</span><span class="org-string">"food"</span> <span class="org-string">"foo"</span> contains?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"A string contains a sub-string"</span><span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[[[</span>a b c d<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>b c<span class="org-kcats-brackets">]</span> contains?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-string">"A list doesn't contain a sub-list (due to ambiguity with what 'contains' means with lists)"</span><span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[[[</span>a <span class="org-kcats-brackets">[</span>b c<span class="org-kcats-brackets">]</span> d<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>b c<span class="org-kcats-brackets">]</span> contains?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"A list contains another list"</span><span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[[[</span>a <span class="org-kcats-brackets">[</span>b c<span class="org-kcats-brackets">]</span> d<span class="org-kcats-brackets">]</span> set <span class="org-kcats-brackets">[</span>b c<span class="org-kcats-brackets">]</span> contains?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"A set contains a list"</span><span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[[</span><span class="org-string">"food"</span> \o contains?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]</span> <span class="org-string">"A string contains a character"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span>intersection <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>sized sized<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>sized<span class="org-kcats-brackets">]]]</span>
                <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2 3 4<span class="org-kcats-brackets">]</span> intersection<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>2 3<span class="org-kcats-brackets">]</span> set<span class="org-kcats-brackets">]</span> <span class="org-string">"Intersection of two lists expressed as set"</span><span class="org-kcats-brackets">]]]]]]</span>

<span class="org-function-name">join</span>
</pre>
</div></div>
</div>
</div>
