lexicon.org
*** Generators
#+begin_src kcats :tangle src/kcats/stdlib/generators.kcats :mkdirp yes
  ;; infinite sequence (generators) functions

  [[generate [[spec [[program item] [program item]]]
              [definition [clone [execute] dive]]
              [examples [[[1 [inc clone] generate] [2 [inc clone] 2] "Generate a value from state"]]]]]

   [liberate [[spec [[] [program]]]
              [definition [[take]]]]]

   [assemble [[spec [[[program generators] dispenser] [sized]]]
              [definition [[*2 [take] **1 collect] pack shield]]
              [examples [[[[1 2 3 4 5] [[odd?] keep [inc] each] assemble] [[2 4 6]]
                          "Assemble a sequence from a dispenser and a stack of generators"]]]]]

   [prime [[spec [[[program body]
                   [program pred]
                   [program init]]
                  [*]]]
           [definition [[clone [execute] dip] dipdown float join while]]
           [examples [[[0 [1 2 3 4] [take] [] [swap [+] dip] prime drop drop] [10]
                       "Prime executes init before each time through the loop"]]]]]


   [into [[spec [[sized program] [list]]]
          [definition [[generate] dip ;; n
                       swap clone ;; n n r
                       [put ;; r
                        [generate] dip ;; r n
                        swap clone]  ;; n n r
                       loop drop]]
          [examples [[[[[\a \b \c \d] [take] "" into] shield]
                      ["abcd"] "Generate into an empty string"]
                     [[[0 10 1 range [take]
                        5 dropper
                        [10 *] each
                        [] into]
                       shield]
                      [[50 60 70 80 90]] "Generate a sequence and put it into the given container"]]]]]

   [collect [[spec [[program] [list]]]
             [definition [[] into]]
             [examples [[[[[1 2 3 4] [take] collect] shield]
                         [[1 2 3 4]]]
                        [[[0 10 1 range [take]
                           5 dropper
                           [10 *] each
                           collect]
                          shield]
                         [[50 60 70 80 90]] "Collect from a generator into an empty list"]]]]]

   [each [[spec [[program] [program]]]
          [definition [[generate] swap
                       [bail shielddown] decorate
                       join]]
          [examples [[[[1 2 3 4]
                       [[clone *] each]
                       assemble]

                      [[1 4 9 16]] "Generate a sequence transforming each value"]]]]]

   [joiner [[spec [[] [program]]]
            [definition [[generate [] swap
                          []
                          [join
                           [generate] dive]
                          while drop]]]
            [examples [[[[[1 2 3] [4 5 6] [7 8 9]]
                         [joiner]
                         assemble]

                        [[[1 2 3 4 5 6 7 8 9]]]]]]]]

   [taker [[spec [[] [program]]]
           [definition [[[positive?] [dec [generate] dive] [[]] if]]]
           [examples [[[[1 2 3 4 5]
                        [3 taker]
                        assemble]

                       [[1 2 3]]]]]]]

   [catcher [[spec [[] [program]]]
             [definition [[[generate] dive
                           [[[clone] dive execute] bail not]
                           [drop []]
                           when]]]
             [examples [[[[1 2 3 -4 5]
                          [[positive?] catcher]
                          assemble]

                         [[1 2 3]]]]]]]

   [dropper [[spec [[] [program]]]
             [definition [[[[positive?]
                            [[generate drop] dip dec]
                            while
                            [generate swap] dip float]
                           bail]]]
             [examples [[[[1 2 3 4 5]
                          [3 dropper]
                          assemble]

                         [[4 5]]]]]]]

   [skipper [[spec [[] [program]]]
             [definition [[] ;; the state (whether threshold reached)
                          [[] ;; condition - whether we've finished dropping or not
                           [[generate] divedown] ;; true - pass everything else through
                           ;; false - generate, check pred, repeat
                           [[[generate] divedown] ;; prime init
                            [[[clone] divedown execute] bail] ;; bring pred up and exec it
                            [drop] ;; if pred passes drop the value
                            prime ;; after this should have value on top
                            [drop true] dip]
                           if]]]
             [examples [[[[1 2 -3 4 5]
                          [[positive?] skipper]
                          assemble]

                         [[-3 4 5]]]]]]]

   [keep [[spec [[program] [program]]]
          [definition [[[[something?] [**1 not]] [execute] every?] pack
                       [clone
                        [[generate] dip ;; pred 1
                         [drop generate]
                         while]
                        dive]]]
          [examples [[[[1 2 3 4 5]
                       [[odd?] keep]
                       assemble]

                      [[1 3 5]]]]]]]

   [group [[spec [[[program group-by]] [association]]]
           [definition [[*1 shield ;; k v state
                         wrap swap  ;;  v k state
                         wrap [put] join update] pack
                        [] association ;; state f
                        swap cram]]
           [examples [[[[[1 2 3 4] liberate [odd?] group] shield]
                       [[[yes [1 3]] [[] [2 4]]] association]]]]]]

   [split [[spec [[sized] [program sized sized]]]
           [definition [[empty] [divedown shield] decorated
                        [[[generate] divedown [clone [put] dip] bail]
                         [[[] [drop swap ends? not]] [execute] every?]
                         [drop] prime
                         drop
                         [swap ends?]
                         [[[count] shield] dive
                          [[count] shield] dive swap - [0] dip slice]
                         when
                         [empty] shield swap]]]
           [examples [[["abcabc" ["b" split] assemble]
                       [["a" "ca" "c"]]]
                      [[[1 2 3 4 2 5] [[2] split] assemble]
                       [[[1] [3 4] [5]]]]]]]]

   [combinations [[spec [[] [program]]]
                  [definition [[count] shield -1 ;; l idx i
                               [[[swap count =] dive] [drop drop take 0 swap] when
                                [[wrap lookup] dive [pair] bail] shield [inc] dipdown]]]
                  [examples [[[[1 2 3] [combinations] assemble] [[[1 2] [1 3] [2 3]]]]]]]]

   [frequencies [[spec [[] [association]]]
                 [definition [[] association
                              [wrap [[] [inc] [1] if] update]
                              cram]]
                 [examples [[[["Hello there!" [take] frequencies] shield]
                             [[[\space 1]
                               [\! 1]
                               [\H 1]
                               [\e 3]
                               [\h 1]
                               [\l 2]
                               [\o 1]
                               [\r 1]
                               [\t 1]] association]]]]]]

   [fold [[spec [[[program reducing-function] [program generator]] [item]]]
          [definition [[[generate] dive [] [**1 clone] when] pack
                       ;; generate the first item under the loop body
                       [generate clone] dip
                       loop]]
          [examples [[[[integers 1 dropper 10 taker [+] fold] shield] [55]]]]]]

   [cram [[spec [[[program reducing-function]
                  [item initial-value]
                  [program generator]] [item]]]
          [definition [[[generate] dive]
                       []
                       float prime drop]]
          [examples [[[[integers 1 dropper 10 taker 0 [+] cram] shield] [55]]]]]]



   [integers [[spec [[] [program]]]
              [definition [-1 [inc clone]]]]]]
  join
#+end_src

#+begin_src kcats :tangle src/kcats/stdlib/more-generators.kcats :mkdirp yes
    ;; partition
    [[] [program]] ;; the spec
    ;; construct the dynamic definition for partition

    [[take-chunk [[taker collect
                   dropdown dropdown] ; drop the used-up taker generator
                  join divedeep]]
     [shift [[[count <=]
              [swap 0 slice]
              [[]] if] shield swap]]]
    [[]
     [over wrap take-chunk [join shift] bail]
     [[over] dive wrap take-chunk swap drop shift]
     if] let 
    ;; add an empty list for the partition state
    [[]] swap put ;; the definition

    [[[[1 2 3 4 5 6 7] [2 2 partition] assemble]
      [[[1 2] [3 4] [5 6] [7]]]]] ;; examples

    [examples definition spec] label [partition] swap assign
    [[pairwise [[spec [[program] [*]]]
                [definition [[[] evert ;; capture stack
                              [2 2 partition] assemble] dip ;; pair up stack items
                             inject ;; run the program on the pairs
                             [joiner] assemble ;; unpair the items
                             unwrap [] swap evert drop]] ;; restore as the stack
                [examples [[[1 2 3 4 5 [swap] pairwise] [1 4 5 2 3]]
                           [[1 2 3 4 5 [float] pairwise] [2 3 4 5 1]]
                           [[1 2 3 4 5 [[[+] inject] both] pairwise] [1 5 9]]]]]]]
    join
#+end_src

