lexicon.html
<div id="outline-container-org550dd82" class="outline-4">
<h4 id="org550dd82"><span class="section-number-4">1.4.3.</span> Generators</h4>
<div class="outline-text-4" id="text-1-4-3">
<div class='tangle-wrapper' data-tangle='src/kcats/stdlib/generators.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-comment-delimiter">;; </span><span class="org-comment">infinite sequence (generators) functions</span>

<span class="org-kcats-brackets">[[</span>generate <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>program item<span class="org-kcats-brackets">]]]</span>
            <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span><span class="org-kcats-brackets">]]</span>
            <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 <span class="org-kcats-brackets">[</span>inc <span class="org-builtin">clone</span><span class="org-kcats-brackets">]</span> generate<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2 <span class="org-kcats-brackets">[</span>inc <span class="org-builtin">clone</span><span class="org-kcats-brackets">]</span> 2<span class="org-kcats-brackets">]</span> <span class="org-string">"Generate a value from state"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span>liberate <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>program<span class="org-kcats-brackets">]]]</span>
            <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span>assemble <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program generators<span class="org-kcats-brackets">]</span> dispenser<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>sized<span class="org-kcats-brackets">]]]</span>
            <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>*2 <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span> **1 collect<span class="org-kcats-brackets">]</span> pack <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]]</span>
            <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 3 4 5<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>odd?<span class="org-kcats-brackets">]</span> keep <span class="org-kcats-brackets">[</span>inc<span class="org-kcats-brackets">]</span> each<span class="org-kcats-brackets">]</span> assemble<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>2 4 6<span class="org-kcats-brackets">]]</span>
                        <span class="org-string">"Assemble a sequence from a dispenser and a stack of generators"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span>prime <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program body<span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[</span>program pred<span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[</span>program init<span class="org-kcats-brackets">]]</span>
                <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span><span class="org-builtin">clone</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dipdown</span> <span class="org-builtin">float</span> <span class="org-function-name">join</span> <span class="org-preprocessor">while</span><span class="org-kcats-brackets">]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>0 <span class="org-kcats-brackets">[</span>1 2 3 4<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span> <span class="org-kcats-brackets">[</span>+<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]</span> prime <span class="org-builtin">drop</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>10<span class="org-kcats-brackets">]</span>
                     <span class="org-string">"Prime executes init before each time through the loop"</span><span class="org-kcats-brackets">]]]]]</span>


 <span class="org-kcats-brackets">[</span>into <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>sized program<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>generate<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">n</span>
                     <span class="org-builtin">swap</span> <span class="org-builtin">clone</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">n n r</span>
                     <span class="org-kcats-brackets">[</span><span class="org-function-name">put</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">r</span>
                      <span class="org-kcats-brackets">[</span>generate<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">r n</span>
                      <span class="org-builtin">swap</span> <span class="org-builtin">clone</span><span class="org-kcats-brackets">]</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">n n r</span>
                     <span class="org-preprocessor">loop</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>\a \b \c \d<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span> <span class="org-string">""</span> into<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[</span><span class="org-string">"abcd"</span><span class="org-kcats-brackets">]</span> <span class="org-string">"Generate into an empty string"</span><span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[[[</span>0 10 1 range <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span>
                      5 dropper
                      <span class="org-kcats-brackets">[</span>10 *<span class="org-kcats-brackets">]</span> each
                      <span class="org-kcats-brackets">[]</span> into<span class="org-kcats-brackets">]</span>
                     <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[</span>50 60 70 80 90<span class="org-kcats-brackets">]]</span> <span class="org-string">"Generate a sequence and put it into the given container"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span>collect <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[]</span> into<span class="org-kcats-brackets">]]</span>
           <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>1 2 3 4<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span> collect<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[[</span>1 2 3 4<span class="org-kcats-brackets">]]]</span>
                      <span class="org-kcats-brackets">[[[</span>0 10 1 range <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span>
                         5 dropper
                         <span class="org-kcats-brackets">[</span>10 *<span class="org-kcats-brackets">]</span> each
                         collect<span class="org-kcats-brackets">]</span>
                        <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[[</span>50 60 70 80 90<span class="org-kcats-brackets">]]</span> <span class="org-string">"Collect from a generator into an empty list"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span>each <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>program<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>generate<span class="org-kcats-brackets">]</span> <span class="org-builtin">swap</span>
                     <span class="org-kcats-brackets">[</span>bail <span class="org-preprocessor">shielddown</span><span class="org-kcats-brackets">]</span> decorate
                     <span class="org-function-name">join</span><span class="org-kcats-brackets">]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 3 4<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span><span class="org-builtin">clone</span> *<span class="org-kcats-brackets">]</span> each<span class="org-kcats-brackets">]</span>
                     assemble<span class="org-kcats-brackets">]</span>

                    <span class="org-kcats-brackets">[[</span>1 4 9 16<span class="org-kcats-brackets">]]</span> <span class="org-string">"Generate a sequence transforming each value"</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span>joiner <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>program<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>generate <span class="org-kcats-brackets">[]</span> <span class="org-builtin">swap</span>
                        <span class="org-kcats-brackets">[]</span>
                        <span class="org-kcats-brackets">[</span><span class="org-function-name">join</span>
                         <span class="org-kcats-brackets">[</span>generate<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span><span class="org-kcats-brackets">]</span>
                        <span class="org-preprocessor">while</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>4 5 6<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>7 8 9<span class="org-kcats-brackets">]]</span>
                       <span class="org-kcats-brackets">[</span>joiner<span class="org-kcats-brackets">]</span>
                       assemble<span class="org-kcats-brackets">]</span>

                      <span class="org-kcats-brackets">[[[</span>1 2 3 4 5 6 7 8 9<span class="org-kcats-brackets">]]]]]]]]</span>

 <span class="org-kcats-brackets">[</span>taker <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>program<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[</span>positive?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>dec <span class="org-kcats-brackets">[</span>generate<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]</span> <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 3 4 5<span class="org-kcats-brackets">]</span>
                      <span class="org-kcats-brackets">[</span>3 taker<span class="org-kcats-brackets">]</span>
                      assemble<span class="org-kcats-brackets">]</span>

                     <span class="org-kcats-brackets">[[</span>1 2 3<span class="org-kcats-brackets">]]]]]]]</span>

 <span class="org-kcats-brackets">[</span>catcher <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>program<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[</span>generate<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span>
                         <span class="org-kcats-brackets">[[[</span><span class="org-builtin">clone</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span> <span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> bail not<span class="org-kcats-brackets">]</span>
                         <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-kcats-brackets">[]]</span>
                         when<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 3 -4 5<span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[[</span>positive?<span class="org-kcats-brackets">]</span> catcher<span class="org-kcats-brackets">]</span>
                        assemble<span class="org-kcats-brackets">]</span>

                       <span class="org-kcats-brackets">[[</span>1 2 3<span class="org-kcats-brackets">]]]]]]]</span>

 <span class="org-kcats-brackets">[</span>dropper <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>program<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[[</span>positive?<span class="org-kcats-brackets">]</span>
                          <span class="org-kcats-brackets">[[</span>generate <span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> dec<span class="org-kcats-brackets">]</span>
                          <span class="org-preprocessor">while</span>
                          <span class="org-kcats-brackets">[</span>generate <span class="org-builtin">swap</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-builtin">float</span><span class="org-kcats-brackets">]</span>
                         bail<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 3 4 5<span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[</span>3 dropper<span class="org-kcats-brackets">]</span>
                        assemble<span class="org-kcats-brackets">]</span>

                       <span class="org-kcats-brackets">[[</span>4 5<span class="org-kcats-brackets">]]]]]]]</span>

 <span class="org-kcats-brackets">[</span>skipper <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>program<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">the state (whether threshold reached)</span>
                        <span class="org-kcats-brackets">[[]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">condition - whether we've finished dropping or not</span>
                         <span class="org-kcats-brackets">[[</span>generate<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">divedown</span><span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">true - pass everything else through</span>
                         <span class="org-comment-delimiter">;; </span><span class="org-comment">false - generate, check pred, repeat</span>
                         <span class="org-kcats-brackets">[[[</span>generate<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">divedown</span><span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">prime init</span>
                          <span class="org-kcats-brackets">[[[</span><span class="org-builtin">clone</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">divedown</span> <span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> bail<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">bring pred up and exec it</span>
                          <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">if pred passes drop the value</span>
                          prime <span class="org-comment-delimiter">;; </span><span class="org-comment">after this should have value on top</span>
                          <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-keyword">true</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]</span>
                         <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 -3 4 5<span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[[</span>positive?<span class="org-kcats-brackets">]</span> skipper<span class="org-kcats-brackets">]</span>
                        assemble<span class="org-kcats-brackets">]</span>

                       <span class="org-kcats-brackets">[[</span>-3 4 5<span class="org-kcats-brackets">]]]]]]]</span>

 <span class="org-kcats-brackets">[</span>keep <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>program<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[[</span>something?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>**1 not<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> every?<span class="org-kcats-brackets">]</span> pack
                     <span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span>
                      <span class="org-kcats-brackets">[[</span>generate<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">pred 1</span>
                       <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> generate<span class="org-kcats-brackets">]</span>
                       <span class="org-preprocessor">while</span><span class="org-kcats-brackets">]</span>
                      <span class="org-preprocessor">dive</span><span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 3 4 5<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span>odd?<span class="org-kcats-brackets">]</span> keep<span class="org-kcats-brackets">]</span>
                     assemble<span class="org-kcats-brackets">]</span>

                    <span class="org-kcats-brackets">[[</span>1 3 5<span class="org-kcats-brackets">]]]]]]]</span>

 <span class="org-kcats-brackets">[</span>group <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program group-by<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>association<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>*1 <span class="org-preprocessor">shield</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">k v state</span>
                       <span class="org-function-name">wrap</span> <span class="org-builtin">swap</span>  <span class="org-comment-delimiter">;;  </span><span class="org-comment">v k state</span>
                       <span class="org-function-name">wrap</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">put</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span> update<span class="org-kcats-brackets">]</span> pack
                      <span class="org-kcats-brackets">[]</span> association <span class="org-comment-delimiter">;; </span><span class="org-comment">state f</span>
                      <span class="org-builtin">swap</span> cram<span class="org-kcats-brackets">]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>1 2 3 4<span class="org-kcats-brackets">]</span> liberate <span class="org-kcats-brackets">[</span>odd?<span class="org-kcats-brackets">]</span> group<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[</span>yes <span class="org-kcats-brackets">[</span>1 3<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>2 4<span class="org-kcats-brackets">]]]</span> association<span class="org-kcats-brackets">]]]]]]</span>

 <span class="org-kcats-brackets">[</span>split <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>sized<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>program sized sized<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>empty<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">divedown</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> decorated
                      <span class="org-kcats-brackets">[[[</span>generate<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">divedown</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">put</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]</span> bail<span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[[[]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-builtin">swap</span> ends? not<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> every?<span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span> prime
                       <span class="org-builtin">drop</span>
                       <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span> ends?<span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[[[</span><span class="org-function-name">count</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span>
                        <span class="org-kcats-brackets">[[</span><span class="org-function-name">count</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span> <span class="org-builtin">swap</span> - <span class="org-kcats-brackets">[</span>0<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> slice<span class="org-kcats-brackets">]</span>
                       when
                       <span class="org-kcats-brackets">[</span>empty<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> <span class="org-builtin">swap</span><span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"abcabc"</span> <span class="org-kcats-brackets">[</span><span class="org-string">"b"</span> split<span class="org-kcats-brackets">]</span> assemble<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[</span><span class="org-string">"a"</span> <span class="org-string">"ca"</span> <span class="org-string">"c"</span><span class="org-kcats-brackets">]]]</span>
                    <span class="org-kcats-brackets">[[[</span>1 2 3 4 2 5<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>2<span class="org-kcats-brackets">]</span> split<span class="org-kcats-brackets">]</span> assemble<span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[[[</span>1<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3 4<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>5<span class="org-kcats-brackets">]]]]]]]]</span>

 <span class="org-kcats-brackets">[</span>combinations <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>program<span class="org-kcats-brackets">]]]</span>
                <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span><span class="org-function-name">count</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> -1 <span class="org-comment-delimiter">;; </span><span class="org-comment">l idx i</span>
                             <span class="org-kcats-brackets">[[[</span><span class="org-builtin">swap</span> <span class="org-function-name">count</span> =<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-builtin">drop</span> <span class="org-function-name">take</span> 0 <span class="org-builtin">swap</span><span class="org-kcats-brackets">]</span> when
                              <span class="org-kcats-brackets">[[</span><span class="org-function-name">wrap</span> lookup<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span> <span class="org-kcats-brackets">[</span>pair<span class="org-kcats-brackets">]</span> bail<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> <span class="org-kcats-brackets">[</span>inc<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dipdown</span><span class="org-kcats-brackets">]]]</span>
                <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 2 3<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>combinations<span class="org-kcats-brackets">]</span> assemble<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[[</span>1 2<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 3<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2 3<span class="org-kcats-brackets">]]]]]]]]</span>

 <span class="org-kcats-brackets">[</span>frequencies <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>association<span class="org-kcats-brackets">]]]</span>
               <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[]</span> association
                            <span class="org-kcats-brackets">[</span><span class="org-function-name">wrap</span> <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>inc<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]</span> update<span class="org-kcats-brackets">]</span>
                            cram<span class="org-kcats-brackets">]]</span>
               <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span><span class="org-string">"Hello there!"</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span> frequencies<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span>
                           <span class="org-kcats-brackets">[[[</span>\space 1<span class="org-kcats-brackets">]</span>
                             <span class="org-kcats-brackets">[</span>\! 1<span class="org-kcats-brackets">]</span>
                             <span class="org-kcats-brackets">[</span>\H 1<span class="org-kcats-brackets">]</span>
                             <span class="org-kcats-brackets">[</span>\e 3<span class="org-kcats-brackets">]</span>
                             <span class="org-kcats-brackets">[</span>\h 1<span class="org-kcats-brackets">]</span>
                             <span class="org-kcats-brackets">[</span>\l 2<span class="org-kcats-brackets">]</span>
                             <span class="org-kcats-brackets">[</span>\o 1<span class="org-kcats-brackets">]</span>
                             <span class="org-kcats-brackets">[</span>\r 1<span class="org-kcats-brackets">]</span>
                             <span class="org-kcats-brackets">[</span>\t 1<span class="org-kcats-brackets">]]</span> association<span class="org-kcats-brackets">]]]]]]</span>

 <span class="org-kcats-brackets">[</span>fold <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program reducing-function<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>program generator<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[</span>generate<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span> <span class="org-kcats-brackets">[]</span> <span class="org-kcats-brackets">[</span>**1 <span class="org-builtin">clone</span><span class="org-kcats-brackets">]</span> when<span class="org-kcats-brackets">]</span> pack
                     <span class="org-comment-delimiter">;; </span><span class="org-comment">generate the first item under the loop body</span>
                     <span class="org-kcats-brackets">[</span>generate <span class="org-builtin">clone</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span>
                     <span class="org-preprocessor">loop</span><span class="org-kcats-brackets">]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>integers 1 dropper 10 taker <span class="org-kcats-brackets">[</span>+<span class="org-kcats-brackets">]</span> fold<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>55<span class="org-kcats-brackets">]]]]]]</span>

 <span class="org-kcats-brackets">[</span>cram <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program reducing-function<span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[</span>item initial-value<span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[</span>program generator<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[</span>generate<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span><span class="org-kcats-brackets">]</span>
                     <span class="org-kcats-brackets">[]</span>
                     <span class="org-builtin">float</span> prime <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>integers 1 dropper 10 taker 0 <span class="org-kcats-brackets">[</span>+<span class="org-kcats-brackets">]</span> cram<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>55<span class="org-kcats-brackets">]]]]]]</span>



 <span class="org-kcats-brackets">[</span>integers <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>program<span class="org-kcats-brackets">]]]</span>
            <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>-1 <span class="org-kcats-brackets">[</span>inc <span class="org-builtin">clone</span><span class="org-kcats-brackets">]]]]]]</span>
<span class="org-function-name">join</span>
</pre>
</div></div>

<div class='tangle-wrapper' data-tangle='src/kcats/stdlib/more-generators.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-comment-delimiter">;; </span><span class="org-comment">partition</span>
<span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>program<span class="org-kcats-brackets">]]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">the spec</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">construct the dynamic definition for partition</span>

<span class="org-kcats-brackets">[[</span><span class="org-function-name">take</span>-chunk <span class="org-kcats-brackets">[[</span>taker collect
               <span class="org-builtin">dropdown</span> <span class="org-builtin">dropdown</span><span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">; </span><span class="org-comment">drop the used-up taker generator</span>
              <span class="org-function-name">join</span> divedeep<span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>shift <span class="org-kcats-brackets">[[[</span><span class="org-function-name">count</span> &lt;=<span class="org-kcats-brackets">]</span>
          <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span> 0 slice<span class="org-kcats-brackets">]</span>
          <span class="org-kcats-brackets">[[]]</span> <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> <span class="org-builtin">swap</span><span class="org-kcats-brackets">]]]</span>
<span class="org-kcats-brackets">[[]</span>
 <span class="org-kcats-brackets">[</span>over <span class="org-function-name">wrap</span> <span class="org-function-name">take</span>-chunk <span class="org-kcats-brackets">[</span><span class="org-function-name">join</span> shift<span class="org-kcats-brackets">]</span> bail<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[[</span>over<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span> <span class="org-function-name">wrap</span> <span class="org-function-name">take</span>-chunk <span class="org-builtin">swap</span> <span class="org-builtin">drop</span> shift<span class="org-kcats-brackets">]</span>
 <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]</span> let 
<span class="org-comment-delimiter">;; </span><span class="org-comment">add an empty list for the partition state</span>
<span class="org-kcats-brackets">[[]]</span> <span class="org-builtin">swap</span> <span class="org-function-name">put</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">the definition</span>

<span class="org-kcats-brackets">[[[[</span>1 2 3 4 5 6 7<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2 2 partition<span class="org-kcats-brackets">]</span> assemble<span class="org-kcats-brackets">]</span>
  <span class="org-kcats-brackets">[[[</span>1 2<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3 4<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>5 6<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>7<span class="org-kcats-brackets">]]]]]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">examples</span>

<span class="org-kcats-brackets">[</span>examples definition spec<span class="org-kcats-brackets">]</span> label <span class="org-kcats-brackets">[</span>partition<span class="org-kcats-brackets">]</span> <span class="org-builtin">swap</span> assign
<span class="org-kcats-brackets">[[</span>pairwise <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
            <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[]</span> <span class="org-builtin">evert</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">capture stack</span>
                          <span class="org-kcats-brackets">[</span>2 2 partition<span class="org-kcats-brackets">]</span> assemble<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">pair up stack items</span>
                         <span class="org-preprocessor">inject</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">run the program on the pairs</span>
                         <span class="org-kcats-brackets">[</span>joiner<span class="org-kcats-brackets">]</span> assemble <span class="org-comment-delimiter">;; </span><span class="org-comment">unpair the items</span>
                         <span class="org-function-name">unwrap</span> <span class="org-kcats-brackets">[]</span> <span class="org-builtin">swap</span> <span class="org-builtin">evert</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">restore as the stack</span>
            <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 4 5 <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span><span class="org-kcats-brackets">]</span> pairwise<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 4 5 2 3<span class="org-kcats-brackets">]]</span>
                       <span class="org-kcats-brackets">[[</span>1 2 3 4 5 <span class="org-kcats-brackets">[</span><span class="org-builtin">float</span><span class="org-kcats-brackets">]</span> pairwise<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2 3 4 5 1<span class="org-kcats-brackets">]]</span>
                       <span class="org-kcats-brackets">[[</span>1 2 3 4 5 <span class="org-kcats-brackets">[[[</span>+<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">inject</span><span class="org-kcats-brackets">]</span> both<span class="org-kcats-brackets">]</span> pairwise<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 5 9<span class="org-kcats-brackets">]]]]]]]</span>
<span class="org-function-name">join</span>
</pre>
</div></div>
</div>
</div>
</div>
