lexicon.org
** Dictionary modules
#+begin_src kcats :tangle src/kcats/core/dictionary-builtins.kcats :mkdirp yes
  [dictionary [[spec [[] [list]]]]]

  [cache [[spec [[item bytes] [bytes]]]]]

  [decache [[spec [[item] [bytes]]]]]

  [hashbytes [[spec [[bytes] [bytes]]]
              [examples [[[["foo" encode hashbytes] 2 times =] [yes]]
                         [["foo" encode hashbytes
                           "fop" encode hashbytes
                           =]
                          [[]]]]]]]

  [resolve [[spec [[word] [word]]]]]

  [dictmerge [[spec [[[dictionary module] [dictionary original] [bytes hash]] [dictionary]]]]]
#+end_src

#+begin_src kcats :tangle src/kcats/core/dictionary.kcats :mkdirp yes
  [updates [[spec [[[sized word-updates]] [[program single-update]]]]
            [definition [[[take]
                          [[0] [wrap] update ;; wrap the word name to get a path to update
                           [update] join] each
                          joiner generate] shielddown]]]]

  [entry [[spec [[[program definition]] [[association full-entry]]]]
          [definition [[definition] label]]]]

  [words [[spec [[] [association]]]
          [definition [dictionary [words] lookup]]]]

  [module [[spec [[[item wrapped-module-alias-or-hash]] [program]]]
           [doc "reads a cached module from disk and puts it on the stack as a program"]
           [definition [decache string read]]
           [examples [
            [["123" encode [crypto] stdmod [hash] confine]
             [#b64 "_1vRbfFezlcTCUfQCjC1FKukWLoOAeBuvxNXUDbFKSk"]]]]]]

  [inscribe [[spec [[[bytes raw-module] dictionary] [dictionary]]]
             [definition [[[hashbytes] ;; calculate module hash
                           [string read execute]] ;; install the module in the dictionary
                          [execute] map ;; fork 
                          dropdown unwrap swapdown dictmerge]]]]

  [draft [[spec [[[sized definitions]] [[program dictionary-updater]]]]
          [definition [[[1] [entry] update] map ;; create full entries for each definition
                       wrap [join] join]]]]  ;; add 'join' to join the entries with the existing dictionary

  [let [[spec [[program [sized entries]] [*]]]
        [definition [[draft dictionary swap [emit encode hashbytes] shield
                      [[[words] swap update] shield dropdown] dip
                      sink [dictmerge] shielddeep] dip
                     float wrap [put] join
                     swapdown [modules] swap update
                     [dictionary program] label environment
                     ;; TODO try using confine here
                     [*1 capture evaluate [stack] lookup restore] pack]] 
        [examples [[[[[times5 [5 *]]
                      [doubledec [dec dec]]]
                     [3 times5 doubledec] let execute] [13]]
                   [[[[swap [5]]]
                     ["a" "b" "c" swap]
                     let execute]
                    ["a" "b" "c" 5]]
                   [[[[foo ["outer"]]]
                     ["inner"] let
                     [foo] label
                     [foo] let execute] ["inner"]]]]]]

  [definition [[spec [[list] [program]]]
               [definition [[words **1 definition] pack dictionary swap lookup]]
               [examples [[[1 2 3 [flip] definition execute] [3 2 1] "Fetch the definition of a word and use it"]]]]]
#+end_src

#+begin_src kcats
  [[plus2 [2 +]]]
  [5 plus2]
  [draft dictionary swap [emit encode hashbytes] shield
   [[[entries] swap update] shield dropdown] dip
   sink [dictmerge] shielddeep ] dip
  float wrap [put] join
  swapdown [modules] swap update 
  [dictionary program] label environment
  wrap [[snapshot] dive ;; grab a snapshot
        [stack] swap assign ;; set the env's stack to that value
        evaluate
        [stack] lookup restore] ;; promote the result
  join 
  execute
  ;[0 dictionary entries] lookup [first [plus2] unwrap =] filter inspect
#+end_src

#+RESULTS:
#+begin_src kcats
7
#+end_src

#+begin_src kcats
  "foo" "bar"
  [[foop [3 * plus2]]
   [plus2 [2 +]]]
  [5 foop]
  [draft dictionary swap [emit encode hashbytes] shield
   [shield] dip
   sink [dictmerge] shielddeep] dip ;; under the let program ;; prog dict hash
  [wrap] dipdown ;; wrap the hash to make a list of 1 namespace

  [program dictionary] label environment swap pair ;; creates closure
  ;; when the closure executes, capture the outer stack first
  [[[stack] [snapshot] divedown assign] dip using evaluate [stack] lookup restore] join execute
  ;wrap  [[stack] [snapshot] divedown assign evaluate [stack] lookup restore] join ; execute
#+end_src


#+RESULTS:
#+begin_src kcats
#+end_src

#+begin_src kcats
  [a b c d e] [take] 2 2 []

  
  [[take-chunk [[taker collect
                 dropdown dropdown] ; drop the used-up taker generator
                join divedeep]]
   [shift [[[count <=]
            [swap 0 slice]
            [[]] if] shield swap]]]
  [[]
   [over wrap take-chunk [join shift] bail]
   [[over] dive wrap take-chunk swap drop shift]
   if] let
  ;; add an empty list for the partition state
  ;[[]] swap put

  collect
#+end_src

#+RESULTS:
#+begin_src kcats
[[a b]
 [c d]
 [e]]
[[[dictionary dictionary_redacted]
  [program [[] [over wrap take-chunk [join shift]
                bail]
            [[over] dive wrap take-chunk swap drop shift]
            if]]
  [resolver [#b64 "yO3LwN0ITlhqAj8T1IKcUqNoiQmEAyrBwbFpGixDtQ8="]]]
 [stack] [snapshot] divedown assign environment evaluate [stack] lookup restore]
[] 2 2 [take] []
#+end_src

#+begin_src kcats
  [a b c d e] 2 
#+end_src

#+RESULTS:
#+begin_src kcats
[a b]
#+end_src


#+begin_src kcats
  [[take-chunk [[taker collect
                   dropdown dropdown] ; drop the used-up taker generator
                  join divedeep]]
     [shift [[[count <=]
              [swap 0 slice]
              [[]] if] shield swap]]]
    [[]
     [over wrap take-chunk [join shift] bail]
     [[over] dive wrap take-chunk swap drop shift]
     if] let

  partition dropdown  [first [dictionary] lookup [first] map set] both
#+end_src

#+RESULTS:
#+begin_src kcats
[* + - / < <= = > >= abs addmethod and animate any? assert assign association association?
 attend autoformat
 bail bits both both? branch butlast bytes? cache ceiling clone clonedeep clonedown
 close compare confine contains? count cut database days
 dec decache decide decodejson decorate decorated definition dictionary dictmerge
 dip dipdeep dipdown dive divedeep divedown draft drop dropdeep dropdown emit
 empty empty? encode encodejson encodenumber encodestring ends? entry environment
 error? eval-step evaluate even? evert every? execute exp fail file-in file-out
 filter finished? first flatten flip float floor format future generator get handle
 handoff hashbytes hours if inc indexed indexer indexof
 inject inscribe inspect interpose intersection join label last let list? log lookup
 loop map max method? milliseconds min minutes mod
 module negative? not number number? odd? or over pad pair pair? persist pipe-in pipe-out
 pipe? pop positive? prepend prime primrec
 print put quot radix range read receiver recover recur rem repeat rest restore retry
 reverse round second seconds select sender
 serversocket set set? shield shielddeep shielddown shift sink siphon sleep slice
 slurp snapshot socket something? sort sort-indexed spawn spit sqrt
 stage standard starts? step string string? swap swapdown take take-chunk template
 timer times timestamps toe tos triplet tunnel type unassign
 under until unwrap update updates using value walk when while within? word word?
 wrap xor yes zero? zip]
[* + - / < <= = > >= abs addmethod advance and animate any? assemble assert assign
 association association?
 attend autoformat bail bits both both? branch break breakpoint butlast bytes? cache
 catcher ceiling clone clonedeep clonedown close collect combinations
 compare confine contains? count cram cut database days dec decache decide decodejson
 decorate decorated definition dictionary dictmerge dip dipdeep dipdown
 dive divedeep divedown draft drop dropdeep dropdown dropper dump each emit empty
 empty? encode encodejson encodenumber encodestring ends? entry environment
 error? eval-step evaluate even? evert every? execute exp fail file-in file-out filter
 finished? first flatten flip float floor fold format
 frequencies future generate generator get group handle handoff hashbytes heatmap
 hours if inc indexed indexer indexof inject inscribe inspect integers
 interpose intersection into join joiner keep label last let liberate list? log lookup
 loop map max method? milliseconds min minutes
 mod module negative? not number number? odd? or over pad pair pair? pairwise partition
 persist pipe-in pipe-out pipe? pop positive?
 prepend prime primrec print put quot radix range read receiver recover recur rem
 repeat rest restore retry reverse round second
 seconds select sender serversocket set set? shield shielddeep shielddown shift sink
 siphon skipper sleep slice slurp snapshot socket something? sort
 sort-indexed spawn spit split sprint sqrt stage standard starts? step stepper string
 string? swap swapdown take take-chunk taker template timer
 times timestamps toe tos tracer triplet tunnel type unassign under until unwrap update
 updates using value walk when while within?
 word word? wrap xor yes zero? zip]
#+end_src



