lexicon.html
<div id="outline-container-orgf5a0269" class="outline-3">
<h3 id="orgf5a0269"><span class="section-number-3">1.5.</span> Dictionary modules</h3>
<div class="outline-text-3" id="text-1-5">
<div class='tangle-wrapper' data-tangle='src/kcats/core/dictionary-builtins.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>dictionary <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>cache <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item bytes<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>bytes<span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>decache <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>bytes<span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>hashbytes <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>bytes<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>bytes<span class="org-kcats-brackets">]]]</span>
            <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span><span class="org-string">"foo"</span> encode hashbytes<span class="org-kcats-brackets">]</span> 2 <span class="org-preprocessor">times</span> =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                       <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> encode hashbytes
                         <span class="org-string">"fop"</span> encode hashbytes
                         =<span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[[]]]]]]]</span>

<span class="org-kcats-brackets">[</span>resolve <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>word<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>word<span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>dictmerge <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>dictionary module<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>dictionary original<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>bytes hash<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>dictionary<span class="org-kcats-brackets">]]]]]</span>
</pre>
</div></div>

<div class='tangle-wrapper' data-tangle='src/kcats/core/dictionary.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>updates <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>sized word-updates<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[[</span>program single-update<span class="org-kcats-brackets">]]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[[</span>0<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">wrap</span><span class="org-kcats-brackets">]</span> update <span class="org-comment-delimiter">;; </span><span class="org-comment">wrap the word name to get a path to update</span>
                         <span class="org-kcats-brackets">[</span>update<span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> each
                        joiner generate<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shielddown</span><span class="org-kcats-brackets">]]]]</span>

<span class="org-kcats-brackets">[</span>entry <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program definition<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[[</span>association full-entry<span class="org-kcats-brackets">]]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>definition<span class="org-kcats-brackets">]</span> label<span class="org-kcats-brackets">]]]]</span>

<span class="org-kcats-brackets">[</span>words <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>association<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>dictionary <span class="org-kcats-brackets">[</span>words<span class="org-kcats-brackets">]</span> lookup<span class="org-kcats-brackets">]]]]</span>

<span class="org-kcats-brackets">[</span>module <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>item wrapped-module-alias-or-hash<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>doc <span class="org-string">"reads a cached module from disk and puts it on the stack as a program"</span><span class="org-kcats-brackets">]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>decache string read<span class="org-kcats-brackets">]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[</span>
          <span class="org-kcats-brackets">[[</span><span class="org-string">"123"</span> encode <span class="org-kcats-brackets">[</span>crypto<span class="org-kcats-brackets">]</span> stdmod <span class="org-kcats-brackets">[</span>hash<span class="org-kcats-brackets">]</span> confine<span class="org-kcats-brackets">]</span>
           <span class="org-kcats-brackets">[</span>#b64 <span class="org-string">"_1vRbfFezlcTCUfQCjC1FKukWLoOAeBuvxNXUDbFKSk"</span><span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>inscribe <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>bytes raw-module<span class="org-kcats-brackets">]</span> dictionary<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>dictionary<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[</span>hashbytes<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">calculate module hash</span>
                         <span class="org-kcats-brackets">[</span>string read <span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">install the module in the dictionary</span>
                        <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">map</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">fork </span>
                        <span class="org-builtin">dropdown</span> <span class="org-function-name">unwrap</span> <span class="org-builtin">swapdown</span> dictmerge<span class="org-kcats-brackets">]]]]</span>

<span class="org-kcats-brackets">[</span>draft <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>sized definitions<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[[</span>program dictionary-updater<span class="org-kcats-brackets">]]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[</span>1<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>entry<span class="org-kcats-brackets">]</span> update<span class="org-kcats-brackets">]</span> <span class="org-function-name">map</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">create full entries for each definition</span>
                     <span class="org-function-name">wrap</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]]]]</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">add 'join' to join the entries with the existing dictionary</span>

<span class="org-kcats-brackets">[</span>let <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program <span class="org-kcats-brackets">[</span>sized entries<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>draft dictionary <span class="org-builtin">swap</span> <span class="org-kcats-brackets">[</span>emit encode hashbytes<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span>
                    <span class="org-kcats-brackets">[[[</span>words<span class="org-kcats-brackets">]</span> <span class="org-builtin">swap</span> update<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> <span class="org-builtin">dropdown</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span>
                    <span class="org-builtin">sink</span> <span class="org-kcats-brackets">[</span>dictmerge<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shielddeep</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span>
                   <span class="org-builtin">float</span> <span class="org-function-name">wrap</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">put</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span>
                   <span class="org-builtin">swapdown</span> <span class="org-kcats-brackets">[</span>modules<span class="org-kcats-brackets">]</span> <span class="org-builtin">swap</span> update
                   <span class="org-kcats-brackets">[</span>dictionary program<span class="org-kcats-brackets">]</span> label environment
                   <span class="org-function-name">wrap</span> <span class="org-kcats-brackets">[[</span><span class="org-builtin">snapshot</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">grab a snapshot</span>
                         <span class="org-kcats-brackets">[</span>stack<span class="org-kcats-brackets">]</span> <span class="org-builtin">swap</span> assign <span class="org-comment-delimiter">;; </span><span class="org-comment">set the env's stack to that value</span>
                         environment <span class="org-comment-delimiter">;; </span><span class="org-comment">TODO this shouldn't be needed - investigate why sometimes it is</span>
                         evaluate
                         <span class="org-kcats-brackets">[</span>stack<span class="org-kcats-brackets">]</span> lookup restore<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">promote the result</span>
                   <span class="org-function-name">join</span> <span class="org-kcats-brackets">]]</span> 
      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>times5 <span class="org-kcats-brackets">[</span>5 *<span class="org-kcats-brackets">]]</span>
                    <span class="org-kcats-brackets">[</span>doubledec <span class="org-kcats-brackets">[</span>dec dec<span class="org-kcats-brackets">]]]</span>
                   <span class="org-kcats-brackets">[</span>3 times5 doubledec<span class="org-kcats-brackets">]</span> let <span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>13<span class="org-kcats-brackets">]]</span>
                 <span class="org-kcats-brackets">[[[[</span><span class="org-builtin">swap</span> <span class="org-kcats-brackets">[</span>5<span class="org-kcats-brackets">]]]</span>
                   <span class="org-kcats-brackets">[</span><span class="org-string">"a"</span> <span class="org-string">"b"</span> <span class="org-string">"c"</span> <span class="org-builtin">swap</span><span class="org-kcats-brackets">]</span>
                   let <span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[</span><span class="org-string">"a"</span> <span class="org-string">"b"</span> <span class="org-string">"c"</span> 5<span class="org-kcats-brackets">]]</span>
                 <span class="org-kcats-brackets">[[[[</span>foo <span class="org-kcats-brackets">[</span><span class="org-string">"outer"</span><span class="org-kcats-brackets">]]]</span>
                   <span class="org-kcats-brackets">[</span><span class="org-string">"inner"</span><span class="org-kcats-brackets">]</span> let
                   <span class="org-kcats-brackets">[</span>foo<span class="org-kcats-brackets">]</span> label
                   <span class="org-kcats-brackets">[</span>foo<span class="org-kcats-brackets">]</span> let <span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"inner"</span><span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>list<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>program<span class="org-kcats-brackets">]]]</span>
             <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>words **1 definition<span class="org-kcats-brackets">]</span> pack dictionary <span class="org-builtin">swap</span> lookup<span class="org-kcats-brackets">]]</span>
             <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 <span class="org-kcats-brackets">[</span>flip<span class="org-kcats-brackets">]</span> definition <span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3 2 1<span class="org-kcats-brackets">]</span> <span class="org-string">"Fetch the definition of a word and use it"</span><span class="org-kcats-brackets">]]]]]</span>
</pre>
</div></div>

<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span>plus2 <span class="org-kcats-brackets">[</span>2 +<span class="org-kcats-brackets">]]]</span>
<span class="org-kcats-brackets">[</span>5 plus2<span class="org-kcats-brackets">]</span>
<span class="org-kcats-brackets">[</span>draft dictionary <span class="org-builtin">swap</span> <span class="org-kcats-brackets">[</span>emit encode hashbytes<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span>
 <span class="org-kcats-brackets">[[[</span>entries<span class="org-kcats-brackets">]</span> <span class="org-builtin">swap</span> update<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> <span class="org-builtin">dropdown</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span>
 <span class="org-builtin">sink</span> <span class="org-kcats-brackets">[</span>dictmerge<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shielddeep</span> <span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span>
<span class="org-builtin">float</span> <span class="org-function-name">wrap</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">put</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span>
<span class="org-builtin">swapdown</span> <span class="org-kcats-brackets">[</span>modules<span class="org-kcats-brackets">]</span> <span class="org-builtin">swap</span> update 
<span class="org-kcats-brackets">[</span>dictionary program<span class="org-kcats-brackets">]</span> label environment
<span class="org-function-name">wrap</span> <span class="org-kcats-brackets">[[</span><span class="org-builtin">snapshot</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">grab a snapshot</span>
      <span class="org-kcats-brackets">[</span>stack<span class="org-kcats-brackets">]</span> <span class="org-builtin">swap</span> assign <span class="org-comment-delimiter">;; </span><span class="org-comment">set the env's stack to that value</span>
      evaluate
      <span class="org-kcats-brackets">[</span>stack<span class="org-kcats-brackets">]</span> lookup restore<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">promote the result</span>
<span class="org-function-name">join</span> 
<span class="org-preprocessor">execute</span>
<span class="org-comment-delimiter">;</span><span class="org-comment">[0 dictionary entries] lookup [first [plus2] unwrap =] filter inspect</span>
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats">7
</pre>
</div>

<div class="org-src-container">
<pre class="src src-kcats"><span class="org-string">"foo"</span> <span class="org-string">"bar"</span>
<span class="org-kcats-brackets">[[</span>foop <span class="org-kcats-brackets">[</span>3 * plus2<span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>plus2 <span class="org-kcats-brackets">[</span>2 +<span class="org-kcats-brackets">]]]</span>
<span class="org-kcats-brackets">[</span>5 foop<span class="org-kcats-brackets">]</span>
<span class="org-kcats-brackets">[</span>draft dictionary <span class="org-builtin">swap</span> <span class="org-kcats-brackets">[</span>emit encode hashbytes<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span>
 <span class="org-kcats-brackets">[</span><span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span>
 <span class="org-builtin">sink</span> <span class="org-kcats-brackets">[</span>dictmerge<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shielddeep</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">under the let program ;; prog dict hash</span>
<span class="org-kcats-brackets">[</span><span class="org-function-name">wrap</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dipdown</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">wrap the hash to make a list of 1 namespace</span>

<span class="org-kcats-brackets">[</span>program dictionary<span class="org-kcats-brackets">]</span> label environment <span class="org-builtin">swap</span> pair <span class="org-comment-delimiter">;; </span><span class="org-comment">creates closure</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">when the closure executes, capture the outer stack first</span>
<span class="org-kcats-brackets">[[[</span>stack<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">snapshot</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">divedown</span> assign<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> using evaluate <span class="org-kcats-brackets">[</span>stack<span class="org-kcats-brackets">]</span> lookup restore<span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span> <span class="org-preprocessor">execute</span>
<span class="org-comment-delimiter">;</span><span class="org-comment">wrap  [[stack] [snapshot] divedown assign evaluate [stack] lookup restore] join ; execute</span>
</pre>
</div>


<div class="org-src-container results">
<pre class="src src-kcats">
</pre>
</div>

<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>a b c d e<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span> 2 2 <span class="org-kcats-brackets">[]</span>


<span class="org-kcats-brackets">[[</span><span class="org-function-name">take</span>-chunk <span class="org-kcats-brackets">[[</span>taker collect
               <span class="org-builtin">dropdown</span> <span class="org-builtin">dropdown</span><span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">; </span><span class="org-comment">drop the used-up taker generator</span>
              <span class="org-function-name">join</span> divedeep<span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>shift <span class="org-kcats-brackets">[[[</span><span class="org-function-name">count</span> &lt;=<span class="org-kcats-brackets">]</span>
          <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span> 0 slice<span class="org-kcats-brackets">]</span>
          <span class="org-kcats-brackets">[[]]</span> <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> <span class="org-builtin">swap</span><span class="org-kcats-brackets">]]]</span>
<span class="org-kcats-brackets">[[]</span>
 <span class="org-kcats-brackets">[</span>over <span class="org-function-name">wrap</span> <span class="org-function-name">take</span>-chunk <span class="org-kcats-brackets">[</span><span class="org-function-name">join</span> shift<span class="org-kcats-brackets">]</span> bail<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[[</span>over<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span> <span class="org-function-name">wrap</span> <span class="org-function-name">take</span>-chunk <span class="org-builtin">swap</span> <span class="org-builtin">drop</span> shift<span class="org-kcats-brackets">]</span>
 <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]</span> let
<span class="org-comment-delimiter">;; </span><span class="org-comment">add an empty list for the partition state</span>
<span class="org-comment-delimiter">;</span><span class="org-comment">[[]] swap put</span>

collect
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span>a b<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span>c d<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span>e<span class="org-kcats-brackets">]]</span>
<span class="org-kcats-brackets">[[[</span>dictionary dictionary_redacted<span class="org-kcats-brackets">]</span>
  <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>over <span class="org-function-name">wrap</span> <span class="org-function-name">take</span>-chunk <span class="org-kcats-brackets">[</span><span class="org-function-name">join</span> shift<span class="org-kcats-brackets">]</span>
                bail<span class="org-kcats-brackets">]</span>
            <span class="org-kcats-brackets">[[</span>over<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span> <span class="org-function-name">wrap</span> <span class="org-function-name">take</span>-chunk <span class="org-builtin">swap</span> <span class="org-builtin">drop</span> shift<span class="org-kcats-brackets">]</span>
            <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]]</span>
  <span class="org-kcats-brackets">[</span>resolver <span class="org-kcats-brackets">[</span>#b64 <span class="org-string">"yO3LwN0ITlhqAj8T1IKcUqNoiQmEAyrBwbFpGixDtQ8="</span><span class="org-kcats-brackets">]]]</span>
 <span class="org-kcats-brackets">[</span>stack<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">snapshot</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">divedown</span> assign environment evaluate <span class="org-kcats-brackets">[</span>stack<span class="org-kcats-brackets">]</span> lookup restore<span class="org-kcats-brackets">]</span>
<span class="org-kcats-brackets">[]</span> 2 2 <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>a b c d e<span class="org-kcats-brackets">]</span> 2 
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>a b<span class="org-kcats-brackets">]</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span><span class="org-function-name">take</span>-chunk <span class="org-kcats-brackets">[[</span>taker collect
                 <span class="org-builtin">dropdown</span> <span class="org-builtin">dropdown</span><span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">; </span><span class="org-comment">drop the used-up taker generator</span>
                <span class="org-function-name">join</span> divedeep<span class="org-kcats-brackets">]]</span>
   <span class="org-kcats-brackets">[</span>shift <span class="org-kcats-brackets">[[[</span><span class="org-function-name">count</span> &lt;=<span class="org-kcats-brackets">]</span>
            <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span> 0 slice<span class="org-kcats-brackets">]</span>
            <span class="org-kcats-brackets">[[]]</span> <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> <span class="org-builtin">swap</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[]</span>
   <span class="org-kcats-brackets">[</span>over <span class="org-function-name">wrap</span> <span class="org-function-name">take</span>-chunk <span class="org-kcats-brackets">[</span><span class="org-function-name">join</span> shift<span class="org-kcats-brackets">]</span> bail<span class="org-kcats-brackets">]</span>
   <span class="org-kcats-brackets">[[</span>over<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span> <span class="org-function-name">wrap</span> <span class="org-function-name">take</span>-chunk <span class="org-builtin">swap</span> <span class="org-builtin">drop</span> shift<span class="org-kcats-brackets">]</span>
   <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]</span> let

partition <span class="org-builtin">dropdown</span>  <span class="org-kcats-brackets">[</span><span class="org-function-name">first</span> <span class="org-kcats-brackets">[</span>dictionary<span class="org-kcats-brackets">]</span> lookup <span class="org-kcats-brackets">[</span><span class="org-function-name">first</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">map</span> set<span class="org-kcats-brackets">]</span> both
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>* + - / &lt; &lt;= = &gt; &gt;= abs addmethod and animate any? assert assign association association?
 attend autoformat
 bail bits both both? <span class="org-preprocessor">branch</span> butlast bytes? cache ceiling <span class="org-builtin">clone</span> clonedeep clonedown
 close compare confine contains? <span class="org-function-name">count</span> cut database days
 dec decache decide decodejson decorate decorated definition dictionary dictmerge
 <span class="org-preprocessor">dip</span> dipdeep <span class="org-preprocessor">dipdown</span> <span class="org-preprocessor">dive</span> divedeep <span class="org-preprocessor">divedown</span> draft <span class="org-builtin">drop</span> dropdeep <span class="org-builtin">dropdown</span> emit
 empty empty? encode encodejson encodenumber encodestring ends? entry environment
 error? eval-<span class="org-function-name">step</span> evaluate even? <span class="org-builtin">evert</span> every? <span class="org-preprocessor">execute</span> exp fail file-in file-out
 <span class="org-function-name">filter</span> finished? <span class="org-function-name">first</span> flatten flip <span class="org-builtin">float</span> floor format future generator get handle
 handoff hashbytes hours <span class="org-preprocessor">if</span> inc indexed indexer indexof
 <span class="org-preprocessor">inject</span> inscribe inspect interpose intersection <span class="org-function-name">join</span> label <span class="org-function-name">last</span> let list? log lookup
 <span class="org-preprocessor">loop</span> <span class="org-function-name">map</span> max method? milliseconds min minutes mod
 module negative? not number number? odd? or over pad pair pair? persist pipe-in pipe-out
 pipe? <span class="org-function-name">pop</span> positive? prepend prime primrec
 print <span class="org-function-name">put</span> quot radix range read receiver recover <span class="org-preprocessor">recur</span> rem repeat <span class="org-function-name">rest</span> restore retry
 <span class="org-function-name">reverse</span> round <span class="org-function-name">second</span> seconds select sender
 serversocket set set? <span class="org-preprocessor">shield</span> <span class="org-preprocessor">shielddeep</span> <span class="org-preprocessor">shielddown</span> shift <span class="org-builtin">sink</span> siphon sleep slice
 slurp <span class="org-builtin">snapshot</span> socket something? sort sort-indexed spawn spit sqrt
 stage standard starts? <span class="org-function-name">step</span> string string? <span class="org-builtin">swap</span> <span class="org-builtin">swapdown</span> <span class="org-function-name">take</span> <span class="org-function-name">take</span>-chunk template
 timer <span class="org-preprocessor">times</span> timestamps toe tos triplet tunnel type unassign
 under <span class="org-preprocessor">until</span> <span class="org-function-name">unwrap</span> update updates using value walk when <span class="org-preprocessor">while</span> within? word word?
 <span class="org-function-name">wrap</span> xor yes zero? zip<span class="org-kcats-brackets">]</span>
<span class="org-kcats-brackets">[</span>* + - / &lt; &lt;= = &gt; &gt;= abs addmethod advance and animate any? assemble assert assign
 association association?
 attend autoformat bail bits both both? <span class="org-preprocessor">branch</span> break breakpoint butlast bytes? cache
 catcher ceiling <span class="org-builtin">clone</span> clonedeep clonedown close collect combinations
 compare confine contains? <span class="org-function-name">count</span> cram cut database days dec decache decide decodejson
 decorate decorated definition dictionary dictmerge <span class="org-preprocessor">dip</span> dipdeep <span class="org-preprocessor">dipdown</span>
 <span class="org-preprocessor">dive</span> divedeep <span class="org-preprocessor">divedown</span> draft <span class="org-builtin">drop</span> dropdeep <span class="org-builtin">dropdown</span> dropper dump each emit empty
 empty? encode encodejson encodenumber encodestring ends? entry environment
 error? eval-<span class="org-function-name">step</span> evaluate even? <span class="org-builtin">evert</span> every? <span class="org-preprocessor">execute</span> exp fail file-in file-out <span class="org-function-name">filter</span>
 finished? <span class="org-function-name">first</span> flatten flip <span class="org-builtin">float</span> floor fold format
 frequencies future generate generator get group handle handoff hashbytes heatmap
 hours <span class="org-preprocessor">if</span> inc indexed indexer indexof <span class="org-preprocessor">inject</span> inscribe inspect integers
 interpose intersection into <span class="org-function-name">join</span> joiner keep label <span class="org-function-name">last</span> let liberate list? log lookup
 <span class="org-preprocessor">loop</span> <span class="org-function-name">map</span> max method? milliseconds min minutes
 mod module negative? not number number? odd? or over pad pair pair? pairwise partition
 persist pipe-in pipe-out pipe? <span class="org-function-name">pop</span> positive?
 prepend prime primrec print <span class="org-function-name">put</span> quot radix range read receiver recover <span class="org-preprocessor">recur</span> rem
 repeat <span class="org-function-name">rest</span> restore retry <span class="org-function-name">reverse</span> round <span class="org-function-name">second</span>
 seconds select sender serversocket set set? <span class="org-preprocessor">shield</span> <span class="org-preprocessor">shielddeep</span> <span class="org-preprocessor">shielddown</span> shift <span class="org-builtin">sink</span>
 siphon skipper sleep slice slurp <span class="org-builtin">snapshot</span> socket something? sort
 sort-indexed spawn spit split sprint sqrt stage standard starts? <span class="org-function-name">step</span> stepper string
 string? <span class="org-builtin">swap</span> <span class="org-builtin">swapdown</span> <span class="org-function-name">take</span> <span class="org-function-name">take</span>-chunk taker template timer
 <span class="org-preprocessor">times</span> timestamps toe tos tracer triplet tunnel type unassign under <span class="org-preprocessor">until</span> <span class="org-function-name">unwrap</span> update
 updates using value walk when <span class="org-preprocessor">while</span> within?
 word word? <span class="org-function-name">wrap</span> xor yes zero? zip<span class="org-kcats-brackets">]</span>
</pre>
</div>
</div>
</div>
