lexicon.org
** Math
#+begin_src kcats :tangle src/kcats/core/math-builtins.kcats :mkdirp yes
  [+ [[spec [[number number] [number]]]
      [examples [[[1 2 +] [3]]
                 [[1.1 2.2 + 3.3 0.001 within?] [yes]]
                 [[1 2.2 +] [3.2]]]]]]

  [- [[spec [[number number] [number]]]
      [examples [[[2 1 -] [1]]
                 [[1.1 2.2 - -1.1 0.00001 within?] [yes]]
                 [[2.2 1 - 1.2 0.00001 within?] [yes]]]]]]

  [* [[spec [[number number] [number]]]
      [examples [[[4 3 *] [12]]
                 [[10 1.5 * 15 0.0001 within?] [yes]]
                 [[5 0 *] [0]]
                 [[5 -1 *] [-5]]]]]]

  [/ [[spec [[number number] [number]]]
      [examples [[[12 3 /] [4]]
                 [[15 1.5 /] [10.0]]
                 [[0 1 /] [0]]
                 [[1 0 / handle [reason] lookup] [1 0 "division by zero"]]]]]]

  [quot [[spec [[number number] [number]]]
         [examples [[[16 5 quot] [3]]]]]]

  [rem [[spec [[number number] [number]]]
        [examples [[[17 5 rem] [2]]]]]]

  [mod [[spec [[number number] [number]]]
        [examples [[[17 5 mod] [2]]]]]]

  [exp [[spec [[number number] [number]]]
        [examples [[[2 5 exp] [32]]]]]]

  [log [[spec [[number number] [number]]]
        [examples [[[32 2 log] [5]]]]]]

  [floor [[spec [[number] [number]]]
          [examples [[[2.1 floor] [2]]]]]]

  [ceiling [[spec [[number] [number]]]
            [examples [[[2.1 ceiling] [3]]]]]]

  [round [[spec [[number] [number]]]
          [examples [[[2.1 round] [2]]]]]]

  [sqrt [[spec [[number] [number]]]
         [examples [[[9 sqrt] [3]]
                    [[81 sqrt] [9]]]]]]

  [inc [[spec [[number] [number]]]
        [examples [[[1 inc] [2]]
                   [[-1 inc] [0]]
                   [[99 inc] [100]]]]]]

  [dec [[spec [[number] [number]]]
        [examples [[[2 dec] [1]]
                   [[0 dec] [-1]]
                   [[100 dec] [99]]]]]]

  [abs [[spec [[number] [integer]]]
        [examples [[[2.1 abs] [2.1]]
                   [[-0.2 abs] [0.2]]
                   [[-2 abs] [2]]
                   [[0 abs] [0]]]]]]

  [odd? [[spec [[number] [boolean]]]
         [examples [[[1 odd?] [yes]]
                    [[-1 odd?] [yes]]
                    [[4 odd?] [[]]]]]]]

  [even? [[spec [[number] [boolean]]]
          [examples [[[2 even?] [yes]]
                     [[-2 even?] [yes]]
                     [[3 even?] [[]]]]]]]

  [zero? [[spec [[number] [boolean]]]
          [examples [[[0 zero?] [yes]]
                     [[0.0 zero?] [yes]]
                     [[-0.00001 zero?] [[]]]
                     [[1.1 zero?] [[]]]]]]]

  [number? [[spec [[item] [boolean]]]
            [examples [[[[1] number?] [[]]]
                       [[[] number?] [[]]]
                       [[5 number?] [yes]]
                       [[5.01 number?] [yes]]]]]]

  [number [[spec [[item] [number]]]
           [examples [[["12" number] [12]]
                      [["-11.1" number] [-11.1]]
                      [["a" first number] [97]]]]]]
#+end_src

#+begin_src kcats :tangle src/kcats/core/math.kcats :mkdirp yes
  [positive? [[spec [[number] [boolean]]]
              [definition [0 >]]]]

  [negative? [[spec [[number] [boolean]]]
              [definition [0 <]]]]

  [within? [[spec [[number number] [boolean]]]
            [definition [[- abs] dip <]]
            [examples [[[1.0 2.0 + 3 0.001 within?] [yes]]]]]]
#+end_src
