lexicon.html
<div id="outline-container-org4495514" class="outline-3">
<h3 id="org4495514"><span class="section-number-3">1.6.</span> Math</h3>
<div class="outline-text-3" id="text-1-6">
<div class='tangle-wrapper' data-tangle='src/kcats/core/math-builtins.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>+ <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>number<span class="org-kcats-brackets">]]]</span>
    <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 +<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3<span class="org-kcats-brackets">]]</span>
               <span class="org-kcats-brackets">[[</span>1.1 2.2 + 3.3 0.001 within?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
               <span class="org-kcats-brackets">[[</span>1 2.2 +<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3.2<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>- <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>number<span class="org-kcats-brackets">]]]</span>
    <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>2 1 -<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1<span class="org-kcats-brackets">]]</span>
               <span class="org-kcats-brackets">[[</span>1.1 2.2 - -1.1 0.00001 within?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
               <span class="org-kcats-brackets">[[</span>2.2 1 - 1.2 0.00001 within?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>* <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>number<span class="org-kcats-brackets">]]]</span>
    <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>4 3 *<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>12<span class="org-kcats-brackets">]]</span>
               <span class="org-kcats-brackets">[[</span>10 1.5 * 15 0.0001 within?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
               <span class="org-kcats-brackets">[[</span>5 0 *<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>0<span class="org-kcats-brackets">]]</span>
               <span class="org-kcats-brackets">[[</span>5 -1 *<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>-5<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>/ <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>number<span class="org-kcats-brackets">]]]</span>
    <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>12 3 /<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>4<span class="org-kcats-brackets">]]</span>
               <span class="org-kcats-brackets">[[</span>15 1.5 /<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>10.0<span class="org-kcats-brackets">]]</span>
               <span class="org-kcats-brackets">[[</span>0 1 /<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>0<span class="org-kcats-brackets">]]</span>
               <span class="org-kcats-brackets">[[</span>1 0 / handle <span class="org-kcats-brackets">[</span>reason<span class="org-kcats-brackets">]</span> lookup<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 0 <span class="org-string">"division by zero"</span><span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>quot <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>number<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>16 5 quot<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>rem <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>number<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>17 5 rem<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>mod <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>number<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>17 5 mod<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>exp <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>number<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>2 5 exp<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>32<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>log <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>number<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>32 2 log<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>5<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>floor <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>number<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>2.1 floor<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>ceiling <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>number<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>2.1 ceiling<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>round <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>number<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>2.1 round<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>sqrt <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>number<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>9 sqrt<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3<span class="org-kcats-brackets">]]</span>
                  <span class="org-kcats-brackets">[[</span>81 sqrt<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>9<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>inc <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>number<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 inc<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2<span class="org-kcats-brackets">]]</span>
                 <span class="org-kcats-brackets">[[</span>-1 inc<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>0<span class="org-kcats-brackets">]]</span>
                 <span class="org-kcats-brackets">[[</span>99 inc<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>100<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>dec <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>number<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>2 dec<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1<span class="org-kcats-brackets">]]</span>
                 <span class="org-kcats-brackets">[[</span>0 dec<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>-1<span class="org-kcats-brackets">]]</span>
                 <span class="org-kcats-brackets">[[</span>100 dec<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>99<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>abs <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>integer<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>2.1 abs<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2.1<span class="org-kcats-brackets">]]</span>
                 <span class="org-kcats-brackets">[[</span>-0.2 abs<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>0.2<span class="org-kcats-brackets">]]</span>
                 <span class="org-kcats-brackets">[[</span>-2 abs<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2<span class="org-kcats-brackets">]]</span>
                 <span class="org-kcats-brackets">[[</span>0 abs<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>0<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>odd? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 odd?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                  <span class="org-kcats-brackets">[[</span>-1 odd?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                  <span class="org-kcats-brackets">[[</span>4 odd?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]]]]]]</span>

<span class="org-kcats-brackets">[</span>even? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>2 even?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                   <span class="org-kcats-brackets">[[</span>-2 even?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                   <span class="org-kcats-brackets">[[</span>3 even?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]]]]]]</span>

<span class="org-kcats-brackets">[</span>zero? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>0 zero?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                   <span class="org-kcats-brackets">[[</span>0.0 zero?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                   <span class="org-kcats-brackets">[[</span>-0.00001 zero?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]]</span>
                   <span class="org-kcats-brackets">[[</span>1.1 zero?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]]]]]]</span>

<span class="org-kcats-brackets">[</span>number? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1<span class="org-kcats-brackets">]</span> number?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]]</span>
                     <span class="org-kcats-brackets">[[[]</span> number?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]]</span>
                     <span class="org-kcats-brackets">[[</span>5 number?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                     <span class="org-kcats-brackets">[[</span>5.01 number?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>number <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>number<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"12"</span> number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>12<span class="org-kcats-brackets">]]</span>
                    <span class="org-kcats-brackets">[[</span><span class="org-string">"-11.1"</span> number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>-11.1<span class="org-kcats-brackets">]]</span>
                    <span class="org-kcats-brackets">[[</span><span class="org-string">"a"</span> <span class="org-function-name">first</span> number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>97<span class="org-kcats-brackets">]]]]]]</span>
</pre>
</div></div>

<div class='tangle-wrapper' data-tangle='src/kcats/core/math.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>positive? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
            <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>0 &gt;<span class="org-kcats-brackets">]]]]</span>

<span class="org-kcats-brackets">[</span>negative? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
            <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>0 &lt;<span class="org-kcats-brackets">]]]]</span>

<span class="org-kcats-brackets">[</span>within? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>- abs<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> &lt;<span class="org-kcats-brackets">]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1.0 2.0 + 3 0.001 within?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]]]]]</span>
</pre>
</div></div>
</div>
</div>
