lexicon.org
** Serialization
#+begin_src kcats :tangle src/kcats/core/serialize-builtins.kcats :mkdirp yes
  [read [[spec [[string] [item]]]
         [examples [[["[1 [2] 3]" read] [[1 [2] 3]]]]]]]

  [emit [[spec [[item] [string]]]
         [examples [[[[1 [2] 3] emit] ["1 [2] 3"]]]]]]

  [autoformat [[spec [[string] [string]]]
               [examples [[["[[foo bar] [baz [[quux floop] [toop zoop]]]]" autoformat]
                           ["[[foo bar]\n [baz [[quux floop]\n       [toop zoop]]]]"]]]]]]
#+end_src
** Boolean logic
#+begin_src kcats :tangle src/kcats/core/boolean-builtins.kcats :mkdirp yes
  [yes [[spec [[] [word]]]]] ;; self-inserts

  [and [[spec [[item item] [item]]]
        [examples [[[1 odd? 2 even? and] [yes]]
                   [[2 3 and] [3]]
                   [[[] 3 and] [[]]]
                   [["" 3 and] [[]]]]]]]

  [or [[spec [[item item] [item]]]
       [examples [[[1 odd? 3 even? or] [yes]]
                  [[1 2 or] [1]]
                  [[[] 2 or] [2]]
                  [[[] [] or] [[]]]]]]]

  [not [[spec [[item] [boolean]]]
        [examples [[[1 even? not] [yes]]
                   [[[] not] [yes]]
                   [[yes not] [[]]]
                   [[[] not] [yes]]]]]]
#+end_src
