lexicon.html
<div id="outline-container-orga1ad13e" class="outline-3">
<h3 id="orga1ad13e"><span class="section-number-3">1.7.</span> Serialization</h3>
<div class="outline-text-3" id="text-1-7">
<div class='tangle-wrapper' data-tangle='src/kcats/core/serialize-builtins.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>read <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>string<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"[1 [2] 3]"</span> read<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1 <span class="org-kcats-brackets">[</span>2<span class="org-kcats-brackets">]</span> 3<span class="org-kcats-brackets">]]]]]]]</span>

<span class="org-kcats-brackets">[</span>emit <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>string<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>1 <span class="org-kcats-brackets">[</span>2<span class="org-kcats-brackets">]</span> 3<span class="org-kcats-brackets">]</span> emit<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"1 [2] 3"</span><span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>autoformat <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>string<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>string<span class="org-kcats-brackets">]]]</span>
             <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"[[foo bar] [baz [[quux floop] [toop zoop]]]]"</span> autoformat<span class="org-kcats-brackets">]</span>
                         <span class="org-kcats-brackets">[</span><span class="org-string">"[[foo bar]\n [baz [[quux floop]\n       [toop zoop]]]]"</span><span class="org-kcats-brackets">]]]]]]</span>
</pre>
</div></div>
</div>
</div>
<div id="outline-container-org908dee5" class="outline-3">
<h3 id="org908dee5"><span class="section-number-3">1.8.</span> Boolean logic</h3>
<div class="outline-text-3" id="text-1-8">
<div class='tangle-wrapper' data-tangle='src/kcats/core/boolean-builtins.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>yes <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>word<span class="org-kcats-brackets">]]]]]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">self-inserts</span>

<span class="org-kcats-brackets">[</span>and <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 odd? 2 even? and<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                 <span class="org-kcats-brackets">[[</span>2 3 and<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3<span class="org-kcats-brackets">]]</span>
                 <span class="org-kcats-brackets">[[[]</span> 3 and<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]]</span>
                 <span class="org-kcats-brackets">[[</span><span class="org-string">""</span> 3 and<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]]]]]]</span>

<span class="org-kcats-brackets">[</span>or <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
     <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 odd? 3 even? or<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                <span class="org-kcats-brackets">[[</span>1 2 or<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1<span class="org-kcats-brackets">]]</span>
                <span class="org-kcats-brackets">[[[]</span> 2 or<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2<span class="org-kcats-brackets">]]</span>
                <span class="org-kcats-brackets">[[[]</span> <span class="org-kcats-brackets">[]</span> or<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]]]]]]</span>

<span class="org-kcats-brackets">[</span>not <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 even? not<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                 <span class="org-kcats-brackets">[[[]</span> not<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                 <span class="org-kcats-brackets">[[</span>yes not<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]]</span>
                 <span class="org-kcats-brackets">[[[]</span> not<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]]]]]</span>
</pre>
</div></div>
</div>
</div>
