lexicon.org
** Byte encoding and decoding
#+begin_src kcats :tangle src/kcats/core/encode-builtins.kcats :mkdirp yes
  [encodestring [[spec [[string] [bytes]]]
                 [examples [
                  [["foo" encodestring] [#b64 "Zm9v"]]
                  [["" encodestring] [#b64 ""]]]]]]

  [encodenumber [[spec [[number] [bytes]]]
                 [examples [[[12 encodenumber] [#b64 "AAAAAAAAAAw"]]
                            [[12.3 encodenumber] [#b64 "QCiZmZmZmZo"]]]]]]

  [decodejson [[spec [[string] [item]]]
               [examples [[["12" decodejson] [12]]
                          [["12.01" decodejson] [12.01]]
                          [["\"foo\"" decodejson] ["foo"]]
                          [["{\"foo\": 12, \"bar\": \"baz\"}" decodejson] [[["foo" 12] ["bar" "baz"]] association]]
                          [["[1,\"foo\"]" decodejson] [[1 "foo"]]]]]]]

  [encodejson [[spec [[item] [string]]]
               [examples [[[12 encodejson] ["12"]]
                          [[12.01 encodejson] ["12.01"]]
                          [["foo" encodejson] ["\"foo\""]]
                          [[[["foo" 12] ["bar" "baz"]] association encodejson decodejson] [[["foo" 12] ["bar" "baz"]] association]]
                          [[[1 "foo"] encodejson] ["[1,\"foo\"]"]]]]]]

  [bytes? [[spec [[item] [boolean]]]
           [examples [[["foo" bytes?] [[]]]
                      [[#b64 "Zm9v" bytes?] [yes]]
                      [[[#b64 "Zm9v"] bytes?] [[]]]
                      [["foo" encode bytes?] [yes]]]]]]

  [xor [[spec [[item] [item]]]
        [examples [[[10 12 xor] [6]] ;; 10 = 01010, 12 = 01100, 00110, 6
                    [["foo" encode "bar" encode xor] [#b64 "BA4d"]]]]]]

  [bits [[spec [[item] [sized]]]
         [definition [encode [[2 radix 8 0 pad] each joiner] assemble unwrap]]
         [examples [[["foo" bits] [[0 1 1 0 0 1 1 0 0 1 1 0 1 1 1 1 0 1 1 0 1 1 1 1]]]]]]]
#+end_src

#+begin_src kcats :tangle src/kcats/stdlib/encode.kcats :mkdirp yes
  [[encode [[spec [[item] [bytes]]]
            [definition [[[[bytes?] []]
                          [[string?] [encodestring]]
                          [[number?] [encodenumber]]
                          [[true] [emit encode]]]
                         decide]]
            [examples [[[12 encode] [#b64 "AAAAAAAAAAw"]]
                       [["foo" encode] [#b64 "Zm9v"]]
                       [["foo" encode encode] [#b64 "Zm9v"]]
                       [["" encode] [#b64 ""]]]]]]

   [radix [[spec [[integer integer] [list]]]
           [definition [[[/] shield swap
                         [*] shielddown
                         swapdown -
                         swap [prepend] dip]
                        swap prepend
                        [[] swap [positive?]] dip
                        while drop]]
           [examples [[[7 2 radix] [[1 1 1]]]
                      [[9 3 radix] [[1 0 0]]]
                      [[255 16 radix] [[15 15]]]]]]]]
  join
#+end_src
