lexicon.html
<div id="outline-container-org36fa4fe" class="outline-3">
<h3 id="org36fa4fe"><span class="section-number-3">1.9.</span> Byte encoding and decoding</h3>
<div class="outline-text-3" id="text-1-9">
<div class='tangle-wrapper' data-tangle='src/kcats/core/encode-builtins.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>encodestring <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>string<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>bytes<span class="org-kcats-brackets">]]]</span>
               <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[</span>
                <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> encodestring<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>#b64 <span class="org-string">"Zm9v"</span><span class="org-kcats-brackets">]]</span>
                <span class="org-kcats-brackets">[[</span><span class="org-string">""</span> encodestring<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>#b64 <span class="org-string">""</span><span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>encodenumber <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>number<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>bytes<span class="org-kcats-brackets">]]]</span>
               <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>12 encodenumber<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>#b64 <span class="org-string">"AAAAAAAAAAw"</span><span class="org-kcats-brackets">]]</span>
                          <span class="org-kcats-brackets">[[</span>12.3 encodenumber<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>#b64 <span class="org-string">"QCiZmZmZmZo"</span><span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>decodejson <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>string<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
             <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"12"</span> decodejson<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>12<span class="org-kcats-brackets">]]</span>
                        <span class="org-kcats-brackets">[[</span><span class="org-string">"12.01"</span> decodejson<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>12.01<span class="org-kcats-brackets">]]</span>
                        <span class="org-kcats-brackets">[[</span><span class="org-string">"\"foo\""</span> decodejson<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"foo"</span><span class="org-kcats-brackets">]]</span>
                        <span class="org-kcats-brackets">[[</span><span class="org-string">"{\"foo\": 12, \"bar\": \"baz\"}"</span> decodejson<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[[</span><span class="org-string">"foo"</span> 12<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"bar"</span> <span class="org-string">"baz"</span><span class="org-kcats-brackets">]]</span> association<span class="org-kcats-brackets">]]</span>
                        <span class="org-kcats-brackets">[[</span><span class="org-string">"[1,\"foo\"]"</span> decodejson<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1 <span class="org-string">"foo"</span><span class="org-kcats-brackets">]]]]]]]</span>

<span class="org-kcats-brackets">[</span>encodejson <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>string<span class="org-kcats-brackets">]]]</span>
             <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>12 encodejson<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"12"</span><span class="org-kcats-brackets">]]</span>
                        <span class="org-kcats-brackets">[[</span>12.01 encodejson<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"12.01"</span><span class="org-kcats-brackets">]]</span>
                        <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> encodejson<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"\"foo\""</span><span class="org-kcats-brackets">]]</span>
                        <span class="org-kcats-brackets">[[[[</span><span class="org-string">"foo"</span> 12<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"bar"</span> <span class="org-string">"baz"</span><span class="org-kcats-brackets">]]</span> association encodejson decodejson<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[[</span><span class="org-string">"foo"</span> 12<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"bar"</span> <span class="org-string">"baz"</span><span class="org-kcats-brackets">]]</span> association<span class="org-kcats-brackets">]]</span>
                        <span class="org-kcats-brackets">[[[</span>1 <span class="org-string">"foo"</span><span class="org-kcats-brackets">]</span> encodejson<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"[1,\"foo\"]"</span><span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>bytes? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"foo"</span> bytes?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]]</span>
                    <span class="org-kcats-brackets">[[</span>#b64 <span class="org-string">"Zm9v"</span> bytes?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                    <span class="org-kcats-brackets">[[[</span>#b64 <span class="org-string">"Zm9v"</span><span class="org-kcats-brackets">]</span> bytes?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]]</span>
                    <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> encode bytes?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>xor <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>10 12 xor<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>6<span class="org-kcats-brackets">]]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">10 = 01010, 12 = 01100, 00110, 6</span>
                  <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> encode <span class="org-string">"bar"</span> encode xor<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>#b64 <span class="org-string">"BA4d"</span><span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>bits <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>sized<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>encode <span class="org-kcats-brackets">[[</span>2 radix 8 0 pad<span class="org-kcats-brackets">]</span> each joiner<span class="org-kcats-brackets">]</span> assemble <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"foo"</span> bits<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>0 1 1 0 0 1 1 0 0 1 1 0 1 1 1 1 0 1 1 0 1 1 1 1<span class="org-kcats-brackets">]]]]]]]</span>
</pre>
</div></div>

<div class='tangle-wrapper' data-tangle='src/kcats/stdlib/encode.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span>encode <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>bytes<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[[</span>bytes?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]]</span>
                        <span class="org-kcats-brackets">[[</span>string?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>encodestring<span class="org-kcats-brackets">]]</span>
                        <span class="org-kcats-brackets">[[</span>number?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>encodenumber<span class="org-kcats-brackets">]]</span>
                        <span class="org-kcats-brackets">[[</span><span class="org-keyword">true</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>emit encode<span class="org-kcats-brackets">]]]</span>
                       decide<span class="org-kcats-brackets">]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>12 encode<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>#b64 <span class="org-string">"AAAAAAAAAAw"</span><span class="org-kcats-brackets">]]</span>
                     <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> encode<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>#b64 <span class="org-string">"Zm9v"</span><span class="org-kcats-brackets">]]</span>
                     <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> encode encode<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>#b64 <span class="org-string">"Zm9v"</span><span class="org-kcats-brackets">]]</span>
                     <span class="org-kcats-brackets">[[</span><span class="org-string">""</span> encode<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>#b64 <span class="org-string">""</span><span class="org-kcats-brackets">]]]]]]</span>

 <span class="org-kcats-brackets">[</span>radix <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>integer integer<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[</span>/<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> <span class="org-builtin">swap</span>
                       <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shielddown</span>
                       <span class="org-builtin">swapdown</span> -
                       <span class="org-builtin">swap</span> <span class="org-kcats-brackets">[</span>prepend<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]</span>
                      <span class="org-builtin">swap</span> prepend
                      <span class="org-kcats-brackets">[[]</span> <span class="org-builtin">swap</span> <span class="org-kcats-brackets">[</span>positive?<span class="org-kcats-brackets">]]</span> <span class="org-preprocessor">dip</span>
                      <span class="org-preprocessor">while</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>7 2 radix<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1 1 1<span class="org-kcats-brackets">]]]</span>
                    <span class="org-kcats-brackets">[[</span>9 3 radix<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1 0 0<span class="org-kcats-brackets">]]]</span>
                    <span class="org-kcats-brackets">[[</span>255 16 radix<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>15 15<span class="org-kcats-brackets">]]]]]]]]</span>
<span class="org-function-name">join</span>
</pre>
</div></div>
</div>
</div>
