lexicon.org
** Strings
#+begin_src kcats :tangle src/kcats/core/strings-builtins.kcats :mkdirp yes
  [string [[spec [[item] [string]]]
           [examples [[[1 string] ["1"]]
                      [[[1 2 3] string] ["[1 2 3]"]]
                      [[[] string] [""]]]]]]

  [format [[spec [[list string] [string]]]
           [examples [[["foo {} bar {} baz" ["abc" "def"] format] ["foo abc bar def baz"]]]]]]

  [string? [[spec [[item] [boolean]]]
            [examples [[["hi" string?] [yes]]
                       [["" string?] [yes]]
                       [[["hi"] string?] [[]]]
                       [[yes string?] [[]]]]]]]

  ;; Don't really belong here but good enough for now
  [word? [[spec [[item] [boolean]]]
          [examples [[[[foo] unwrap word?] [yes]]
                     [[yes word?] [yes]]
                     [[1 word?] [[]]]
                     [["yes" word?] [[]]]]]]]

  [word [[spec [[item] [word]]]
         [examples [[["foo" word] [[foo] unwrap]]]]]]

  [inspect [[spec [[item] [string]]]]]
#+end_src
