lexicon.html
<div id="outline-container-org03a2d32" class="outline-3">
<h3 id="org03a2d32"><span class="section-number-3">1.10.</span> Strings</h3>
<div class="outline-text-3" id="text-1-10">
<div class='tangle-wrapper' data-tangle='src/kcats/core/strings-builtins.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>string <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>string<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 string<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"1"</span><span class="org-kcats-brackets">]]</span>
                    <span class="org-kcats-brackets">[[[</span>1 2 3<span class="org-kcats-brackets">]</span> string<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"[1 2 3]"</span><span class="org-kcats-brackets">]]</span>
                    <span class="org-kcats-brackets">[[[]</span> string<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">""</span><span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>format <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>list string<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>string<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"foo {} bar {} baz"</span> <span class="org-kcats-brackets">[</span><span class="org-string">"abc"</span> <span class="org-string">"def"</span><span class="org-kcats-brackets">]</span> format<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"foo abc bar def baz"</span><span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>string? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"hi"</span> string?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                     <span class="org-kcats-brackets">[[</span><span class="org-string">""</span> string?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                     <span class="org-kcats-brackets">[[[</span><span class="org-string">"hi"</span><span class="org-kcats-brackets">]</span> string?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]]</span>
                     <span class="org-kcats-brackets">[[</span>yes string?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]]]]]]</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">Don't really belong here but good enough for now</span>
<span class="org-kcats-brackets">[</span>word? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>foo<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> word?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                   <span class="org-kcats-brackets">[[</span>yes word?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                   <span class="org-kcats-brackets">[[</span>1 word?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]]</span>
                   <span class="org-kcats-brackets">[[</span><span class="org-string">"yes"</span> word?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]]]]]]</span>

<span class="org-kcats-brackets">[</span>word <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>word<span class="org-kcats-brackets">]]]</span>
       <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"foo"</span> word<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>foo<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span><span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>inspect <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>string<span class="org-kcats-brackets">]]]]]</span>
</pre>
</div></div>
</div>
</div>
