lexicon.org
** Error handling
#+begin_src kcats :tangle src/kcats/core/errors-builtins.kcats :mkdirp yes
  [error? [[spec [[item] [boolean]]]]]

  ;; handle is a special word only used to unwind the program on
  ;; error, if there's no error and we end up reaching this word, we
  ;; ignore it.
  [handle [[spec [[] []]]
           [definition []]]]

  [fail [[spec [[sized] [*]]]]]
#+end_src

#+begin_src kcats :tangle src/kcats/stdlib/errors.kcats :mkdirp yes
  [[assert [[spec [[program]
                   [*]]]
            [definition [snapshot ;; save stack to print in err message
                         [shield] dive ;; run the assertion under the saved stack
                         [drop] ;; if passes, drop the saved stack, dont need
                         [string ["assertion failed "] dip join fail] ;; else throw err
                         branch]]]]

   [recover [[spec [[program program] [*]]]
             [definition [[[handle] join] dip ;; add handle to the end of test
                          [snapshot] dipdown ;; rec test ss
                          sink inject ;; res rec
                          [first error?] ;; err? res rec
                          [first swap execute];; drop the snapshot and run recovery
                          [evert drop] ;; use snapshot as stack
                          if]]
             [examples [[[[+]
                          [drop 1
                           [+] [drop 2 +]
                           recover]
                          recover]
                         [3]]

                        [[[1 2 "oh fudge"]
                          [[5 +]
                           [drop 5]
                           recover]
                          map]
                         [[6 7 5]]]

                        [[[swap] [drop swap] recover]
                         [swap]]]]]]

   [retry [[spec [[error] [*]]]
           [definition [[unwound] lookup
                        execute]]
           [examples [[[2 3 "four" * + handle [drop 4] dip retry] [14]]]]]]]
  join
#+end_src
