lexicon.html
<div id="outline-container-org289a3ef" class="outline-3">
<h3 id="org289a3ef"><span class="section-number-3">1.11.</span> Error handling</h3>
<div class="outline-text-3" id="text-1-11">
<div class='tangle-wrapper' data-tangle='src/kcats/core/errors-builtins.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>error? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]]]</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">handle is a special word only used to unwind the program on</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">error, if there's no error and we end up reaching this word, we</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">ignore it.</span>
<span class="org-kcats-brackets">[</span>handle <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[]]]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[]]]]</span>

<span class="org-kcats-brackets">[</span>fail <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>sized<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]]]</span>
</pre>
</div></div>

<div class='tangle-wrapper' data-tangle='src/kcats/stdlib/errors.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span>assert <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-builtin">snapshot</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">save stack to print in err message</span>
                       <span class="org-kcats-brackets">[</span><span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">run the assertion under the saved stack</span>
                       <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">if passes, drop the saved stack, dont need</span>
                       <span class="org-kcats-brackets">[</span>string <span class="org-kcats-brackets">[</span><span class="org-string">"assertion failed "</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-function-name">join</span> fail<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">else throw err</span>
                       <span class="org-preprocessor">branch</span><span class="org-kcats-brackets">]]]]</span>

 <span class="org-kcats-brackets">[</span>recover <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program program<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[</span>handle<span class="org-kcats-brackets">]</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">add handle to the end of test</span>
                        <span class="org-kcats-brackets">[</span><span class="org-builtin">snapshot</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dipdown</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">rec test ss</span>
                        <span class="org-builtin">sink</span> <span class="org-preprocessor">inject</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">res rec</span>
                        <span class="org-kcats-brackets">[</span><span class="org-function-name">first</span> error?<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">err? res rec</span>
                        <span class="org-kcats-brackets">[</span><span class="org-function-name">first</span> <span class="org-builtin">swap</span> <span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span><span class="org-comment-delimiter">;; </span><span class="org-comment">drop the snapshot and run recovery</span>
                        <span class="org-kcats-brackets">[</span><span class="org-builtin">evert</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">use snapshot as stack</span>
                        <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]]</span>
           <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span>+<span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> 1
                         <span class="org-kcats-brackets">[</span>+<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> 2 +<span class="org-kcats-brackets">]</span>
                         recover<span class="org-kcats-brackets">]</span>
                        recover<span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[</span>3<span class="org-kcats-brackets">]]</span>

                      <span class="org-kcats-brackets">[[[</span>1 2 <span class="org-string">"oh fudge"</span><span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[[</span>5 +<span class="org-kcats-brackets">]</span>
                         <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> 5<span class="org-kcats-brackets">]</span>
                         recover<span class="org-kcats-brackets">]</span>
                        <span class="org-function-name">map</span><span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[[</span>6 7 5<span class="org-kcats-brackets">]]]</span>

                      <span class="org-kcats-brackets">[[[</span><span class="org-builtin">swap</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-builtin">swap</span><span class="org-kcats-brackets">]</span> recover<span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span><span class="org-kcats-brackets">]]]]]]</span>

 <span class="org-kcats-brackets">[</span>retry <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>error<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>unwound<span class="org-kcats-brackets">]</span> lookup
                      <span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>2 3 <span class="org-string">"four"</span> * + handle <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> 4<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> retry<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>14<span class="org-kcats-brackets">]]]]]]]</span>
<span class="org-function-name">join</span>
</pre>
</div></div>
</div>
</div>
