lexicon.org
** Methods
We want a way of adding methods to a word that's already set up as a
simple 'decide' form. This will add the method at the beginning -
adding it at the end is not good because often there's a catchall
condition at the end, and adding beyond that means the new condition
is unreachable. Adding at the beginning is not always what the user
wants either, though. So maybe this could be improved by taking
another argument: a program to combine the item and the existing list
(that defaults to =prepend= here).
#+begin_src kcats :tangle src/kcats/stdlib/methods.kcats :mkdirp yes
  [[addmethod [[spec [[[program method] [program condition] [program definition]]
                      [[program newdefinition]]]]
               [definition [[[*2 *1] prepend] pack
                            [0] swap update]]
               [examples [[[[[[[count 3 >] ["foo" put]]
                              [[not] ["bar" put]]] decide]
                            [count 1 =] [rest] addmethod]

                           [[[[[count 1 =] [rest]]
                              [[count 3 >] ["foo" put]]
                              [[not] ["bar" put]]]
                             decide]]]]]]]

   [method? [[spec [[program] [boolean]]]
             [definition [[[first [[pair?]
                                   [[list?] every?]] every?]
                           [second [decide] unwrap =]]
                          every?]]]]]
  join
#+end_src
** Database
#+begin_src kcats :tangle src/kcats/stdlib/database.kcats :mkdirp yes
  [[[list selection] [list constraints]]
   [string]]

  [[fork [[execute] map]]
   [triangle [[[] [[take] dip swap [[put] shield sink swap pair] bail] collect] shielddown]]
   [indexed-as-property [swap indexed
                         [unwrap sink assign] map dropdown]]
   [join-all [[first empty] shield swap [join] step]]
   [selectkeys [set [*1 first contains?] pack filter dropdown]]
   [invert [[reverse] map association]]

   ;; datalog variables
   [variable? [[[word?]
                [string last \? =]] [execute] every?]]
   [variable= [[[pair [variable?] every?] [=]] [execute] every?]] 

   ;; datalog constraints
   [slots [[entity attribute value]]]
   [slot-combos [slots [slots [pair] map] map join-all]]
   [constraint [unwrap slots reverse label]] 

   ;; links between datalog constraints
   [links [slot-combos
           [[wrap] map unwrap swapdown 
            [[[lookup] inject] both] pairwise 
            variable=]
           filter    
           [unwrap pair sink pair
            [[index] lookup] map swap zip]
           map]]
   [all-links [[] sink
               [[[[index] lookup] shield] both ;; lookup the indices of both constraints
                [swapdown] dip sink ;; move the indices under the constraints
                [links] shielddown
                swap [dropdown dropdown join] dip] 

               step drop]]
   [format-link [[join] inject unwrap [string] map
                 "c{0}.{1} = c{2}.{3}" swap format]] 

   ;; formatting pieces of query data into text
   [anded-together [" AND " interpose join-all]]

   ;; where clause data processing
   [where-data [[[index] lookup] shield swap 
                [[[second variable? not]
                  [first [index] unwrap = not]] [execute] every?] filter 
                [swap prepend] map dropdown]]
   [format-where [[string] map 
                  "c{0}.{1} = :c{0}{1}" swap format]]
   [make-where [first [where] lookup anded-together]]
   [format-join [[[[on] lookup]
                  [[where] lookup]
                  [[index] lookup string]] [execute] map
                 [join anded-together] inject 
                 "JOIN EAV c{1} ON {0}" swap format]]
   [make-query [rest [[on]
                      [[format-link] map] update
                      [format-join] shield [join] swap assign] map]]

   ;; SQL parameters for rusqlite
   [param-name [[string] map ":c{0}{1}" swap format]]
   [extract-params [[] association swap [[params] lookup join] step]]


   ;; SELECT clause
   [wordval? [second word?]]
   [invert [[reverse] map association]]
   [validate [[[second not]
               [first "All selected query variables must appear somewhere in constraints"
                [reason variable] label fail]
               when] map]]
   [select-data [swap
                 [[slots selectkeys invert] shield
                  [wordval?] filter join association] map
                 swap
                 [[[index] swap put ;; make a list of the variable and 'index'
                   wrap [selectkeys] join ;; make the program to cut down
                    map [count 2 =] filter first [second] map
                   [first number?] [reverse] when] ;; items are in random order due to coming from association, fix the order
                  map]
                 shield dropdeep zip
                 validate]]

   ;; query 
   [extract-data [[[[unwrap all-links]
                    [first where-data   ; [join] inject unwrap
                     ;; build the query param map
                     [[[] swap
                       [[param-name] shield [last] dip wrap swap assign]
                       step]
                      ;; build the actual query where clauses
                      [[format-where] map]]
                     fork]]
                   fork] shield
                  ;; combine extracted items

                  [first] dip ;; keep the original constraint to add properties to
                  unwrap unwrap [where params on] label join]]
   [format-select [[unwrap swap
                    string butlast ;; remove the ? from the variable name for result column
                    put
                    [string] map
                    "c{1}.{0} as {2}" swap format] map ", " interpose join-all]]]

  ;; This is the program we need to modify that is `query`

  [swap
   ;; expand all combinations of constraints
   [constraint] map
   ;;[] prepend ;; an empty constraint to represent the orignal EAV table we're joining with
   [index] indexed-as-property
   triangle
   ;; for each pair of constraints, build the "ON" clause data for the JOIN
   [extract-data] map
   [[extract-params]
    [make-query]
    [make-where]
    [swap select-data]] fork 
   dropdown ;; don't need original anymore
   unwrap float
   [[join] lookup] map  
   swap format-select 
   [" " interpose join-all] dip triplet reverse
   "SELECT {0} from EAV as c0 {1} WHERE {2}" swap format
   swap dropdeep]

  let
  [definition spec] label
  [query] swap assign
#+end_src
