lexicon.html
<div id="outline-container-orgf95f04f" class="outline-3">
<h3 id="orgf95f04f"><span class="section-number-3">1.12.</span> Methods</h3>
<div class="outline-text-3" id="text-1-12">
<p>
We want a way of adding methods to a word that's already set up as a
simple 'decide' form. This will add the method at the beginning -
adding it at the end is not good because often there's a catchall
condition at the end, and adding beyond that means the new condition
is unreachable. Adding at the beginning is not always what the user
wants either, though. So maybe this could be improved by taking
another argument: a program to combine the item and the existing list
(that defaults to <code>prepend</code> here).
</p>
<div class='tangle-wrapper' data-tangle='src/kcats/stdlib/methods.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span>addmethod <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program method<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>program condition<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>program definition<span class="org-kcats-brackets">]]</span>
                    <span class="org-kcats-brackets">[[</span>program newdefinition<span class="org-kcats-brackets">]]]]</span>
             <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[</span>*2 *1<span class="org-kcats-brackets">]</span> prepend<span class="org-kcats-brackets">]</span> pack
                          <span class="org-kcats-brackets">[</span>0<span class="org-kcats-brackets">]</span> <span class="org-builtin">swap</span> update<span class="org-kcats-brackets">]]</span>
             <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[[[</span><span class="org-function-name">count</span> 3 &gt;<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"foo"</span> <span class="org-function-name">put</span><span class="org-kcats-brackets">]]</span>
                            <span class="org-kcats-brackets">[[</span>not<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"bar"</span> <span class="org-function-name">put</span><span class="org-kcats-brackets">]]]</span> decide<span class="org-kcats-brackets">]</span>
                          <span class="org-kcats-brackets">[</span><span class="org-function-name">count</span> 1 =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">rest</span><span class="org-kcats-brackets">]</span> addmethod<span class="org-kcats-brackets">]</span>

                         <span class="org-kcats-brackets">[[[[[</span><span class="org-function-name">count</span> 1 =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">rest</span><span class="org-kcats-brackets">]]</span>
                            <span class="org-kcats-brackets">[[</span><span class="org-function-name">count</span> 3 &gt;<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"foo"</span> <span class="org-function-name">put</span><span class="org-kcats-brackets">]]</span>
                            <span class="org-kcats-brackets">[[</span>not<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-string">"bar"</span> <span class="org-function-name">put</span><span class="org-kcats-brackets">]]]</span>
                           decide<span class="org-kcats-brackets">]]]]]]]</span>

 <span class="org-kcats-brackets">[</span>method? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[</span><span class="org-function-name">first</span> <span class="org-kcats-brackets">[[</span>pair?<span class="org-kcats-brackets">]</span>
                                 <span class="org-kcats-brackets">[[</span>list?<span class="org-kcats-brackets">]</span> every?<span class="org-kcats-brackets">]]</span> every?<span class="org-kcats-brackets">]</span>
                         <span class="org-kcats-brackets">[</span><span class="org-function-name">second</span> <span class="org-kcats-brackets">[</span>decide<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> =<span class="org-kcats-brackets">]]</span>
                        every?<span class="org-kcats-brackets">]]]]]</span>
<span class="org-function-name">join</span>
</pre>
</div></div>
</div>
</div>
