lexicon.org
** Pipes
#+begin_src kcats :tangle src/kcats/core/pipes-builtins.kcats :mkdirp yes
  [pipe? [[spec [[item] [boolean]]]
          [examples [[[timestamps pipe?] [yes]]
                     [[standard pipe?] [yes]]
                     [[[1 2 3] pipe?] [[]]]
                     [[5 pipe?] [[]]]]]]]

  [animate [[spec [[environment] []]]]]

  [attend [[spec [[list] [list]]]]]

  [file-in [[spec [[string] [pipe]]]]]

  [file-out [[spec [[string] [pipe]]]]]

  [handoff [[spec [[] [pipe]]]]]

  [receiver [[spec [[pipe] [pipe]]]]]

  [select [[spec [[[list pipes]] [item pipe [list pipes]]]]]]

  [sender [[spec [[pipe] [pipe]]]]]

  [serversocket [[spec [[integer string] [pipe]]]]]

  [socket [[spec [[integer string] [pipe]]]]]

  [standard [[spec [[] [pipe]]]]]

  [timer [[spec [[integer] [pipe]]]]]

  [timestamps [[spec [[] [pipe]]]]]

  [database [[spec [[[sized params] string] []]]]]

  [persist [[spec [[sized] []]]]]
#+end_src

#+begin_src kcats :tangle src/kcats/stdlib/pipes.kcats :mkdirp yes
  [[pipe-in [[spec [[item] [pipe]]]
             [definition [association
                          [[[type [file] unwrap =]
                            [value file-in]]
                           [[type [stdout] unwrap =]
                            [stdout]]]
                          decide]]]]

   [tunnel [[spec [[item] [pipe]]]
            [definition [association
                         [[[type [ip-host] unwrap =]
                           [clone
                            [port] lookup
                            [[address] lookup] dip
                            serversocket]]
                          [[type [ip-client] unwrap =]
                           [clone
                            [port] lookup
                            [[address] lookup] dip
                            socket]]]
                         decide]]]]

   [pipe-out [[spec [[item] [pipe]]]
              [definition [association
                           [[[type [file] unwrap =]
                             [value file-out]]
                            [[type [ip-host] unwrap =]
                             [clone
                              [port] lookup
                              [[address] lookup] dip
                              serversocket]]]
                           decide]]]]

   [spit [[spec [[item [item target]] []]]
          [definition [[pipe-in] dip encode put drop]]]]

   [slurp [[spec [[pipe] [item]]]
           [definition [[take] [join] fold string [drop drop] dip]]]]

   [print [[spec [[string] []]]
           [definition [[standard] dip "\n" join encode put drop]]]]

   ;;[slurp [[spec [[[item target]] [item pipe]]]]]

   [sleep [[spec [[integer] []]]
           [definition [timer take drop drop]]]]

   [future [[spec [[program] [pipe]]]
            [definition [handoff swap
                         [[**1 snapshot] ;; return entire stack
                          dive put drop] pack
                         dictionary swap spawn animate]]
            [examples [[[1 [2 +] future take dropdown] [1 [3]]]]]]]

   [generator [[spec [[[program generator-maker]] [[program wrapped-generator]]]]
               [definition [[] swap inject
                            [[generate] inject take]]]]]  ;; generate from the wrapped generator

   [siphon [[spec [[[receptacle output] [program generator]] [[receptacle output]]]]
            [description "Generates values from a wrapped generator (stacked generator inside a list), until exhausted, puts all items into the output receptacle"]
            [definition [[] ;; placeholder that gets dropped (next
                         ;; iteration it will hold a copy of the last
                         ;; element which is only needed to check if
                         ;; the loop continues and can be dropped
                         ;; after)
                         [empty?] ;; stop when generator returns
                         ;; nothing
                         [drop ;; the last value
                          [generate clone] dip
                          sink
                          [[put] bail] dip]
                         until
                         drop drop sink drop drop]] ;; the now-empty dispenser
            [examples [[[[[integers 5 taker] generator [] siphon] shield] [[0 1 2 3 4]]]]]]]

   [close [[spec [[pipe] []]]
           [definition [drop]]]]]
  join
#+end_src

