lexicon.html
<div id="outline-container-org5c11fb0" class="outline-3">
<h3 id="org5c11fb0"><span class="section-number-3">1.13.</span> Pipes</h3>
<div class="outline-text-3" id="text-1-13">
<div class='tangle-wrapper' data-tangle='src/kcats/core/pipes-builtins.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>pipe? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>timestamps pipe?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                   <span class="org-kcats-brackets">[[</span>standard pipe?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                   <span class="org-kcats-brackets">[[[</span>1 2 3<span class="org-kcats-brackets">]</span> pipe?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]]</span>
                   <span class="org-kcats-brackets">[[</span>5 pipe?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]]]]]]</span>

<span class="org-kcats-brackets">[</span>animate <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>environment<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]]]]]</span>

<span class="org-kcats-brackets">[</span>attend <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>list<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>list<span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>file-in <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>string<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>pipe<span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>file-out <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>string<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>pipe<span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>handoff <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>pipe<span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>receiver <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>pipe<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>pipe<span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>select <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>list pipes<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>item pipe <span class="org-kcats-brackets">[</span>list pipes<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>sender <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>pipe<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>pipe<span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>serversocket <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>integer string<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>pipe<span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>socket <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>integer string<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>pipe<span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>standard <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>pipe<span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>timer <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>integer<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>pipe<span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>timestamps <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>pipe<span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>database <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>sized params<span class="org-kcats-brackets">]</span> string<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]]]]]</span>

<span class="org-kcats-brackets">[</span>persist <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>sized<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]]]]]</span>
</pre>
</div></div>

<div class='tangle-wrapper' data-tangle='src/kcats/stdlib/pipes.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span>pipe-in <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>pipe<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>association
                        <span class="org-kcats-brackets">[[[</span>type <span class="org-kcats-brackets">[</span>file<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> =<span class="org-kcats-brackets">]</span>
                          <span class="org-kcats-brackets">[</span>value file-in<span class="org-kcats-brackets">]]</span>
                         <span class="org-kcats-brackets">[[</span>type <span class="org-kcats-brackets">[</span>stdout<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> =<span class="org-kcats-brackets">]</span>
                          <span class="org-kcats-brackets">[</span>stdout<span class="org-kcats-brackets">]]]</span>
                        decide<span class="org-kcats-brackets">]]]]</span>

 <span class="org-kcats-brackets">[</span>tunnel <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>pipe<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>association
                       <span class="org-kcats-brackets">[[[</span>type <span class="org-kcats-brackets">[</span>ip-host<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> =<span class="org-kcats-brackets">]</span>
                         <span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span>
                          <span class="org-kcats-brackets">[</span>port<span class="org-kcats-brackets">]</span> lookup
                          <span class="org-kcats-brackets">[[</span>address<span class="org-kcats-brackets">]</span> lookup<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span>
                          serversocket<span class="org-kcats-brackets">]]</span>
                        <span class="org-kcats-brackets">[[</span>type <span class="org-kcats-brackets">[</span>ip-client<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> =<span class="org-kcats-brackets">]</span>
                         <span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span>
                          <span class="org-kcats-brackets">[</span>port<span class="org-kcats-brackets">]</span> lookup
                          <span class="org-kcats-brackets">[[</span>address<span class="org-kcats-brackets">]</span> lookup<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span>
                          socket<span class="org-kcats-brackets">]]]</span>
                       decide<span class="org-kcats-brackets">]]]]</span>

 <span class="org-kcats-brackets">[</span>pipe-out <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>pipe<span class="org-kcats-brackets">]]]</span>
            <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>association
                         <span class="org-kcats-brackets">[[[</span>type <span class="org-kcats-brackets">[</span>file<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> =<span class="org-kcats-brackets">]</span>
                           <span class="org-kcats-brackets">[</span>value file-out<span class="org-kcats-brackets">]]</span>
                          <span class="org-kcats-brackets">[[</span>type <span class="org-kcats-brackets">[</span>ip-host<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> =<span class="org-kcats-brackets">]</span>
                           <span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span>
                            <span class="org-kcats-brackets">[</span>port<span class="org-kcats-brackets">]</span> lookup
                            <span class="org-kcats-brackets">[[</span>address<span class="org-kcats-brackets">]</span> lookup<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span>
                            serversocket<span class="org-kcats-brackets">]]]</span>
                         decide<span class="org-kcats-brackets">]]]]</span>

 <span class="org-kcats-brackets">[</span>spit <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item <span class="org-kcats-brackets">[</span>item target<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>pipe-in<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> encode <span class="org-function-name">put</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]]]</span>

 <span class="org-kcats-brackets">[</span>slurp <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>pipe<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> fold string <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]]]]</span>

 <span class="org-kcats-brackets">[</span>print <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>string<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]]]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>standard<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-string">"\n"</span> <span class="org-function-name">join</span> encode <span class="org-function-name">put</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]]]</span>

 <span class="org-comment-delimiter">;;</span><span class="org-comment">[slurp [[spec [[[item target]] [item pipe]]]]]</span>

 <span class="org-kcats-brackets">[</span>sleep <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>integer<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]]]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>timer <span class="org-function-name">take</span> <span class="org-builtin">drop</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]]]</span>

 <span class="org-kcats-brackets">[</span>future <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>pipe<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>handoff <span class="org-builtin">swap</span>
                       <span class="org-kcats-brackets">[[</span>**1 <span class="org-builtin">snapshot</span><span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">return entire stack</span>
                        <span class="org-preprocessor">dive</span> <span class="org-function-name">put</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span> pack
                       dictionary <span class="org-builtin">swap</span> spawn animate<span class="org-kcats-brackets">]]</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 <span class="org-kcats-brackets">[</span>2 +<span class="org-kcats-brackets">]</span> future <span class="org-function-name">take</span> <span class="org-builtin">dropdown</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>1 <span class="org-kcats-brackets">[</span>3<span class="org-kcats-brackets">]]]]]]]</span>

 <span class="org-kcats-brackets">[</span>generator <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program generator-maker<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[[</span>program wrapped-generator<span class="org-kcats-brackets">]]]]</span>
             <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[]</span> <span class="org-builtin">swap</span> <span class="org-preprocessor">inject</span>
                          <span class="org-kcats-brackets">[[</span>generate<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">inject</span> <span class="org-function-name">take</span><span class="org-kcats-brackets">]]]]]</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">generate from the wrapped generator</span>

 <span class="org-kcats-brackets">[</span>siphon <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>receptacle output<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>program generator<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[[</span>receptacle output<span class="org-kcats-brackets">]]]]</span>
          <span class="org-kcats-brackets">[</span>description <span class="org-string">"Generates values from a wrapped generator (stacked generator inside a list), until exhausted, puts all items into the output receptacle"</span><span class="org-kcats-brackets">]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">placeholder that gets dropped (next</span>
                       <span class="org-comment-delimiter">;; </span><span class="org-comment">iteration it will hold a copy of the last</span>
                       <span class="org-comment-delimiter">;; </span><span class="org-comment">element which is only needed to check if</span>
                       <span class="org-comment-delimiter">;; </span><span class="org-comment">the loop continues and can be dropped</span>
                       <span class="org-comment-delimiter">;; </span><span class="org-comment">after)</span>
                       <span class="org-kcats-brackets">[</span>empty?<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">stop when generator returns</span>
                       <span class="org-comment-delimiter">;; </span><span class="org-comment">nothing</span>
                       <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">the last value</span>
                        <span class="org-kcats-brackets">[</span>generate <span class="org-builtin">clone</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span>
                        <span class="org-builtin">sink</span>
                        <span class="org-kcats-brackets">[[</span><span class="org-function-name">put</span><span class="org-kcats-brackets">]</span> bail<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]</span>
                       <span class="org-preprocessor">until</span>
                       <span class="org-builtin">drop</span> <span class="org-builtin">drop</span> <span class="org-builtin">sink</span> <span class="org-builtin">drop</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">the now-empty dispenser</span>
          <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>integers 5 taker<span class="org-kcats-brackets">]</span> generator <span class="org-kcats-brackets">[]</span> siphon<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>0 1 2 3 4<span class="org-kcats-brackets">]]]]]]]</span>

 <span class="org-kcats-brackets">[</span>close <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>pipe<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]]]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span><span class="org-kcats-brackets">]]]]]</span>
<span class="org-function-name">join</span>
</pre>
</div></div>
</div>
</div>
