lexicon.org
** Crypto
#+begin_src kcats :tangle src/kcats/stdlib/crypto-builtins.kcats :mkdirp yes
  [random [[spec [[integer] [bytes]]]]]

  [key [[spec [[bytes] [bytes]]]
        [examples [[[["foo" encode key] 2 times =] [yes]]]]]]

  [sign [[spec [[[bytes message] [association key]] [bytes]]]]]

  [verify [[spec [[[bytes signature]
                   [bytes message]
                   [sized key]]

                  [boolean]]]
           [examples [[["foo" encode key "we attack at dawn" encode [sign] shield verify] [yes]]]]]]
#+end_src

#+begin_src kcats :tangle src/kcats/stdlib/crypto.kcats :mkdirp yes
  [[delegated [[spec [[[association pubkey]] [program]]]
               [definition [[[sink ;; css cs pk
                              [[hash] [shield dip] decorated ;; css csh cs pk
                               float ;; cs css csh pk
                               [verify] dip
                               [[]]  ;; the program to run if the child script isn't authorized
                               branch] ;; runs the child script if the sig on its hash is verified
                              [drop drop ;; the sig and (empty) child script -> pk sig msg
                               sink ;; sig msg pk
                               verify]
                              [clone] dipdown branch]
                             [[]] recover]
                            swap prepend]]]] ;; prepend the pubkey

   [hash [[spec [[item] [bytes]]]
          [definition [[[[bytes?] [hashbytes]]
                        [[true] [encode hash]]]
                       decide]]]]]
  join
#+end_src

** Time and date
#+begin_src kcats :tangle src/kcats/stdlib/time.kcats :mkdirp yes
  [[milliseconds [[spec [[integer] [integer]]]
                  [definition []]]]

   [seconds [[spec [[integer] [integer]]]
             [definition [1000 *]]]]

   [minutes [[spec [[integer] [integer]]]
             [definition [seconds 60 *]]]]

   [hours [[spec [[integer] [integer]]]
           [definition [minutes 60 *]]]]

   [days [[spec [[integer] [integer]]]
          [definition [hours 24 *]]]]]
  join
#+end_src
