lexicon.html
<div id="outline-container-orgaf150de" class="outline-3">
<h3 id="orgaf150de"><span class="section-number-3">1.14.</span> Crypto</h3>
<div class="outline-text-3" id="text-1-14">
<div class='tangle-wrapper' data-tangle='src/kcats/stdlib/crypto-builtins.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>random <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>integer<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>bytes<span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>key <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>bytes<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>bytes<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[</span><span class="org-string">"foo"</span> encode key<span class="org-kcats-brackets">]</span> 2 <span class="org-preprocessor">times</span> =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>sign <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>bytes message<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>association key<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>bytes<span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>verify <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>bytes signature<span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[</span>bytes message<span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[</span>sized key<span class="org-kcats-brackets">]]</span>

                <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span><span class="org-string">"foo"</span> encode key <span class="org-string">"we attack at dawn"</span> encode <span class="org-kcats-brackets">[</span>sign<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> verify<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]]]]]</span>
</pre>
</div></div>

<div class='tangle-wrapper' data-tangle='src/kcats/stdlib/crypto.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span>delegated <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>association pubkey<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program<span class="org-kcats-brackets">]]]</span>
             <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[</span><span class="org-builtin">sink</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">css cs pk</span>
                            <span class="org-kcats-brackets">[[</span>hash<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">shield</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]</span> decorated <span class="org-comment-delimiter">;; </span><span class="org-comment">css csh cs pk</span>
                             <span class="org-builtin">float</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">cs css csh pk</span>
                             <span class="org-kcats-brackets">[</span>verify<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span>
                             <span class="org-kcats-brackets">[[]]</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">the program to run if the child script isn't authorized</span>
                             <span class="org-preprocessor">branch</span><span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">runs the child script if the sig on its hash is verified</span>
                            <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-builtin">drop</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">the sig and (empty) child script -&gt; pk sig msg</span>
                             <span class="org-builtin">sink</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">sig msg pk</span>
                             verify<span class="org-kcats-brackets">]</span>
                            <span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dipdown</span> <span class="org-preprocessor">branch</span><span class="org-kcats-brackets">]</span>
                           <span class="org-kcats-brackets">[[]]</span> recover<span class="org-kcats-brackets">]</span>
                          <span class="org-builtin">swap</span> prepend<span class="org-kcats-brackets">]]]]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">prepend the pubkey</span>

 <span class="org-kcats-brackets">[</span>hash <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>bytes<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[[</span>bytes?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>hashbytes<span class="org-kcats-brackets">]]</span>
                      <span class="org-kcats-brackets">[[</span><span class="org-keyword">true</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>encode hash<span class="org-kcats-brackets">]]]</span>
                     decide<span class="org-kcats-brackets">]]]]]</span>
<span class="org-function-name">join</span>
</pre>
</div></div>
</div>
</div>
<div id="outline-container-orgbb8a371" class="outline-3">
<h3 id="orgbb8a371"><span class="section-number-3">1.15.</span> Time and date</h3>
<div class="outline-text-3" id="text-1-15">
<div class='tangle-wrapper' data-tangle='src/kcats/stdlib/time.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span>milliseconds <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>integer<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>integer<span class="org-kcats-brackets">]]]</span>
                <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[]]]]</span>

 <span class="org-kcats-brackets">[</span>seconds <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>integer<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>integer<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>1000 *<span class="org-kcats-brackets">]]]]</span>

 <span class="org-kcats-brackets">[</span>minutes <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>integer<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>integer<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>seconds 60 *<span class="org-kcats-brackets">]]]]</span>

 <span class="org-kcats-brackets">[</span>hours <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>integer<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>integer<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>minutes 60 *<span class="org-kcats-brackets">]]]]</span>

 <span class="org-kcats-brackets">[</span>days <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>integer<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>integer<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>hours 24 *<span class="org-kcats-brackets">]]]]]</span>
<span class="org-function-name">join</span>
</pre>
</div></div>
</div>
</div>
