lexicon.org
** Nested Environments
#+begin_src kcats :tangle src/kcats/core/environment-builtins.kcats :mkdirp yes 
  [environment [[spec [[sized] [environment]]]
                [examples [[[[[program [1 2 3]]] environment eval-step [stack] lookup] [[1]]]]]]]

  [environment? [[spec [[item] [boolean]]]
                 [examples [[[[[program [1 inc]]] environment environment?] [yes]]
                            [[[[program [1 inc]]] environment?] [[]]]]]]]

  [eval-step [[spec [[environment] [environment]]]
              [examples [[[[[program [1 inc]]] environment
                           eval-step eval-step
                           [stack] lookup]
                          [[2]]]]]]]

  [evaluate [[spec [[item] [environment]]]
             [examples [[[[[program [1 2 3 4 + *]]] environment
                          evaluate
                          [stack] lookup]
                         [[14 1]]]]]]]

  [finished? [[spec [[environment] [boolean]]]
              [examples [[[[[program [1 2 3 4 + *]]] environment
                          finished?]
                         [[]]]
                        [[[[program [1 2 3 4 + *]]] environment
                          evaluate
                          finished?]
                         [yes]]]]]]

  [using [[spec [[[list modules] [sized env]] [environment]]]]]

  [use [[spec [[[program [list modules]] [*]]]]
        [definition [[program] label environment swap ;; lm env
                     [[stack] [snapshot] divedown assign] dip ;; capture the stack at runtime
                     using ;; set up the resolver 
                     evaluate ;; execute the program in the inner environment
                     [stack] lookup restore ;; replace the stack with the result from the inner env
                     ]]]]
#+end_src

#+begin_src kcats :tangle src/kcats/core/environment.kcats :mkdirp yes
  [tos [[spec [[environment] [item]]]
        [definition [[stack] lookup first]]
        [examples [[[[[stack [1 2 3]]
                      [program [[+] step]]]
                     tos]
                    [1]]]]]]

  ;; TODO we don't use the term 'expression' anymore so this needs renaming
  [top [[spec [[environment] [item]]]
        [definition [[program] lookup first]]
        [examples [[[[[stack [1 2 3]]
                      [program [[+] step]]]
                     toe]
                    [[+]]]]]]]

  [stage [[spec [[program] [environment]]]
          [definition [[program] label environment]]]]

  [capture [[spec [[environment] [environment]]]
            [doc "Capture the outer stack and assign it to the inner env's stack"]
            [definition [[stack]
                         [snapshot] divedown
                         assign]]]]

  [spawn [[spec [[program dictionary] [environment]]]
          [definition [[snapshot] dipdown ;; p d s
                       [program dictionary stack] label
                       environment]]
          [examples [[[1 2 3 dictionary [swap clone] spawn]
                      [1 2 3 [[program [swap clone]] [stack [3 2 1]]] environment]]]]]]

  [confine [[spec [[[program module] dictionary] [*]]]
            [definition [spawn evaluate [stack] lookup restore]]]]
#+end_src
