lexicon.html
<div id="outline-container-org4ed1352" class="outline-3">
<h3 id="org4ed1352"><span class="section-number-3">1.16.</span> Nested Environments</h3>
<div class="outline-text-3" id="text-1-16">
<div class='tangle-wrapper' data-tangle='src/kcats/core/environment-builtins.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>environment <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>sized<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>environment<span class="org-kcats-brackets">]]]</span>
              <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>program <span class="org-kcats-brackets">[</span>1 2 3<span class="org-kcats-brackets">]]]</span> environment eval-<span class="org-function-name">step</span> <span class="org-kcats-brackets">[</span>stack<span class="org-kcats-brackets">]</span> lookup<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>1<span class="org-kcats-brackets">]]]]]]]</span>

<span class="org-kcats-brackets">[</span>environment? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>item<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
               <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>program <span class="org-kcats-brackets">[</span>1 inc<span class="org-kcats-brackets">]]]</span> environment environment?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]</span>
                          <span class="org-kcats-brackets">[[[[</span>program <span class="org-kcats-brackets">[</span>1 inc<span class="org-kcats-brackets">]]]</span> environment?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]]]]]]]</span>

<span class="org-kcats-brackets">[</span>eval-<span class="org-function-name">step</span> <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>environment<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>environment<span class="org-kcats-brackets">]]]</span>
            <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>program <span class="org-kcats-brackets">[</span>1 inc<span class="org-kcats-brackets">]]]</span> environment
                         eval-<span class="org-function-name">step</span> eval-<span class="org-function-name">step</span>
                         <span class="org-kcats-brackets">[</span>stack<span class="org-kcats-brackets">]</span> lookup<span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[[</span>2<span class="org-kcats-brackets">]]]]]]]</span>

<span class="org-kcats-brackets">[</span>evaluate <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>environment<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>environment<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>program <span class="org-kcats-brackets">[</span>1 2 3 4 + *<span class="org-kcats-brackets">]]]</span> environment
                        evaluate
                        <span class="org-kcats-brackets">[</span>stack<span class="org-kcats-brackets">]</span> lookup<span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[[</span>14 1<span class="org-kcats-brackets">]]]]]]]</span>

<span class="org-kcats-brackets">[</span>finished? <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>environment<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>boolean<span class="org-kcats-brackets">]]]</span>
            <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>program <span class="org-kcats-brackets">[</span>1 2 3 4 + *<span class="org-kcats-brackets">]]]</span> environment
                        finished?<span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[[]]]</span>
                      <span class="org-kcats-brackets">[[[[</span>program <span class="org-kcats-brackets">[</span>1 2 3 4 + *<span class="org-kcats-brackets">]]]</span> environment
                        evaluate
                        finished?<span class="org-kcats-brackets">]</span>
                       <span class="org-kcats-brackets">[</span>yes<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>using <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>list modules<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>sized env<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>environment<span class="org-kcats-brackets">]]]]]</span>

<span class="org-kcats-brackets">[</span>use <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program <span class="org-kcats-brackets">[</span>list modules<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]]</span>
      <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> label environment <span class="org-builtin">swap</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">lm env</span>
                   <span class="org-kcats-brackets">[[</span>stack<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">snapshot</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">divedown</span> assign<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">capture the stack at runtime</span>
                   using <span class="org-comment-delimiter">;; </span><span class="org-comment">set up the resolver </span>
                   evaluate <span class="org-comment-delimiter">;; </span><span class="org-comment">execute the program in the inner environment</span>
                   <span class="org-kcats-brackets">[</span>stack<span class="org-kcats-brackets">]</span> lookup restore <span class="org-comment-delimiter">;; </span><span class="org-comment">replace the stack with the result from the inner env</span>
                   <span class="org-kcats-brackets">]]]]</span>
</pre>
</div></div>

<div class='tangle-wrapper' data-tangle='src/kcats/core/environment.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>tos <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>environment<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>stack<span class="org-kcats-brackets">]</span> lookup <span class="org-function-name">first</span><span class="org-kcats-brackets">]]</span>
      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>stack <span class="org-kcats-brackets">[</span>1 2 3<span class="org-kcats-brackets">]]</span>
                    <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[[</span>+<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
                   tos<span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[</span>1<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">TODO we don't use the term 'expression' anymore so this needs renaming</span>
<span class="org-kcats-brackets">[</span>top <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>environment<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>item<span class="org-kcats-brackets">]]]</span>
      <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> lookup <span class="org-function-name">first</span><span class="org-kcats-brackets">]]</span>
      <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[[[</span>stack <span class="org-kcats-brackets">[</span>1 2 3<span class="org-kcats-brackets">]]</span>
                    <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[[</span>+<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
                   toe<span class="org-kcats-brackets">]</span>
                  <span class="org-kcats-brackets">[[</span>+<span class="org-kcats-brackets">]]]]]]]</span>

<span class="org-kcats-brackets">[</span>stage <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>environment<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> label environment<span class="org-kcats-brackets">]]]]</span>

<span class="org-kcats-brackets">[</span>spawn <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program dictionary<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>environment<span class="org-kcats-brackets">]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span><span class="org-builtin">snapshot</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dipdown</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">p d s</span>
                     <span class="org-kcats-brackets">[</span>program dictionary stack<span class="org-kcats-brackets">]</span> label
                     environment<span class="org-kcats-brackets">]]</span>
        <span class="org-kcats-brackets">[</span>examples <span class="org-kcats-brackets">[[[</span>1 2 3 dictionary <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span> <span class="org-builtin">clone</span><span class="org-kcats-brackets">]</span> spawn<span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[</span>1 2 3 <span class="org-kcats-brackets">[[</span>program <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span> <span class="org-builtin">clone</span><span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>stack <span class="org-kcats-brackets">[</span>3 2 1<span class="org-kcats-brackets">]]]</span> environment<span class="org-kcats-brackets">]]]]]]</span>

<span class="org-kcats-brackets">[</span>confine <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program module<span class="org-kcats-brackets">]</span> dictionary<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>spawn evaluate <span class="org-kcats-brackets">[</span>stack<span class="org-kcats-brackets">]</span> lookup restore<span class="org-kcats-brackets">]]]]</span>
</pre>
</div></div>
</div>
