lexicon.org
*** Debugging

#+begin_src kcats :tangle src/kcats/stdlib/debug.kcats :mkdirp yes
  [[break [[spec [[[program condition] environment]
                  [[program condition] environment]]]
           [definition [[[[swap something?] ;; still running
                          [execute not]] ;; check condition not true yet
                         [execute]
                         every?] ;; break?
                        [[eval-step] dip]  ;; evaluate the environment one step
                        while]]]]

   [breakpoint [[spec [[] []]]
                [definition []]]]

   [sprint [[spec [[environment]
                   [environment]]]
            [definition [[[program 0] lookup wrap [breakpoint] =] break
                         drop ;; the condition
                         [] [eval-step] when]]]] ;; advance past the breakpoint word if the program isn't complete


   [advance [[spec [[environment] [environment]]]
             [definition [[[program] lookup count] shield swap ;; count up the program length, we'll run until it's smaller than this

                          [[program] lookup count  ;; only stop if expr empty or shorter than we started off
                           [[positive?] [<=]] [execute] every?]
                          [eval-step]  ;; evaluate the environment one step
                          while
                          dropdown]]]]  ;; drop the program length item

   [stepper [[spec [[] [program]]]
             [definition [[eval-step clone]]]]]

   [tracer [[spec [[program] [[program generator]]]]
            [definition [stage stepper]]]]

   [dump [[spec [[] []]]
          [definition [snapshot wrap emit autoformat print]]]]

   [heatmap [[spec [[program] [association]]]
             [definition [[tracer
                           ;; what item is being executed
                           [[program] lookup [first]
                            ;; don't emit [] or the execution stops, use 0 instead
                            bail 0 or]
                           each 
                           [word?] keep ;; count only words, which filters out the 0's from above
                           frequencies] shielddown]]]]]


  join
#+end_src

#+begin_src kcats :tangle src/kcats/stdlib/debug-step.kcats :mkdirp yes
  [[evaluating? [[program] lookup [evaluate] starts?]]
   [with-innermost [[[] swap
                     [[evaluating?]
                      [[stack 0] clone [lookup] dip swap [join] dip ] ;; append the next part of the path to the accumulator
                      while swap] shield dropdeep]
                    dip ;; under the stepping prog
                    [update] shielddown flip drop

                    ;; find which envs are finished and remove
                    ;; 'evaluate' from parent
                    [0 -2 slice clone] [collect] shielddeep 
                    [[[[[evaluating?]
                        [[stack 0] lookup finished?]]
                       [execute] every?]
                      [[program] [rest] update]
                      when]
                     [update] shielddown flip drop drop]
                    step]]]
  join
#+end_src
****  Examples
