lexicon.html
<div id="outline-container-org6c1655d" class="outline-4">
<h4 id="org6c1655d"><span class="section-number-4">1.16.1.</span> Debugging</h4>
<div class="outline-text-4" id="text-1-16-1">
<div class='tangle-wrapper' data-tangle='src/kcats/stdlib/debug.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span>break <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[[</span>program condition<span class="org-kcats-brackets">]</span> environment<span class="org-kcats-brackets">]</span>
                <span class="org-kcats-brackets">[[</span>program condition<span class="org-kcats-brackets">]</span> environment<span class="org-kcats-brackets">]]]</span>
         <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[[</span><span class="org-builtin">swap</span> something?<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">still running</span>
                        <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span> not<span class="org-kcats-brackets">]]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">check condition not true yet</span>
                       <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span>
                       every?<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">break?</span>
                      <span class="org-kcats-brackets">[[</span>eval-<span class="org-function-name">step</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">evaluate the environment one step</span>
                      <span class="org-preprocessor">while</span><span class="org-kcats-brackets">]]]]</span>

 <span class="org-kcats-brackets">[</span>breakpoint <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[]]]</span>
              <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[]]]]</span>

 <span class="org-kcats-brackets">[</span>sprint <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>environment<span class="org-kcats-brackets">]</span>
                 <span class="org-kcats-brackets">[</span>environment<span class="org-kcats-brackets">]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[</span>program 0<span class="org-kcats-brackets">]</span> lookup <span class="org-function-name">wrap</span> <span class="org-kcats-brackets">[</span>breakpoint<span class="org-kcats-brackets">]</span> =<span class="org-kcats-brackets">]</span> break
                       <span class="org-builtin">drop</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">the condition</span>
                       <span class="org-kcats-brackets">[]</span> <span class="org-kcats-brackets">[</span>eval-<span class="org-function-name">step</span><span class="org-kcats-brackets">]</span> when<span class="org-kcats-brackets">]]]]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">advance past the breakpoint word if the program isn't complete</span>


 <span class="org-kcats-brackets">[</span>advance <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>environment<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>environment<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[[</span>program<span class="org-kcats-brackets">]</span> lookup <span class="org-function-name">count</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> <span class="org-builtin">swap</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">count up the program length, we'll run until it's smaller than this</span>

                        <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> lookup <span class="org-function-name">count</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">only stop if expr empty or shorter than we started off</span>
                         <span class="org-kcats-brackets">[[</span>positive?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>&lt;=<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> every?<span class="org-kcats-brackets">]</span>
                        <span class="org-kcats-brackets">[</span>eval-<span class="org-function-name">step</span><span class="org-kcats-brackets">]</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">evaluate the environment one step</span>
                        <span class="org-preprocessor">while</span>
                        <span class="org-builtin">dropdown</span><span class="org-kcats-brackets">]]]]</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">drop the program length item</span>

 <span class="org-kcats-brackets">[</span>stepper <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[</span>program<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>eval-<span class="org-function-name">step</span> <span class="org-builtin">clone</span><span class="org-kcats-brackets">]]]]]</span>

 <span class="org-kcats-brackets">[</span>tracer <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>program generator<span class="org-kcats-brackets">]]]]</span>
          <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span>stage stepper<span class="org-kcats-brackets">]]]]</span>

 <span class="org-kcats-brackets">[</span>dump <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[]]]</span>
        <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[</span><span class="org-builtin">snapshot</span> <span class="org-function-name">wrap</span> emit autoformat print<span class="org-kcats-brackets">]]]]</span>

 <span class="org-kcats-brackets">[</span>heatmap <span class="org-kcats-brackets">[[</span>spec <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>association<span class="org-kcats-brackets">]]]</span>
           <span class="org-kcats-brackets">[</span>definition <span class="org-kcats-brackets">[[</span>tracer
                         <span class="org-comment-delimiter">;; </span><span class="org-comment">what item is being executed</span>
                         <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> lookup <span class="org-kcats-brackets">[</span><span class="org-function-name">first</span><span class="org-kcats-brackets">]</span>
                          <span class="org-comment-delimiter">;; </span><span class="org-comment">don't emit [] or the execution stops, use 0 instead</span>
                          bail 0 or<span class="org-kcats-brackets">]</span>
                         each 
                         <span class="org-kcats-brackets">[</span>word?<span class="org-kcats-brackets">]</span> keep <span class="org-comment-delimiter">;; </span><span class="org-comment">count only words, which filters out the 0's from above</span>
                         frequencies<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shielddown</span><span class="org-kcats-brackets">]]]]]</span>


<span class="org-function-name">join</span>
</pre>
</div></div>

<div class='tangle-wrapper' data-tangle='src/kcats/stdlib/debug-step.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span>evaluating? <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> lookup <span class="org-kcats-brackets">[</span>evaluate<span class="org-kcats-brackets">]</span> starts?<span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>with-innermost <span class="org-kcats-brackets">[[[]</span> <span class="org-builtin">swap</span>
                   <span class="org-kcats-brackets">[[</span>evaluating?<span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[</span>stack 0<span class="org-kcats-brackets">]</span> <span class="org-builtin">clone</span> <span class="org-kcats-brackets">[</span>lookup<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-builtin">swap</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">append the next part of the path to the accumulator</span>
                    <span class="org-preprocessor">while</span> <span class="org-builtin">swap</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> dropdeep<span class="org-kcats-brackets">]</span>
                  <span class="org-preprocessor">dip</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">under the stepping prog</span>
                  <span class="org-kcats-brackets">[</span>update<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shielddown</span> flip <span class="org-builtin">drop</span>

                  <span class="org-comment-delimiter">;; </span><span class="org-comment">find which envs are finished and remove</span>
                  <span class="org-comment-delimiter">;; </span><span class="org-comment">'evaluate' from parent</span>
                  <span class="org-kcats-brackets">[</span>0 -2 slice <span class="org-builtin">clone</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>collect<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shielddeep</span> 
                  <span class="org-kcats-brackets">[[[[[</span>evaluating?<span class="org-kcats-brackets">]</span>
                      <span class="org-kcats-brackets">[[</span>stack 0<span class="org-kcats-brackets">]</span> lookup finished?<span class="org-kcats-brackets">]]</span>
                     <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> every?<span class="org-kcats-brackets">]</span>
                    <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">rest</span><span class="org-kcats-brackets">]</span> update<span class="org-kcats-brackets">]</span>
                    when<span class="org-kcats-brackets">]</span>
                   <span class="org-kcats-brackets">[</span>update<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shielddown</span> flip <span class="org-builtin">drop</span> <span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span>
                  <span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
<span class="org-function-name">join</span>
</pre>
</div></div>
</div>
