lexicon.org
***** Count the number of times each word is executed while running a program.
#+begin_src kcats :results code
[[program [10 [0 >] [clone dec] while]]]  ;; the sample program to run
environment
evaluate
#+end_src

#+RESULTS:
#+begin_src kcats
[[stack [0 1 2 3 4 5 6 7 8 9 10]] [program []]]
#+end_src

#+begin_src kcats
10 [0 >] [clone dec] while
#+end_src
#+RESULTS:
:
: [0 1 2 3 4 5 6 7 8 9 10]

#+begin_src kcats
[swap] unwrap  word?
#+end_src

#+RESULTS:
:
: [yes]

"Increment the counter, or set to 1 if nothing"
#+begin_src kcats
[] [inc] bail 1 or
#+end_src

#+RESULTS:
: 1

#+begin_src kcats :results code
[] ;; empty list to put word counts in
[[program [3 [0 >] [clone dec] while]]]  ;; the sample program to run
environment
[[program] lookup something?] ;; something still in the program, keep running
[[[program] lookup first] shield ;; get the item we're about to execute
 swap ;; put it under the environment
 [[word?] ; if it's a word
  [wrap
   [[inc] bail 1 or]
   update] ;; the results, the count for the word about to execute
  [drop] ;; if it's not a word, do nothing
  if] dip
 eval-step] ;; evaluate the environment one step
while
drop ;; drop the environment and just report the word counts
#+end_src

#+RESULTS:
#+begin_src kcats
[[wrap 1] [step 2] [first 4] [snapshot 4] [execute 1] [put 1] [inject 4] [loop 4] [dec 3] [decorate 1] [swap 5] [unwrap 14] [take 4] [join 1] [> 4] [while 1] [shield 4] [dipdown 1] [evert 16] [clone 8] [dip 9]]
#+end_src

Now that we have generators and =frequencies= I think this can be greatly simplified:

#+begin_src kcats
  [5000 [0 >] [clone dec] while]  ;; the sample program to run
  tracer
  [[program 0] lookup "foo" or] each
  [word?] keep
  frequencies
#+end_src

#+RESULTS:
#+begin_src kcats
[[> 1001]
 [clone 2002]
 [dec 1000]
 [decorate 2]
 [decorated 1]
 [dip 2007]
 [dip 2]
 [dipdown 1]
 [evert 4004]
 [execute 1]
 [first 1001]
 [inject 1001]
 [join 1]
 [loop 1001]
 [put 3]
 [shield 1001]
 [shield 1]
 [snapshot 1001]
 [step 5]
 [swap 1002]
 
 [take 1001]
 [unwrap 1001]
 [while 1]
 [wrap 3]]
[clone [[generate] dip [drop generate]
        while]
 dive]
[[[something?] [word? not]]
 [execute] every?]
[generate [[[program 0]
            lookup "foo" or]
           bail]
 shielddown]
[eval-step clone]
[]
#+end_src

