lexicon.html
<div id="outline-container-orge15863a" class="outline-5">
<h5 id="orge15863a"><span class="section-number-5">1.16.1.1.</span> Examples</h5>
<div class="outline-text-5" id="text-1-16-1-1">
</div>
<ol class="org-ol">
<li><a id="orga9f5c60"></a>Count the number of times each word is executed while running a program.<br />
<div class="outline-text-6" id="text-1-16-1-1-1">
<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span>program <span class="org-kcats-brackets">[</span>10 <span class="org-kcats-brackets">[</span>0 &gt;<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span> dec<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">while</span><span class="org-kcats-brackets">]]]</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">the sample program to run</span>
environment
evaluate
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[</span>0 1 2 3 4 5 6 7 8 9 10<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[]]]</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-kcats">10 <span class="org-kcats-brackets">[</span>0 &gt;<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span> dec<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">while</span>
</pre>
</div>
<pre class="example">

[0 1 2 3 4 5 6 7 8 9 10]
</pre>


<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span>  word?
</pre>
</div>

<pre class="example">

[yes]
</pre>


<p>
"Increment the counter, or set to 1 if nothing"
</p>
<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[]</span> <span class="org-kcats-brackets">[</span>inc<span class="org-kcats-brackets">]</span> bail 1 or
</pre>
</div>

<pre class="example">
1
</pre>


<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">empty list to put word counts in</span>
<span class="org-kcats-brackets">[[</span>program <span class="org-kcats-brackets">[</span>3 <span class="org-kcats-brackets">[</span>0 &gt;<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span> dec<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">while</span><span class="org-kcats-brackets">]]]</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">the sample program to run</span>
environment
<span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> lookup something?<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">something still in the program, keep running</span>
<span class="org-kcats-brackets">[[[</span>program<span class="org-kcats-brackets">]</span> lookup <span class="org-function-name">first</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">get the item we're about to execute</span>
 <span class="org-builtin">swap</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">put it under the environment</span>
 <span class="org-kcats-brackets">[[</span>word?<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">; </span><span class="org-comment">if it's a word</span>
  <span class="org-kcats-brackets">[</span><span class="org-function-name">wrap</span>
   <span class="org-kcats-brackets">[[</span>inc<span class="org-kcats-brackets">]</span> bail 1 or<span class="org-kcats-brackets">]</span>
   update<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">the results, the count for the word about to execute</span>
  <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">if it's not a word, do nothing</span>
  <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span>
 eval-<span class="org-function-name">step</span><span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">evaluate the environment one step</span>
<span class="org-preprocessor">while</span>
<span class="org-builtin">drop</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">drop the environment and just report the word counts</span>
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span><span class="org-function-name">wrap</span> 1<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">step</span> 2<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">first</span> 4<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">snapshot</span> 4<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span> 1<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">put</span> 1<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">inject</span> 4<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">loop</span> 4<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>dec 3<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>decorate 1<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span> 5<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">unwrap</span> 14<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span> 4<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">join</span> 1<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>&gt; 4<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">while</span> 1<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">shield</span> 4<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">dipdown</span> 1<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">evert</span> 16<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span> 8<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">dip</span> 9<span class="org-kcats-brackets">]]</span>
</pre>
</div>

<p>
Now that we have generators and <code>frequencies</code> I think this can be greatly simplified:
</p>

<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>5000 <span class="org-kcats-brackets">[</span>0 &gt;<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span> dec<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">while</span><span class="org-kcats-brackets">]</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">the sample program to run</span>
tracer
<span class="org-kcats-brackets">[[</span>program 0<span class="org-kcats-brackets">]</span> lookup <span class="org-string">"foo"</span> or<span class="org-kcats-brackets">]</span> each
<span class="org-kcats-brackets">[</span>word?<span class="org-kcats-brackets">]</span> keep
frequencies
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span>&gt; 1001<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span> 2002<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span>dec 1000<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span>decorate 2<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span>decorated 1<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-preprocessor">dip</span> 2007<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-preprocessor">dip</span> 2<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-preprocessor">dipdown</span> 1<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-builtin">evert</span> 4004<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span> 1<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-function-name">first</span> 1001<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-preprocessor">inject</span> 1001<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-function-name">join</span> 1<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-preprocessor">loop</span> 1001<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-function-name">put</span> 3<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-preprocessor">shield</span> 1001<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-preprocessor">shield</span> 1<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-builtin">snapshot</span> 1001<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-function-name">step</span> 5<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span> 1002<span class="org-kcats-brackets">]</span>
 
 <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span> 1001<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-function-name">unwrap</span> 1001<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-preprocessor">while</span> 1<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-function-name">wrap</span> 3<span class="org-kcats-brackets">]]</span>
<span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span> <span class="org-kcats-brackets">[[</span>generate<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> generate<span class="org-kcats-brackets">]</span>
        <span class="org-preprocessor">while</span><span class="org-kcats-brackets">]</span>
 <span class="org-preprocessor">dive</span><span class="org-kcats-brackets">]</span>
<span class="org-kcats-brackets">[[[</span>something?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>word? not<span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> every?<span class="org-kcats-brackets">]</span>
<span class="org-kcats-brackets">[</span>generate <span class="org-kcats-brackets">[[[</span>program 0<span class="org-kcats-brackets">]</span>
            lookup <span class="org-string">"foo"</span> or<span class="org-kcats-brackets">]</span>
           bail<span class="org-kcats-brackets">]</span>
 <span class="org-preprocessor">shielddown</span><span class="org-kcats-brackets">]</span>
<span class="org-kcats-brackets">[</span>eval-<span class="org-function-name">step</span> <span class="org-builtin">clone</span><span class="org-kcats-brackets">]</span>
<span class="org-kcats-brackets">[]</span>
</pre>
</div>
</div>
</li>
