lexicon.org
***** CANCELED spec checking
clojure spec check can be replaced with predicate programs, that will
be run with =shield= before the actual word and if it returns false,
will raise an error.
***** TODO Trace output
#+begin_src kcats :results code
[] ;; results
[[program [1 [2 3 4 5] [*] step]]]  ;; the sample program to run
environment

[[program] lookup something?] ;; break?
[eval-step clone [put] dip]  ;; evaluate the environment one step
while

#+end_src

#+RESULTS:
#+begin_src kcats
[[[stack [120]] [program []]]
 [[[stack [1]] [program [[2 3 4 5] [*] step]]]
  [[stack [[2 3 4 5] 1]] [program [[*] step]]]
  [[stack [[*] [2 3 4 5] 1]] [program [step]]]
  [[stack [[*] 2 1]] [program [execute [3 4 5] [*] step]]]
  [[stack [2 1]] [program [* [3 4 5] [*] step]]]
  [[stack [2]] [program [[3 4 5] [*] step]]]
  [[stack [[3 4 5] 2]] [program [[*] step]]]
  [[stack [[*] [3 4 5] 2]] [program [step]]]
  [[stack [[*] 3 2]] [program [execute [4 5] [*] step]]]
  [[stack [3 2]] [program [* [4 5] [*] step]]]
  [[stack [6]] [program [[4 5] [*] step]]]
  [[stack [[4 5] 6]] [program [[*] step]]]
  [[stack [[*] [4 5] 6]] [program [step]]]
  [[stack [[*] 4 6]] [program [execute [5] [*] step]]]
  [[stack [4 6]] [program [* [5] [*] step]]]
  [[stack [24]] [program [[5] [*] step]]]
  [[stack [[5] 24]] [program [[*] step]]]
  [[stack [[*] [5] 24]] [program [step]]]
  [[stack [[*] 5 24]] [program [execute]]]
  [[stack [5 24]] [program [*]]]
  [[stack [120]] [program []]]]]
#+end_src


