lexicon.html
<li><a id="org69001b5"></a><span class="done CANCELED">CANCELED</span> spec checking<br />
<div class="outline-text-6" id="text-1-16-1-1-2">
<p>
clojure spec check can be replaced with predicate programs, that will
be run with <code>shield</code> before the actual word and if it returns false,
will raise an error.
</p>
</div>
</li>
<li><a id="orgafc3462"></a><span class="todo TODO">TODO</span> Trace output<br />
<div class="outline-text-6" id="text-1-16-1-1-3">
<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">results</span>
<span class="org-kcats-brackets">[[</span>program <span class="org-kcats-brackets">[</span>1 <span class="org-kcats-brackets">[</span>2 3 4 5<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">the sample program to run</span>
environment

<span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> lookup something?<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">break?</span>
<span class="org-kcats-brackets">[</span>eval-<span class="org-function-name">step</span> <span class="org-builtin">clone</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">put</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">evaluate the environment one step</span>
<span class="org-preprocessor">while</span>

</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[[</span>stack <span class="org-kcats-brackets">[</span>120<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[]]]</span>
 <span class="org-kcats-brackets">[[[</span>stack <span class="org-kcats-brackets">[</span>1<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[[</span>2 3 4 5<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[[</span>2 3 4 5<span class="org-kcats-brackets">]</span> 1<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[[</span>*<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[[</span>*<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>2 3 4 5<span class="org-kcats-brackets">]</span> 1<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[</span><span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[[</span>*<span class="org-kcats-brackets">]</span> 2 1<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span> <span class="org-kcats-brackets">[</span>3 4 5<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[</span>2 1<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[</span>* <span class="org-kcats-brackets">[</span>3 4 5<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[</span>2<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[[</span>3 4 5<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[[</span>3 4 5<span class="org-kcats-brackets">]</span> 2<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[[</span>*<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[[</span>*<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>3 4 5<span class="org-kcats-brackets">]</span> 2<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[</span><span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[[</span>*<span class="org-kcats-brackets">]</span> 3 2<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span> <span class="org-kcats-brackets">[</span>4 5<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[</span>3 2<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[</span>* <span class="org-kcats-brackets">[</span>4 5<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[</span>6<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[[</span>4 5<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[[</span>4 5<span class="org-kcats-brackets">]</span> 6<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[[</span>*<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[[</span>*<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>4 5<span class="org-kcats-brackets">]</span> 6<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[</span><span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[[</span>*<span class="org-kcats-brackets">]</span> 4 6<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span> <span class="org-kcats-brackets">[</span>5<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[</span>4 6<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[</span>* <span class="org-kcats-brackets">[</span>5<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[</span>24<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[[</span>5<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[[</span>5<span class="org-kcats-brackets">]</span> 24<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[[</span>*<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[[</span>*<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>5<span class="org-kcats-brackets">]</span> 24<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[</span><span class="org-function-name">step</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[[</span>*<span class="org-kcats-brackets">]</span> 5 24<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[</span>5 24<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[</span>*<span class="org-kcats-brackets">]]]</span>
  <span class="org-kcats-brackets">[[</span>stack <span class="org-kcats-brackets">[</span>120<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>program <span class="org-kcats-brackets">[]]]]]</span>
</pre>
</div>
</div>
</li>
