lexicon.org
***** DONE Step count limiting
When testing or debugging, limit the number of steps to avoid a
possible infinite loop.
#+begin_src kcats :results code
  200 ;; step count remaining
  [[program [10 [0 >] [clone dec] while]]]  ;; the sample program to run
  environment

  [[program] lookup something? ;; something still in the program
   [positive?] dip and] ;; still step budget remaining
  [eval-step ;; evaluate the environment one step
   [dec] dip] ;; decrease the step budget
  while

  ;[stack] lookup ;; return the output
#+end_src

#+RESULTS:
#+begin_src kcats
[[program [take dip evert first [clone dec [0 >] shield] loop]] [stack [[[0 >] 4 5 6 7 8 9 10] 4 5 6 7 8 9 10]]] 0
#+end_src

***** DONE Breakpoint
#+begin_src kcats
[[[[toe [+] unwrap =]
   [tos 3 >]]
  [execute]
  every?] ;; when to stop - when we're about to add and tos already >3
 [0 [1 2 3 4 5] [+] step]  ;; the sample program to run
 environment

 [[[[program] lookup something?] ;; something still in the program
   [swap execute not]] ;; don't stop yet
  [execute]
  every?] ;; break?
 [eval-step]  ;; evaluate the environment one step
 while]
#+end_src
***** TODO Step over
#+begin_src kcats
[[0 [1 2 3 4 5] [+] step]  ;; the sample program to run
 environment

[[program] lookup count] shield swap;; count up the program length, we'll run until it's smaller than this

 [[program] lookup count
  [[positive?] [<=]] [execute] every?] ;; only stop if expr empty or shorter than we started off
 [eval-step]  ;; evaluate the environment one step
 while]
#+end_src
** TODO Functional environment
There are use cases for kcats where you don't want a program to be
able to mess with external resources like files, network sockets etc
nor be able to spawn new threads, the program it's running should be a
pure function and this module lets you enforce that.
#+begin_src kcats :tangle src/kcats/stdlib/functional.kcats :mkdirp yes
  [pipe-in pipe-out channel timeout
   handoff file-in file-out timestamps
   standard serversocket animate future
   spit tunnel database]
  [wrap unassign] step
#+end_src
* Issues
** DONE Get rid of platform-specific definitions
** DONE fix evaluate
#+begin_src kcats
  [[program [1 1 +]]] environment evaluate [stack] lookup
#+end_src

#+RESULTS:
:
: [[2]]
