lexicon.html
<li><a id="org86f920d"></a><span class="done DONE">DONE</span> Step count limiting<br />
<div class="outline-text-6" id="text-1-16-1-1-4">
<p>
When testing or debugging, limit the number of steps to avoid a
possible infinite loop.
</p>
<div class="org-src-container">
<pre class="src src-kcats">200 <span class="org-comment-delimiter">;; </span><span class="org-comment">step count remaining</span>
<span class="org-kcats-brackets">[[</span>program <span class="org-kcats-brackets">[</span>10 <span class="org-kcats-brackets">[</span>0 &gt;<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span> dec<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">while</span><span class="org-kcats-brackets">]]]</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">the sample program to run</span>
environment

<span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> lookup something? <span class="org-comment-delimiter">;; </span><span class="org-comment">something still in the program</span>
 <span class="org-kcats-brackets">[</span>positive?<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> and<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">still step budget remaining</span>
<span class="org-kcats-brackets">[</span>eval-<span class="org-function-name">step</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">evaluate the environment one step</span>
 <span class="org-kcats-brackets">[</span>dec<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">decrease the step budget</span>
<span class="org-preprocessor">while</span>

<span class="org-comment-delimiter">;</span><span class="org-comment">[stack] lookup ;; return the output</span>
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span>program <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span> <span class="org-preprocessor">dip</span> <span class="org-builtin">evert</span> <span class="org-function-name">first</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">clone</span> dec <span class="org-kcats-brackets">[</span>0 &gt;<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">loop</span><span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span>stack <span class="org-kcats-brackets">[[[</span>0 &gt;<span class="org-kcats-brackets">]</span> 4 5 6 7 8 9 10<span class="org-kcats-brackets">]</span> 4 5 6 7 8 9 10<span class="org-kcats-brackets">]]]</span> 0
</pre>
</div>
</div>
</li>
<li><a id="org37db6f1"></a><span class="done DONE">DONE</span> Breakpoint<br />
<div class="outline-text-6" id="text-1-16-1-1-5">
<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[[[</span>toe <span class="org-kcats-brackets">[</span>+<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> =<span class="org-kcats-brackets">]</span>
   <span class="org-kcats-brackets">[</span>tos 3 &gt;<span class="org-kcats-brackets">]]</span>
  <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span>
  every?<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">when to stop - when we're about to add and tos already &gt;3</span>
 <span class="org-kcats-brackets">[</span>0 <span class="org-kcats-brackets">[</span>1 2 3 4 5<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>+<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">the sample program to run</span>
 environment

 <span class="org-kcats-brackets">[[[[</span>program<span class="org-kcats-brackets">]</span> lookup something?<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">something still in the program</span>
   <span class="org-kcats-brackets">[</span><span class="org-builtin">swap</span> <span class="org-preprocessor">execute</span> not<span class="org-kcats-brackets">]]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">don't stop yet</span>
  <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span>
  every?<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">break?</span>
 <span class="org-kcats-brackets">[</span>eval-<span class="org-function-name">step</span><span class="org-kcats-brackets">]</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">evaluate the environment one step</span>
 <span class="org-preprocessor">while</span><span class="org-kcats-brackets">]</span>
</pre>
</div>
</div>
</li>
<li><a id="org43b4f02"></a><span class="todo TODO">TODO</span> Step over<br />
<div class="outline-text-6" id="text-1-16-1-1-6">
<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span>0 <span class="org-kcats-brackets">[</span>1 2 3 4 5<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>+<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span><span class="org-kcats-brackets">]</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">the sample program to run</span>
 environment

<span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> lookup <span class="org-function-name">count</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> <span class="org-builtin">swap</span><span class="org-comment-delimiter">;; </span><span class="org-comment">count up the program length, we'll run until it's smaller than this</span>

 <span class="org-kcats-brackets">[[</span>program<span class="org-kcats-brackets">]</span> lookup <span class="org-function-name">count</span>
  <span class="org-kcats-brackets">[[</span>positive?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>&lt;=<span class="org-kcats-brackets">]]</span> <span class="org-kcats-brackets">[</span><span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> every?<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">only stop if expr empty or shorter than we started off</span>
 <span class="org-kcats-brackets">[</span>eval-<span class="org-function-name">step</span><span class="org-kcats-brackets">]</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">evaluate the environment one step</span>
 <span class="org-preprocessor">while</span><span class="org-kcats-brackets">]</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgd061511" class="outline-3">
<h3 id="orgd061511"><span class="section-number-3">1.17.</span> <span class="todo TODO">TODO</span> Functional environment</h3>
<div class="outline-text-3" id="text-1-17">
<p>
There are use cases for kcats where you don't want a program to be
able to mess with external resources like files, network sockets etc
nor be able to spawn new threads, the program it's running should be a
pure function and this module lets you enforce that.
</p>
<div class='tangle-wrapper' data-tangle='src/kcats/stdlib/functional.kcats'><div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>pipe-in pipe-out channel timeout
 handoff file-in file-out timestamps
 standard serversocket animate future
 spit tunnel database<span class="org-kcats-brackets">]</span>
<span class="org-kcats-brackets">[</span><span class="org-function-name">wrap</span> unassign<span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span>
</pre>
</div></div>
</div>
</div>
</div>
<div id="outline-container-orgbe193e1" class="outline-2">
<h2 id="orgbe193e1"><span class="section-number-2">2.</span> Issues</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org460d4ae" class="outline-3">
<h3 id="org460d4ae"><span class="section-number-3">2.1.</span> <span class="done DONE">DONE</span> Get rid of platform-specific definitions</h3>
</div>
<div id="outline-container-orgd867e7a" class="outline-3">
<h3 id="orgd867e7a"><span class="section-number-3">2.2.</span> <span class="done DONE">DONE</span> fix evaluate</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span>program <span class="org-kcats-brackets">[</span>1 1 +<span class="org-kcats-brackets">]]]</span> environment evaluate <span class="org-kcats-brackets">[</span>stack<span class="org-kcats-brackets">]</span> lookup
</pre>
</div>

<pre class="example">

[[2]]
</pre>
</div>
</div>
