lexicon.org
** TODO merkle tree functions
#+begin_src kcats
"foo" "bar" join hash "foobar" hash =
#+end_src

#+RESULTS:
#+begin_src kcats
yes
#+end_src

First let's figure out how to represent a tree:

#+begin_src kcats
  ;[5 [[3 [[1c []]
  ;        [2c []]]]
  ;    [4 [[3c []]]]]]
  [[hash []]
   [children [second]]
   [data [first]]
   [node [[] pair]]
   [empty-node [#b64 "" hash node]]
   [child [[children] dip get]]
   [addchild [[pop] dip put put]]
   [rawpath [1 [interpose] shield swap prepend dropdown]]
   [siblings [[] node sink [addchild] dip addchild]]
   ;[path [[] [take swap [child] dip path] [drop] if]]
   [path [dec 2 radix rawpath]]
   [parent [butlast butlast]]
   [rehash [[children [data] map] shield
            [first] shield empty swap [join] step
            hash wrap [0] swap update]]
   ;; lopsidedtree n
   [balance []]
   ;; node tree cur-ct
   [add [[clone path [pop zero?] [parent] when] dipdown  ;; node tree path ct
         swapdown ;; node path tree ct
         []]]
   [add [[odd?]
         ;; insert an unbalanced node (empty sibling)
         [empty-node siblings [path parent]]
         ;; otherwise replace the empty sibling
         []
        ]]]
  ; ["" drop
  ;  ;[0 []] 1 node addchild 2 node 3 node addchild addchild
  ;  ;[1 0]  1 [interpose] shield swap put dropdown lookup
  ;  "foo"  hash node "bar"  hash node siblings
  ;  ;; update the root node
  ;  rehash
  ;  ; now add a new sibling
  ;  "baz"  hash node siblings
  ;  rehash
  ;  3 path [pop zero?] [butlast butlast] [] if
  ;  ;dump
  ;  ["quux" hash node siblings rehash ] update
  ; ]
  [["foo" "bar" "baz" "quux"] [node] map []
  let
#+end_src

#+RESULTS:
#+begin_src kcats
[["foo" []]
 ["bar" []]
 ["baz" []]
 ["quux" []]]
#+end_src

+ 1234
  + 12
    + 1
    + 2
  + 34
    + 3
    + 4

 + 5
 + 6
#+RESULTS:
#+begin_src kcats
  ["foobarbaz" [["foobar" [["foo" []]
                           ["bar" []]]]
                ["bazquux" [["baz" []]
                            ["quux" []]]]]]
  ["" []]
#+end_src

interpose impl
#+begin_src kcats
[1 3 4] [foo] unwrap interpose
#+end_src

#+RESULTS:
#+begin_src kcats
[1 foo 3 foo 4]
#+end_src

#+begin_src kcats
[0 [[1 []]
    [2 [[3 []]]]]]
  [1 0] 1 [interpose] shield swap prepend 0 put dropdown [inc] update
#+end_src

#+RESULTS:
#+begin_src kcats
[0 [[1 []]
    [2 [[4 []]]]]]
#+end_src

We need a function that, given a number n, gives the path in the
merkle tree. eg, 8 would be 1 1 1. Is it just =n-1= in binary?
6 would be 1 0 1. Ok so just write a function to expand binary digits:

#+begin_src kcats
8 dec 2 radix
#+end_src

#+RESULTS:
#+begin_src kcats
[1 1 1]
#+end_src

#+begin_src kcats
["foobarbaz" [["foobar" [["foo" []]
                         ["bar" []]]]
              ["baz" []]]] [1 1] [drop drop "hi" "there"] update
#+end_src

#+RESULTS:
#+begin_src kcats
["foobarbaz" [["foobar" [["foo" []]
                         ["bar" []]]]
              "there"]]
#+end_src

#+begin_src kcats
  [[hash []]
   [children [second]]
   [data [first]]
   [node [[] pair]]
   [child [[children] dip get]]
   [addchild [[pop] dip put put]]
   [siblings [[] node sink [addchild] dip addchild]]
   ;[path [[] [take swap [child] dip path] [drop] if]]
   [path [dec 2 radix nodepath]]
   [rehash [[children [data] map] shield [first] shield empty swap [join] step hash wrap [0] swap update]]]
  [["foobarbaz" [["foobar" [["foo" []]
                            ["bar" []]]]
                 ["baz" []]]]
   [1 1]

   ["bazquux" [["baz" []]
               ["quux" []]]]
   assign]
  let
#+end_src

#+RESULTS:
#+begin_src kcats
["foobarbaz" [["foobar" [["foo" []]
                         ["bar" []]]]
              ["bazquux" [["baz" []]
                          ["quux" []]]]]]
#+end_src

#+begin_src kcats
  [["bazquux" [["baz" []]
               ["quux" []]]]
   [1 1]
   ["foobarbaz" [["foobar" [["foo" []]
                            ["bar" []]]]
                 ["baz" []]]]]
  reverse unwrap assign
#+end_src

#+RESULTS:
#+begin_src kcats
["foobarbaz" [["foobar" [["foo" []]
                         ["bar" []]]]
              ["bazquux" [["baz" []]
                          ["quux" []]]]]]
#+end_src

#+begin_src kcats

  [
   [children [second]]
   [data [first]]
   [node [[] pair]]
   [addchild [[pop] dip put put]]
   [siblings [[] node sink [addchild] dip addchild]]
   [nodepath [1 [interpose] shield swap prepend dropdown]]
   [padded [[[[count] shield] dive -] dip
            swap repeat
            swap join]]
   [path [[dec 2 radix] dip 2 log ceiling 0 padded nodepath]] ;; item-ct index
   [depth []]

   [rehash [[children [data] map] shield
            [first] shield empty swap
            [join] step
            hash
            wrap [0] swap update]]
   [joiner [[2 2 partition
             [[count 1 =] [[] put] when
              unwrap siblings] each]
            assemble [rehash] map]]
   [merkle [[hash node] map
            [count 1 >] [joiner] while]]]
  [["a" "b" "c" "d" "e"]
   count
   5 ;; 2nd item
   swap path ]
  let
#+end_src

#+RESULTS:
#+begin_src kcats
[1 1 1 0 1 0]
#+end_src

#+RESULTS:
#+begin_src kcats
[[#b64 "FO3l6Ol62TcjJ3KPUJm5VgSjlZPKw704o0OtdiBSE+c=" [[#b64 "5aAf7hTg7VxIcU8iGA8lrYNltT+XefedxKPX6Tlj+Uo="
                                                        [[#b64 "ypeBEsobvcr6wjGzmiPcTaeG7/gUfE5yuYB3ha/uSLs=" []]
                                                         [#b64 "PiPoFgA5WUoziU9lZOGxNIu9egCI1CxKy3PurtWcAJ0=" []]]]
                                                       [#b64 "v/4LNNuha8b6wXwIusVdZ2ze1aSt5B/iyZJKXd6PPls=" [[#b64 "Ln0sA6lQeuJl7PW1NWiFpTOTogKdJBOUmXJloaJa78Y="
                                                                                                              []]
                                                                                                             [#b64 "GKw+c0PwFokMUQ6T+TUmEWnZ4/VlQ2Qpgw+vCTT0+OQ=" []]]]]]]
#+end_src

#+begin_src kcats
  [1 1 1] 5 0 [[[count] shield] dive -] dip
          swap repeat
          swap join
#+end_src

#+RESULTS:
#+begin_src kcats
[0 0 1 1 1]
#+end_src
