lexicon.html
<div id="outline-container-orga9e6e8c" class="outline-3">
<h3 id="orga9e6e8c"><span class="section-number-3">2.3.</span> <span class="todo TODO">TODO</span> merkle tree functions</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-kcats"><span class="org-string">"foo"</span> <span class="org-string">"bar"</span> <span class="org-function-name">join</span> hash <span class="org-string">"foobar"</span> hash =
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats">yes
</pre>
</div>

<p>
First let's figure out how to represent a tree:
</p>

<div class="org-src-container">
<pre class="src src-kcats"><span class="org-comment-delimiter">;</span><span class="org-comment">[5 [[3 [[1c []]</span>
<span class="org-comment-delimiter">;        </span><span class="org-comment">[2c []]]]</span>
<span class="org-comment-delimiter">;    </span><span class="org-comment">[4 [[3c []]]]]]</span>
<span class="org-kcats-brackets">[[</span>hash <span class="org-kcats-brackets">[]]</span>
 <span class="org-kcats-brackets">[</span>children <span class="org-kcats-brackets">[</span><span class="org-function-name">second</span><span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>data <span class="org-kcats-brackets">[</span><span class="org-function-name">first</span><span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>node <span class="org-kcats-brackets">[[]</span> pair<span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>empty-node <span class="org-kcats-brackets">[</span>#b64 <span class="org-string">""</span> hash node<span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>child <span class="org-kcats-brackets">[[</span>children<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> get<span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>addchild <span class="org-kcats-brackets">[[</span><span class="org-function-name">pop</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-function-name">put</span> <span class="org-function-name">put</span><span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>rawpath <span class="org-kcats-brackets">[</span>1 <span class="org-kcats-brackets">[</span>interpose<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> <span class="org-builtin">swap</span> prepend <span class="org-builtin">dropdown</span><span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>siblings <span class="org-kcats-brackets">[[]</span> node <span class="org-builtin">sink</span> <span class="org-kcats-brackets">[</span>addchild<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> addchild<span class="org-kcats-brackets">]]</span>
 <span class="org-comment-delimiter">;</span><span class="org-comment">[path [[] [take swap [child] dip path] [drop] if]]</span>
 <span class="org-kcats-brackets">[</span>path <span class="org-kcats-brackets">[</span>dec 2 radix rawpath<span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>parent <span class="org-kcats-brackets">[</span>butlast butlast<span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>rehash <span class="org-kcats-brackets">[[</span>children <span class="org-kcats-brackets">[</span>data<span class="org-kcats-brackets">]</span> <span class="org-function-name">map</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span>
          <span class="org-kcats-brackets">[</span><span class="org-function-name">first</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> empty <span class="org-builtin">swap</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span>
          hash <span class="org-function-name">wrap</span> <span class="org-kcats-brackets">[</span>0<span class="org-kcats-brackets">]</span> <span class="org-builtin">swap</span> update<span class="org-kcats-brackets">]]</span>
 <span class="org-comment-delimiter">;; </span><span class="org-comment">lopsidedtree n</span>
 <span class="org-kcats-brackets">[</span>balance <span class="org-kcats-brackets">[]]</span>
 <span class="org-comment-delimiter">;; </span><span class="org-comment">node tree cur-ct</span>
 <span class="org-kcats-brackets">[</span>add <span class="org-kcats-brackets">[[</span><span class="org-builtin">clone</span> path <span class="org-kcats-brackets">[</span><span class="org-function-name">pop</span> zero?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>parent<span class="org-kcats-brackets">]</span> when<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dipdown</span>  <span class="org-comment-delimiter">;; </span><span class="org-comment">node tree path ct</span>
       <span class="org-builtin">swapdown</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">node path tree ct</span>
       <span class="org-kcats-brackets">[]]]</span>
 <span class="org-kcats-brackets">[</span>add <span class="org-kcats-brackets">[[</span>odd?<span class="org-kcats-brackets">]</span>
       <span class="org-comment-delimiter">;; </span><span class="org-comment">insert an unbalanced node (empty sibling)</span>
       <span class="org-kcats-brackets">[</span>empty-node siblings <span class="org-kcats-brackets">[</span>path parent<span class="org-kcats-brackets">]]</span>
       <span class="org-comment-delimiter">;; </span><span class="org-comment">otherwise replace the empty sibling</span>
       <span class="org-kcats-brackets">[]</span>
      <span class="org-kcats-brackets">]]]</span>
<span class="org-comment-delimiter">; </span><span class="org-comment">["" drop</span>
<span class="org-comment-delimiter">;  </span><span class="org-comment">;[0 []] 1 node addchild 2 node 3 node addchild addchild</span>
<span class="org-comment-delimiter">;  </span><span class="org-comment">;[1 0]  1 [interpose] shield swap put dropdown lookup</span>
<span class="org-comment-delimiter">;  </span><span class="org-comment">"foo"  hash node "bar"  hash node siblings</span>
<span class="org-comment-delimiter">;  </span><span class="org-comment">;; update the root node</span>
<span class="org-comment-delimiter">;  </span><span class="org-comment">rehash</span>
<span class="org-comment-delimiter">;  </span><span class="org-comment">; now add a new sibling</span>
<span class="org-comment-delimiter">;  </span><span class="org-comment">"baz"  hash node siblings</span>
<span class="org-comment-delimiter">;  </span><span class="org-comment">rehash</span>
<span class="org-comment-delimiter">;  </span><span class="org-comment">3 path [pop zero?] [butlast butlast] [] if</span>
<span class="org-comment-delimiter">;  </span><span class="org-comment">;dump</span>
<span class="org-comment-delimiter">;  </span><span class="org-comment">["quux" hash node siblings rehash ] update</span>
<span class="org-comment-delimiter">; </span><span class="org-comment">]</span>
<span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> <span class="org-string">"bar"</span> <span class="org-string">"baz"</span> <span class="org-string">"quux"</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>node<span class="org-kcats-brackets">]</span> <span class="org-function-name">map</span> <span class="org-kcats-brackets">[]</span>
let
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> <span class="org-kcats-brackets">[]]</span>
 <span class="org-kcats-brackets">[</span><span class="org-string">"bar"</span> <span class="org-kcats-brackets">[]]</span>
 <span class="org-kcats-brackets">[</span><span class="org-string">"baz"</span> <span class="org-kcats-brackets">[]]</span>
 <span class="org-kcats-brackets">[</span><span class="org-string">"quux"</span> <span class="org-kcats-brackets">[]]]</span>
</pre>
</div>

<ul class="org-ul">
<li><p>
1234
</p>
<ul class="org-ul">
<li>12
<ul class="org-ul">
<li>1</li>
<li>2</li>
</ul></li>
<li>34
<ul class="org-ul">
<li>3</li>
<li>4</li>
</ul></li>
</ul>

<ul class="org-ul">
<li>5</li>
<li>6</li>
</ul></li>
</ul>
<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span><span class="org-string">"foobarbaz"</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"foobar"</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> <span class="org-kcats-brackets">[]]</span>
                         <span class="org-kcats-brackets">[</span><span class="org-string">"bar"</span> <span class="org-kcats-brackets">[]]]]</span>
              <span class="org-kcats-brackets">[</span><span class="org-string">"bazquux"</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"baz"</span> <span class="org-kcats-brackets">[]]</span>
                          <span class="org-kcats-brackets">[</span><span class="org-string">"quux"</span> <span class="org-kcats-brackets">[]]]]]]</span>
<span class="org-kcats-brackets">[</span><span class="org-string">""</span> <span class="org-kcats-brackets">[]]</span>
</pre>
</div>

<p>
interpose impl
</p>
<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>1 3 4<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>foo<span class="org-kcats-brackets">]</span> <span class="org-function-name">unwrap</span> interpose
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>1 foo 3 foo 4<span class="org-kcats-brackets">]</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>0 <span class="org-kcats-brackets">[[</span>1 <span class="org-kcats-brackets">[]]</span>
    <span class="org-kcats-brackets">[</span>2 <span class="org-kcats-brackets">[[</span>3 <span class="org-kcats-brackets">[]]]]]]</span>
  <span class="org-kcats-brackets">[</span>1 0<span class="org-kcats-brackets">]</span> 1 <span class="org-kcats-brackets">[</span>interpose<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> <span class="org-builtin">swap</span> prepend 0 <span class="org-function-name">put</span> <span class="org-builtin">dropdown</span> <span class="org-kcats-brackets">[</span>inc<span class="org-kcats-brackets">]</span> update
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>0 <span class="org-kcats-brackets">[[</span>1 <span class="org-kcats-brackets">[]]</span>
    <span class="org-kcats-brackets">[</span>2 <span class="org-kcats-brackets">[[</span>4 <span class="org-kcats-brackets">[]]]]]]</span>
</pre>
</div>

<p>
We need a function that, given a number n, gives the path in the
merkle tree. eg, 8 would be 1 1 1. Is it just <code>n-1</code> in binary?
6 would be 1 0 1. Ok so just write a function to expand binary digits:
</p>

<div class="org-src-container">
<pre class="src src-kcats">8 dec 2 radix
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>1 1 1<span class="org-kcats-brackets">]</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span><span class="org-string">"foobarbaz"</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"foobar"</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> <span class="org-kcats-brackets">[]]</span>
                         <span class="org-kcats-brackets">[</span><span class="org-string">"bar"</span> <span class="org-kcats-brackets">[]]]]</span>
              <span class="org-kcats-brackets">[</span><span class="org-string">"baz"</span> <span class="org-kcats-brackets">[]]]]</span> <span class="org-kcats-brackets">[</span>1 1<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-builtin">drop</span> <span class="org-string">"hi"</span> <span class="org-string">"there"</span><span class="org-kcats-brackets">]</span> update
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span><span class="org-string">"foobarbaz"</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"foobar"</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> <span class="org-kcats-brackets">[]]</span>
                         <span class="org-kcats-brackets">[</span><span class="org-string">"bar"</span> <span class="org-kcats-brackets">[]]]]</span>
              <span class="org-string">"there"</span><span class="org-kcats-brackets">]]</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span>hash <span class="org-kcats-brackets">[]]</span>
 <span class="org-kcats-brackets">[</span>children <span class="org-kcats-brackets">[</span><span class="org-function-name">second</span><span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>data <span class="org-kcats-brackets">[</span><span class="org-function-name">first</span><span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>node <span class="org-kcats-brackets">[[]</span> pair<span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>child <span class="org-kcats-brackets">[[</span>children<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> get<span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>addchild <span class="org-kcats-brackets">[[</span><span class="org-function-name">pop</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-function-name">put</span> <span class="org-function-name">put</span><span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>siblings <span class="org-kcats-brackets">[[]</span> node <span class="org-builtin">sink</span> <span class="org-kcats-brackets">[</span>addchild<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> addchild<span class="org-kcats-brackets">]]</span>
 <span class="org-comment-delimiter">;</span><span class="org-comment">[path [[] [take swap [child] dip path] [drop] if]]</span>
 <span class="org-kcats-brackets">[</span>path <span class="org-kcats-brackets">[</span>dec 2 radix nodepath<span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>rehash <span class="org-kcats-brackets">[[</span>children <span class="org-kcats-brackets">[</span>data<span class="org-kcats-brackets">]</span> <span class="org-function-name">map</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">first</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> empty <span class="org-builtin">swap</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span> hash <span class="org-function-name">wrap</span> <span class="org-kcats-brackets">[</span>0<span class="org-kcats-brackets">]</span> <span class="org-builtin">swap</span> update<span class="org-kcats-brackets">]]]</span>
<span class="org-kcats-brackets">[[</span><span class="org-string">"foobarbaz"</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"foobar"</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> <span class="org-kcats-brackets">[]]</span>
                          <span class="org-kcats-brackets">[</span><span class="org-string">"bar"</span> <span class="org-kcats-brackets">[]]]]</span>
               <span class="org-kcats-brackets">[</span><span class="org-string">"baz"</span> <span class="org-kcats-brackets">[]]]]</span>
 <span class="org-kcats-brackets">[</span>1 1<span class="org-kcats-brackets">]</span>

 <span class="org-kcats-brackets">[</span><span class="org-string">"bazquux"</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"baz"</span> <span class="org-kcats-brackets">[]]</span>
             <span class="org-kcats-brackets">[</span><span class="org-string">"quux"</span> <span class="org-kcats-brackets">[]]]]</span>
 assign<span class="org-kcats-brackets">]</span>
let
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span><span class="org-string">"foobarbaz"</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"foobar"</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> <span class="org-kcats-brackets">[]]</span>
                         <span class="org-kcats-brackets">[</span><span class="org-string">"bar"</span> <span class="org-kcats-brackets">[]]]]</span>
              <span class="org-kcats-brackets">[</span><span class="org-string">"bazquux"</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"baz"</span> <span class="org-kcats-brackets">[]]</span>
                          <span class="org-kcats-brackets">[</span><span class="org-string">"quux"</span> <span class="org-kcats-brackets">[]]]]]]</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span><span class="org-string">"bazquux"</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"baz"</span> <span class="org-kcats-brackets">[]]</span>
             <span class="org-kcats-brackets">[</span><span class="org-string">"quux"</span> <span class="org-kcats-brackets">[]]]]</span>
 <span class="org-kcats-brackets">[</span>1 1<span class="org-kcats-brackets">]</span>
 <span class="org-kcats-brackets">[</span><span class="org-string">"foobarbaz"</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"foobar"</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> <span class="org-kcats-brackets">[]]</span>
                          <span class="org-kcats-brackets">[</span><span class="org-string">"bar"</span> <span class="org-kcats-brackets">[]]]]</span>
               <span class="org-kcats-brackets">[</span><span class="org-string">"baz"</span> <span class="org-kcats-brackets">[]]]]]</span>
<span class="org-function-name">reverse</span> <span class="org-function-name">unwrap</span> assign
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span><span class="org-string">"foobarbaz"</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"foobar"</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"foo"</span> <span class="org-kcats-brackets">[]]</span>
                         <span class="org-kcats-brackets">[</span><span class="org-string">"bar"</span> <span class="org-kcats-brackets">[]]]]</span>
              <span class="org-kcats-brackets">[</span><span class="org-string">"bazquux"</span> <span class="org-kcats-brackets">[[</span><span class="org-string">"baz"</span> <span class="org-kcats-brackets">[]]</span>
                          <span class="org-kcats-brackets">[</span><span class="org-string">"quux"</span> <span class="org-kcats-brackets">[]]]]]]</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-kcats">
<span class="org-kcats-brackets">[</span>
 <span class="org-kcats-brackets">[</span>children <span class="org-kcats-brackets">[</span><span class="org-function-name">second</span><span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>data <span class="org-kcats-brackets">[</span><span class="org-function-name">first</span><span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>node <span class="org-kcats-brackets">[[]</span> pair<span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>addchild <span class="org-kcats-brackets">[[</span><span class="org-function-name">pop</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-function-name">put</span> <span class="org-function-name">put</span><span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>siblings <span class="org-kcats-brackets">[[]</span> node <span class="org-builtin">sink</span> <span class="org-kcats-brackets">[</span>addchild<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> addchild<span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>nodepath <span class="org-kcats-brackets">[</span>1 <span class="org-kcats-brackets">[</span>interpose<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> <span class="org-builtin">swap</span> prepend <span class="org-builtin">dropdown</span><span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>padded <span class="org-kcats-brackets">[[[[</span><span class="org-function-name">count</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span> -<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span>
          <span class="org-builtin">swap</span> repeat
          <span class="org-builtin">swap</span> <span class="org-function-name">join</span><span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>path <span class="org-kcats-brackets">[[</span>dec 2 radix<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> 2 log ceiling 0 padded nodepath<span class="org-kcats-brackets">]]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">item-ct index</span>
 <span class="org-kcats-brackets">[</span>depth <span class="org-kcats-brackets">[]]</span>

 <span class="org-kcats-brackets">[</span>rehash <span class="org-kcats-brackets">[[</span>children <span class="org-kcats-brackets">[</span>data<span class="org-kcats-brackets">]</span> <span class="org-function-name">map</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span>
          <span class="org-kcats-brackets">[</span><span class="org-function-name">first</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span> empty <span class="org-builtin">swap</span>
          <span class="org-kcats-brackets">[</span><span class="org-function-name">join</span><span class="org-kcats-brackets">]</span> <span class="org-function-name">step</span>
          hash
          <span class="org-function-name">wrap</span> <span class="org-kcats-brackets">[</span>0<span class="org-kcats-brackets">]</span> <span class="org-builtin">swap</span> update<span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>joiner <span class="org-kcats-brackets">[[</span>2 2 partition
           <span class="org-kcats-brackets">[[</span><span class="org-function-name">count</span> 1 =<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[]</span> <span class="org-function-name">put</span><span class="org-kcats-brackets">]</span> when
            <span class="org-function-name">unwrap</span> siblings<span class="org-kcats-brackets">]</span> each<span class="org-kcats-brackets">]</span>
          assemble <span class="org-kcats-brackets">[</span>rehash<span class="org-kcats-brackets">]</span> <span class="org-function-name">map</span><span class="org-kcats-brackets">]]</span>
 <span class="org-kcats-brackets">[</span>merkle <span class="org-kcats-brackets">[[</span>hash node<span class="org-kcats-brackets">]</span> <span class="org-function-name">map</span>
          <span class="org-kcats-brackets">[</span><span class="org-function-name">count</span> 1 &gt;<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span>joiner<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">while</span><span class="org-kcats-brackets">]]]</span>
<span class="org-kcats-brackets">[[</span><span class="org-string">"a"</span> <span class="org-string">"b"</span> <span class="org-string">"c"</span> <span class="org-string">"d"</span> <span class="org-string">"e"</span><span class="org-kcats-brackets">]</span>
 <span class="org-function-name">count</span>
 5 <span class="org-comment-delimiter">;; </span><span class="org-comment">2nd item</span>
 <span class="org-builtin">swap</span> path <span class="org-kcats-brackets">]</span>
let
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>1 1 1 0 1 0<span class="org-kcats-brackets">]</span>
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[[</span>#b64 <span class="org-string">"FO3l6Ol62TcjJ3KPUJm5VgSjlZPKw704o0OtdiBSE+c="</span> <span class="org-kcats-brackets">[[</span>#b64 <span class="org-string">"5aAf7hTg7VxIcU8iGA8lrYNltT+XefedxKPX6Tlj+Uo="</span>
                                                        <span class="org-kcats-brackets">[[</span>#b64 <span class="org-string">"ypeBEsobvcr6wjGzmiPcTaeG7/gUfE5yuYB3ha/uSLs="</span> <span class="org-kcats-brackets">[]]</span>
                                                         <span class="org-kcats-brackets">[</span>#b64 <span class="org-string">"PiPoFgA5WUoziU9lZOGxNIu9egCI1CxKy3PurtWcAJ0="</span> <span class="org-kcats-brackets">[]]]]</span>
                                                       <span class="org-kcats-brackets">[</span>#b64 <span class="org-string">"v/4LNNuha8b6wXwIusVdZ2ze1aSt5B/iyZJKXd6PPls="</span> <span class="org-kcats-brackets">[[</span>#b64 <span class="org-string">"Ln0sA6lQeuJl7PW1NWiFpTOTogKdJBOUmXJloaJa78Y="</span>
                                                                                                              <span class="org-kcats-brackets">[]]</span>
                                                                                                             <span class="org-kcats-brackets">[</span>#b64 <span class="org-string">"GKw+c0PwFokMUQ6T+TUmEWnZ4/VlQ2Qpgw+vCTT0+OQ="</span> <span class="org-kcats-brackets">[]]]]]]]</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>1 1 1<span class="org-kcats-brackets">]</span> 5 0 <span class="org-kcats-brackets">[[[</span><span class="org-function-name">count</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">shield</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dive</span> -<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span>
        <span class="org-builtin">swap</span> repeat
        <span class="org-builtin">swap</span> <span class="org-function-name">join</span>
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>0 0 1 1 1<span class="org-kcats-brackets">]</span>
</pre>
</div>
</div>
</div>
