lexicon.org
** CANCELED Make taker/dropper more flexible
Goal: implement drop and drop-while with the same logic

Canceled - the commonality between drop and drop-while are too small to be worth trying to factor out.

#+begin_src kcats
  [1 2 3 4 5] [take]
  3
  [[[positive?]
    [[generate drop] dip dec]
    while
    [generate swap] dip float]
   bail]
  collect
#+end_src

#+RESULTS:
#+begin_src kcats
[4 5]
[[[positive?] [[generate drop]
               dip dec]
  while [generate swap]
  dip float]
 bail]
0 [take] []
#+end_src


This is what drop-while looks like
#+begin_src kcats
  [] [take]
  [positive?]
  [] ;; the state (whether threshold reached)
  [[] ;; condition - whether we've finished dropping or not 
   [[generate] divedown] ;; true - pass everything else through
   [[[generate] divedown] ;; prime init
    [[[clone] divedown execute] bail] ;; bring pred up and exec it
    [drop] ;; if pred passes drop the value
    prime ;; after this should have value on top
    [drop true] dip ;; set flag
   ] ;; false - generate, check pred, repeat
   if]
  collect
#+end_src

#+RESULTS:
#+begin_src kcats
[] [[] [[generate] divedown]
    [[[generate] divedown]
     [[[clone] divedown execute] bail]
     [drop] prime [drop yes]
     dip]
    if]
yes [positive?] [take] []
#+end_src
