lexicon.html
<div id="outline-container-org5b439fa" class="outline-3">
<h3 id="org5b439fa"><span class="section-number-3">2.4.</span> <span class="done CANCELED">CANCELED</span> Make taker/dropper more flexible</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Goal: implement drop and drop-while with the same logic
</p>

<p>
Canceled - the commonality between drop and drop-while are too small to be worth trying to factor out.
</p>

<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>1 2 3 4 5<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span>
3
<span class="org-kcats-brackets">[[[</span>positive?<span class="org-kcats-brackets">]</span>
  <span class="org-kcats-brackets">[[</span>generate <span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> dec<span class="org-kcats-brackets">]</span>
  <span class="org-preprocessor">while</span>
  <span class="org-kcats-brackets">[</span>generate <span class="org-builtin">swap</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-builtin">float</span><span class="org-kcats-brackets">]</span>
 bail<span class="org-kcats-brackets">]</span>
collect
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[</span>4 5<span class="org-kcats-brackets">]</span>
<span class="org-kcats-brackets">[[[</span>positive?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[[</span>generate <span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span>
               <span class="org-preprocessor">dip</span> dec<span class="org-kcats-brackets">]</span>
  <span class="org-preprocessor">while</span> <span class="org-kcats-brackets">[</span>generate <span class="org-builtin">swap</span><span class="org-kcats-brackets">]</span>
  <span class="org-preprocessor">dip</span> <span class="org-builtin">float</span><span class="org-kcats-brackets">]</span>
 bail<span class="org-kcats-brackets">]</span>
0 <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]</span>
</pre>
</div>


<p>
This is what drop-while looks like
</p>
<div class="org-src-container">
<pre class="src src-kcats"><span class="org-kcats-brackets">[]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span>
<span class="org-kcats-brackets">[</span>positive?<span class="org-kcats-brackets">]</span>
<span class="org-kcats-brackets">[]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">the state (whether threshold reached)</span>
<span class="org-kcats-brackets">[[]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">condition - whether we've finished dropping or not </span>
 <span class="org-kcats-brackets">[[</span>generate<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">divedown</span><span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">true - pass everything else through</span>
 <span class="org-kcats-brackets">[[[</span>generate<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">divedown</span><span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">prime init</span>
  <span class="org-kcats-brackets">[[[</span><span class="org-builtin">clone</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">divedown</span> <span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> bail<span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">bring pred up and exec it</span>
  <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">if pred passes drop the value</span>
  prime <span class="org-comment-delimiter">;; </span><span class="org-comment">after this should have value on top</span>
  <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> <span class="org-keyword">true</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">dip</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">set flag</span>
 <span class="org-kcats-brackets">]</span> <span class="org-comment-delimiter">;; </span><span class="org-comment">false - generate, check pred, repeat</span>
 <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]</span>
collect
</pre>
</div>

<div class="org-src-container results">
<pre class="src src-kcats"><span class="org-kcats-brackets">[]</span> <span class="org-kcats-brackets">[[]</span> <span class="org-kcats-brackets">[[</span>generate<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">divedown</span><span class="org-kcats-brackets">]</span>
    <span class="org-kcats-brackets">[[[</span>generate<span class="org-kcats-brackets">]</span> <span class="org-preprocessor">divedown</span><span class="org-kcats-brackets">]</span>
     <span class="org-kcats-brackets">[[[</span><span class="org-builtin">clone</span><span class="org-kcats-brackets">]</span> <span class="org-preprocessor">divedown</span> <span class="org-preprocessor">execute</span><span class="org-kcats-brackets">]</span> bail<span class="org-kcats-brackets">]</span>
     <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span><span class="org-kcats-brackets">]</span> prime <span class="org-kcats-brackets">[</span><span class="org-builtin">drop</span> yes<span class="org-kcats-brackets">]</span>
     <span class="org-preprocessor">dip</span><span class="org-kcats-brackets">]</span>
    <span class="org-preprocessor">if</span><span class="org-kcats-brackets">]</span>
yes <span class="org-kcats-brackets">[</span>positive?<span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[</span><span class="org-function-name">take</span><span class="org-kcats-brackets">]</span> <span class="org-kcats-brackets">[]</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Skyrod Vactai</p>
<p class="date">Created: 2024-10-10 Thu 15:52</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
